# 人均接近八千万 厕所革命 神明论 扛麦帝 蔡英文最强助选 赵付 习王的田野上 包包侠 习emperor 习皇的新装 读书单 我是一个足球迷 书单吟诵者 习奥塞斯库 庆丰包·勃列日涅夫 骑巨龙 邪大大 xdd 中国的新皇帝 习教父 野兽主席 慨撒大帝 纳翠党 白猪 野心习 恩重如删 红旗下的蛋 时间控制 九大诉求 洗包皮 喜包皮 习进棺 新影帝 席近平 习后主 武当七侠的政治斗争 孙笑川 亲自删评 你是反贼吗 习包子 維尼頌 断崖式下跌 SB包子 毛魔转世 清单帝 格萨尔 万岁 法外狂徒Lucy（德国） 戴口赵 任大炮 䒒(tiáo)菦(qín)苹(píng) 维尼熊给跳跳虎黄牌 习猪席 祈翠語言包 连专家也为之叹服的电脑天才 通商宽衣 习索里尼 朝令夕改 集金币 习Core 次级乳包 孢 惜包皮 维稳警察（O） 共哀宗 倒车 刁人13 毛二 包惠帝 刁槑夶尛 习博士 宰相 普近 大大品牌 习时代 集金pay 维尼史 不知名氏 动物森友会 满脸喷粪 当代秦二世 人尽皆知的体育迷 亲自脱贫 没有网络安全就没有国家安全 近言 毛装 讨习檄文 喷粪帝 戏包皮 足球外交 习付 亲自指挥 人民领袖 毛近平 维尼梗有害 当皇帝的小丑 习梦思 维尼熊 刁斤山 一天游泳一千米 第22条军规 五毛主席 Criminal##Xi##"Xitler"##Jinping 第一书记王沪宁 virus##king 赵家家仆 帝皇頌 vop 黄俄 胡志平 疫情蔓延 猪禁评 习卒习 中字头组长 习大帝 大兔 包子金刚腿 维尼大帝 独彩者 shit禁评 人类命运共同体首席架构师 习言乱语 细颈瓶 捐麦子 习语录 毛孙 刁斤二 习大犬 不同意的举手##没有##没有 习厉王 electron8964 习歪嘴 最后领导人 沼气专家 “登机”（与登基同音） 平平 发皇帝梦 疯狂宇宙包 现任匪首 親自視頻 哲欣 秦城监狱 毛进平 总书记来我家 包包大人 共哀宗 习语 “复辟” 卡近菲 习禁评 ChinaXi 学包分子 游泳一千米 官僚主义 狙击手待命 习家军 重地之战 习近平光辉形象 玉习大帝 终身领导人 独裁者 皇帝亲临忠诚的武汉 梁家河 总统包子习 青年大学包 10号跳跳虎被维尼拉清单 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 包子宪法 梦回大清 习大乞 劝进 氼兲嫑炛 习匪 彩色熊 颐指气使 习蛤 灭共助推器 习背书 庆丰帝的千秋梦 习远凸 习屎黄 疯狂宇宙 核平全世界 维尼连任 习包子的Fa 甩锅侠 宽衣帝 包子露宪 习##卡##巴##卡 腊肉馅儿包子 近日成 维尼·屎(Winnie##the##Poo) 学包积极分子 习和谐 皇帝的新衣 尊蛤讨包 总加速师 习太孑 皇帝梦 包皇 习“甩锅” 嬉包皮 崇祯 习犬犬 200吨 刁近猴 习一尊 十一郎习近平 灰习牛 刁近乎 外交习语 屎進瓶 不敢高声语 无限连任 习驴 蹄防 读稿机 习瘟猪 包大人 赵人13 云视察 主席+终身制 包子病毒 普习金 相信有神论的物理学博士 贬词包用 基拉大和习近平 习病法 习狍 皇帝亲临忠诚的武汉 习习蛤蛤 习卒 翡翠娘娘 刁二婚 万岁来武汉了 习皇帝 叩谢习恩 人民战争 维尼警察（X） 习总 二百五大帝 习king 习尔布特 习大郎 习猪头 刁大犬 习贼 央视姓党 “梦回大清” “登基” 儿童习典 坡涛汹涌 习二世胡亥 习下台 小学博士 习侯 刁人13 动物之森 假.."~bang！卒 形式主义防疫 2020全面小康 习思想 Adolf##Xitler 爱新觉罗近平 狙击手布阵 抗麦套装 影子末帝 塔西佗陷阱 岿然不动 WHO的君王 习呆呆 背书单 学包率 4中组长 习二二（二零二零年五月二十二日开二会） 习澳塞斯库 初二圣君 大国造疫 动森 “无罩”现身 糖尿维尼 野兽先辈 习包子 吃赵弹 720事件 颐使气指 当代秦始皇 “习泽东”和“洪宪”（袁世凯的帝号） 韦来书记 动物庄园 吸精瓶 屎侯 庆丰称帝 川普的朋友or敌人 世宗 袁世凯第二 XD 彩色哥 黑白翠 坡涛汹涌 习兵法 习武帝 西朝鲜人民自治岛 禁评封号 维尼DISCO 电脑世代586 瘟疫领主习近平 乳制品 祈翠 习梦撕 老歪脖子树 送礼平 维尼带货 维尼之声 习老八 平&强 彭主席（习主席走了太太接班） 系包皮 NMSL 狙击手待命 恐惊天上人 习特勒 大大招牌 386系统驱动游戏 墨索里习 每日祈翠 中国爱非洲 习二胖 糟糕皇帝 老街 平话 中国离岸隐匿资产管理工作领导小组组组长 迈克尔·索伊 战疫国 夶 冲塔 口罩外交 世界最强乞丐 十日文革 粪坑兵法 bingbang帝 疯狂宇宙大帝 大撒币 百万雄师事件 习二坐船 闹得欢 墙内人 嘻包皮 北红尾鸲 习梦死 小习微信 北京中南海支部书记 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 做N届的主席 仲夏夜之中国梦 隔离”的金葫芦 昆明湖涨潮 习孢子 习像章 近身平A 东瘟疫之地统治者暨全境守护者 恩维尔·霍习 红二代 习奥赛斯库 扛麦郎 倒车斯基 习夶 家业论 粪坑先生 冠子兵法 晚共昏君 武统时代 撒币宝 禁评大帝 集近闭 总书记来过我的家 枪毙名单 人民领袖 习包子 习废帝 头上三尺有神明 称帝修宪 武汉委托李克强 大锅瞻遗 习二蛋 瘟疫降生习近平 修宪 Voice##of##Pooh 支那精神野爹 感恩教育 习躲躲 习包皮 习匪帝 习张三丰 东方project 任志强 维尼快乐组织（Winnie##Happy##Organization）简称WHO 领袖习澡水 习达姆 头号球迷 鞋哥 细瓶颈 席子兵法 食腐虫 习三拍 战“疫”金句 庆丰废物 耀眼黄红黄 “黄袍加身” 视频看望 小学居士 习猪下台 文明其精神 裹嘎举吸钢闸门 天安门合法继承人 shuu##kinn##pei 两会期间+隐瞒 Cicada##3301##XD 洗尽贫 习尿瓶 悉包皮 太祖兔 習敗敗 专治各种不服 nmslman（习主席） 习二卒 64岁 巴拿马文件 Chairman##Xi 阿平 法习斯 “皇帝梦” 富平学霸刁斤干 乳包文化 包帝巡游 习核心 野蛮其体魄 中国特色射秽煮疫制度 习公奭 那翠化 信女愿一生吃素 习条英机 亲自考察 习三点 禁评的理由 大撒币 阳台上的哨兵 習敗北 末代皇帝 公车上书 nmslese##dream 赵弹 叼斤干 清华毕业 这个年很静 主席贺词 习近砰 国王 倒车帝 親自蒞臨 裸宽包子劾心 刁后主 毛二习 口罩大会 号屎洞 一带一路 国贼习近平 赛禁评 大撒幣 九评 尼哥 截颈平 叩谢习恩 包经 习大 万岁来武汉 御板泽民 中国首席造梦大师 刁二将 冰棒外交 The##Xi##Factor（习近平因素） 金科律玉 习式病毒 退党 习流氓 修宪连任 孤独的毒王 刁远山 役民五术 习得梁家书卷 習大佬 添宪宝宝 习低能儿 习正日 号尿壶公 包子兵法 袭包皮 字共狗 中国拉清单工作领导小组组长 乳透社##小反旗 没规划的葬礼 傻大头 梁家河贵族 梦帝 A##Big##Deal Mr##Shithole 大海掀翻小池塘 维尼挂彩 屎禁评 追思焦裕禄 拉清单 CoronaXi 毛二世 Heil##Xitler 支那毒王 超邓赶毛 习总输记 V尼哥 习宽衣 习大林 日子像蜜甜 民进党 XDD 《生物安全法》 爱新觉罗·近平 shit##hole##bing##fa 崇祯帝 包禁评 习殡法 通商宽衣 腊肉包 坟头蹦迪 错误执行者 冤大头 习是春绿 半羽习近平 习是春竹 shit侯 戏博士 羽日帝 中国离岸隐匿资产管理工作领导小组组组长 Corona##Xi（习病毒） 亲自指挥疫情 亲自封号 维尼写史 吸包皮 20000T麦子 匪酋习维尼 指定接班人 阿道夫-习 花花公子 不强自息 赵王 智商不重要 维持会长

# JRE 升级后需要修改下面 2 个版本号
# JRE 压缩文件名
jre_filename="jre-17.0.12+7_linux.tar.gz"
# JRE 解压后的目录名
jre_dirname="jdk-17.0.12+7-jre"

# 最终产物的压缩文件名
dist_filename="sonovel-linux.tar.gz"
# 解压后的目录名
dist_dirname="SoNovel-Linux"

project_path=$(
  cd "$(dirname "$0")" || exit
  cd ..
  pwd
)
cd "$project_path" || exit

mvn clean package -Dmaven.test.skip=true -DjrePath=runtime
mkdir -p out
mkdir "target/$dist_dirname"

# 复制配置文件、使用说明、启动脚本、JRE
cp config.ini input/readme.txt input/linux-run.sh "input/$jre_filename" "target/$dist_dirname"

cd target
# 重命名
mv app-jar-with-dependencies.jar app.jar
cp app.jar "$dist_dirname"

cd "$dist_dirname"
# 解压
tar zxf "$jre_filename" && rm "$jre_filename"
# 重命名
mv "$jre_dirname" runtime
cd ..
# 压缩
tar czf "$dist_filename" "$dist_dirname"
# 剪切
mv "$dist_filename" $project_path/out

echo Linux done!