# 你是反贼吗 普近 禁评的理由 习老八 吸包皮 迈克尔·索伊 “黄袍加身” 习梦死 大锅瞻遗 平平 御板泽民 没有网络安全就没有国家安全 习宽衣 不知名氏 孙笑川 万岁来武汉 粪坑兵法 习病法 “梦回大清” 梁家河 习太孑 习思想 习兵法 人民领袖 习总 阿平 字共狗 支那精神野爹 习蛤 习梦思 总书记来过我的家 赵王 总统包子习 习匪 倒车斯基 彩色熊 沼气专家 爱新觉罗近平 学包积极分子 习包子的Fa “登基” 祈翠 皇帝梦 习“甩锅” 五毛主席 包皇 集金币 晚共昏君 断崖式下跌 腊肉馅儿包子 XD 10号跳跳虎被维尼拉清单 习像章 口罩外交 贬词包用 头号球迷 智商不重要 民进党 ChinaXi 国贼习近平 中国爱非洲 戴口赵 朝令夕改 NMSL Chairman##Xi 白猪 金科律玉 平话 共哀宗 200吨 “皇帝梦” 习流氓 糟糕皇帝 独裁者 包子兵法 习式病毒 号屎洞 狙击手布阵 习猪席 公车上书 庆丰帝的千秋梦 羽日帝 维尼连任 virus##king 翡翠娘娘 猪禁评 习厉王 习低能儿 近身平A 4中组长 亲自封号 二百五大帝 一天游泳一千米 Adolf##Xitler 包经 习奥塞斯库 现任匪首 西朝鲜人民自治岛 席近平 习瘟猪 习侯 习得梁家书卷 细颈瓶 親自蒞臨 nmslese##dream 刁后主 720事件 习大帝 习张三丰 红二代 中国首席造梦大师 中字头组长 书单吟诵者 习奥赛斯库 连专家也为之叹服的电脑天才 裹嘎举吸钢闸门 红旗下的蛋 习三拍 平&强 厕所革命 2020全面小康 20000T麦子 刁大犬 领袖习澡水 清华毕业 劝进 维尼史 嘻包皮 bingbang帝 386系统驱动游戏 乳透社##小反旗 习呆呆 央视姓党 习特勒 习包子 習敗北 shit##hole##bing##fa 恐惊天上人 习二蛋 习公奭 花花公子 国王 当代秦始皇 叩谢习恩 维尼大帝 野兽先辈 习卒 祈翠語言包 包禁评 蹄防 中国离岸隐匿资产管理工作领导小组组组长 刁槑夶尛 人均接近八千万 重地之战 喷粪帝 我是一个足球迷 追思焦裕禄 扛麦郎 文明其精神 读稿机 叼斤干 背书单 感恩教育 Heil##Xitler 吸精瓶 枪毙名单 维尼熊 包惠帝 孢 戏包皮 习博士 包包大人 习Core 尼哥 讨习檄文 通商宽衣 甩锅侠 維尼頌 Voice##of##Pooh 习背书 shit侯 抗麦套装 习包子 习近砰 习大犬 V尼哥 冲塔 习习蛤蛤 毛二 蔡英文最强助选 修宪 疫情蔓延 鞋哥 黑白翠 维尼DISCO 习狍 昆明湖涨潮 习皇的新装 维尼熊给跳跳虎黄牌 shit禁评 十一郎习近平 头上三尺有神明 近言 赵弹 武当七侠的政治斗争 维稳警察（O） 习卒习 庆丰包·勃列日涅夫 屎進瓶 戏博士 梦回大清 称帝修宪 习是春竹 疯狂宇宙大帝 包包侠 那翠化 武统时代 韦来书记 习家军 尊蛤讨包 半羽习近平 习总输记 大撒币 习二二（二零二零年五月二十二日开二会） 最后领导人 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 足球外交 习禁评 习达姆 习皇帝 通商宽衣 新影帝 叩谢习恩 疯狂宇宙包 狙击手待命 指定接班人 习索里尼 送礼平 亲自考察 包子病毒 维尼挂彩 SB包子 疯狂宇宙 满脸喷粪 禁评大帝 洗包皮 粪坑先生 习尔布特 习emperor 不强自息 刁人13 共哀宗 野兽主席 习二卒 百万雄师事件 巴拿马文件 毛二习 孤独的毒王 shuu##kinn##pei 习近平光辉形象 腊肉包 坟头蹦迪 野心习 爱新觉罗·近平 庆丰称帝 小学居士 大海掀翻小池塘 习殡法 习一尊 主席贺词 親自視頻 系包皮 毛装 动物森友会 集近闭 习猪下台 阿道夫-习 武汉委托李克强 第22条军规 赵付 瘟疫领主习近平 拉清单 习武帝 习大乞 习猪头 十日文革 刁斤山 专治各种不服 这个年很静 黄俄 习下台 外交习语 一带一路 胡志平 electron8964 “无罩”现身 洗尽贫 赛禁评 做N届的主席 相信有神论的物理学博士 亲自脱贫 嬉包皮 维尼带货 毛孙 九评 游泳一千米 东方project “登机”（与登基同音） 动物庄园 动物之森 不敢高声语 刁二婚 习正日 大国造疫 xdd 习语 《生物安全法》 学包率 人民战争 维尼快乐组织（Winnie##Happy##Organization）简称WHO 刁近猴 万岁来武汉了 玉习大帝 习夶 撒币宝 川普的朋友or敌人 神明论 骑巨龙 亲自删评 习后主 邪大大 假.."~bang！卒 习包皮 习大林 灰习牛 习梦撕 不同意的举手##没有##没有 维尼梗有害 核平全世界 习匪帝 当代秦二世 灭共助推器 总加速师 动森 亲自指挥 习犬犬 人类命运共同体首席架构师 袁世凯第二 中国的新皇帝 修宪连任 习是春绿 包子宪法 习核心 役民五术 中国拉清单工作领导小组组长 人民领袖 裸宽包子劾心 乳制品 赵家家仆 习包子 坡涛汹涌 大大品牌 阳台上的哨兵 末代皇帝 习和谐 包子露宪 vop 习付 刁二将 塔西佗陷阱 岿然不动 云视察 崇祯 梁家河贵族 食腐虫 中国特色射秽煮疫制度 屎侯 习大 习歪嘴 习躲躲 彭主席（习主席走了太太接班） 信女愿一生吃素 習大佬 没规划的葬礼 支那毒王 毛魔转世 倒车 世界最强乞丐 皇帝亲临忠诚的武汉 乳包文化 习贼 两会期间+隐瞒 隔离”的金葫芦 习教父 维尼写史 习二坐船 坡涛汹涌 战“疫”金句 “习泽东”和“洪宪”（袁世凯的帝号） 冠子兵法 独彩者 狙击手待命 颐使气指 纳翠党 东瘟疫之地统治者暨全境守护者 习屎黄 皇帝亲临忠诚的武汉 冰棒外交 毛进平 恩重如删 瘟疫降生习近平 帝皇頌 总书记来我家 世宗 习王的田野上 细瓶颈 习尿瓶 添宪宝宝 扛麦帝 大撒币 发皇帝梦 习大郎 WHO的君王 终身领导人 法外狂徒Lucy（德国） 习进棺 卡近菲 刁近乎 Cicada##3301##XD 小习微信 维尼警察（X） 惜包皮 冤大头 亲自指挥疫情 万岁 CoronaXi 赵人13 糖尿维尼 宽衣帝 习时代 吃赵弹 屎禁评 当皇帝的小丑 颐指气使 席子兵法 青年大学包 人尽皆知的体育迷 截颈平 宰相 崇祯帝 慨撒大帝 儿童习典 刁远山 号尿壶公 老歪脖子树 九大诉求 普习金 习二世胡亥 倒车帝 退党 形式主义防疫 喜包皮 毛二世 习废帝 习条英机 習敗敗 读书单 仲夏夜之中国梦 野蛮其体魄 习语录 习孢子 集金pay 初二圣君 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 包帝巡游 64岁 家业论 包子金刚腿 氼兲嫑炛 无限连任 大兔 太祖兔 主席+终身制 刁斤二 禁评封号 梦帝 超邓赶毛 任志强 恩维尔·霍习 北红尾鸲 天安门合法继承人 捐麦子 清单帝 习king 耀眼黄红黄 北京中南海支部书记 秦城监狱 每日祈翠 彩色哥 The##Xi##Factor（习近平因素） 墙内人 庆丰废物 夶 袭包皮 习言乱语 视频看望 皇帝的新衣 次级乳包 习驴 第一书记王沪宁 富平学霸刁斤干 官僚主义 基拉大和习近平 nmslman（习主席） 维尼之声 任大炮 老街 习远凸 维尼·屎(Winnie##the##Poo) 维持会长 闹得欢 大大招牌 毛近平 A##Big##Deal 日子像蜜甜 学包分子 中国离岸隐匿资产管理工作领导小组组组长 习##卡##巴##卡 匪酋习维尼 哲欣 䒒(tiáo)菦(qín)苹(píng) 习三点 近日成 墨索里习 刁人13 XDD 习二胖 错误执行者 Criminal##Xi##"Xitler"##Jinping 战疫国 电脑世代586 Mr##Shithole 格萨尔 法习斯 大撒幣 傻大头 “复辟” 悉包皮 口罩大会 Corona##Xi（习病毒） 习澳塞斯库 影子末帝 时间控制 小学博士 包大人

# launch4j-maven-plugin 仅支持 windows，mvn package 触发

# JRE 升级后需要修改下面 2 个版本号
# JRE 压缩文件名
jre_filename="jre-17.0.11+9-x64_windows.tar.gz"
# JRE 解压后的目录名
jre_dirname="jdk-17.0.11+9-jre"

# 压缩包文件名
artifacts="sonovel-windows.tar.gz"
# -DskipTests：不执行测试用例。-Dmaven.test.skip=true：不执行测试用例，也不编译测试用例类
maven_command="mvn clean package -Dmaven.test.skip=true -DjrePath=runtime"

# 项目根目录，根据当前文件所在路径获取相对路径
project_path=$(
  cd "$(dirname "$0")" || exit
  cd ..
  pwd
)
cd "$project_path" || exit
# -p 表示：如果存在则没有错误，根据需要创建父目录
mkdir -p out/

$maven_command
# 拷贝配置文件、使用说明
cp config.ini input/readme.txt target/SoNovel
# 拷贝环境依赖（JRE）
cp "input/$jre_filename" target/SoNovel

cd target/SoNovel
tar zxf "$jre_filename" && rm "$jre_filename"
mv "$jre_dirname" runtime
cd ..
tar czf $artifacts SoNovel
mv $artifacts $project_path/out

echo Windows done!