# 赵弹 习包子的Fa 添宪宝宝 昆明湖涨潮 倒车斯基 裸宽包子劾心 习孢子 东方project 不强自息 习大帝 游泳一千米 习奥赛斯库 习尔布特 朝令夕改 灭共助推器 親自視頻 习犬犬 习三点 大锅瞻遗 习emperor 金科律玉 “皇帝梦” 刁斤山 习三拍 A##Big##Deal 维尼快乐组织（Winnie##Happy##Organization）简称WHO 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 一带一路 刁二将 virus##king 武当七侠的政治斗争 Voice##of##Pooh 维尼挂彩 维尼DISCO 習敗北 黑白翠 恐惊天上人 彩色熊 包包大人 卡近菲 皇帝的新衣 10号跳跳虎被维尼拉清单 枪毙名单 动森 坡涛汹涌 法习斯 狙击手待命 习梦死 包子金刚腿 习大乞 读稿机 xdd SB包子 尼哥 中字头组长 洗尽贫 庆丰称帝 灰习牛 “复辟” ChinaXi 视频看望 叩谢习恩 习和谐 冲塔 法外狂徒Lucy（德国） 刁后主 习一尊 迈克尔·索伊 五毛主席 习尿瓶 韦来书记 Heil##Xitler 主席+终身制 XD 袭包皮 现任匪首 崇祯 骑巨龙 倒车 纳翠党 习老八 习梦撕 那翠化 野心习 夶 格萨尔 神明论 疯狂宇宙包 习言乱语 习张三丰 十日文革 维尼熊 这个年很静 瘟疫降生习近平 亲自脱贫 瘟疫领主习近平 习瘟猪 习皇的新装 老歪脖子树 亲自指挥疫情 人类命运共同体首席架构师 背书单 平&强 包皇 习大犬 外交习语 重地之战 亲自删评 赵付 禁评封号 狙击手布阵 XDD 疯狂宇宙 习猪头 吃赵弹 爱新觉罗·近平 庆丰帝的千秋梦 新影帝 刁大犬 小学居士 独裁者 错误执行者 野兽主席 我是一个足球迷 红二代 氼兲嫑炛 中国离岸隐匿资产管理工作领导小组组组长 每日祈翠 连专家也为之叹服的电脑天才 九大诉求 专治各种不服 沼气专家 总书记来我家 阳台上的哨兵 口罩大会 习king 习兵法 习梦思 厕所革命 习总输记 毛二 国王 腊肉馅儿包子 九评 大国造疫 中国的新皇帝 耀眼黄红黄 親自蒞臨 阿道夫-习 屎禁评 不敢高声语 号屎洞 习屎黄 影子末帝 习Core 感恩教育 袁世凯第二 戴口赵 习索里尼 习语 The##Xi##Factor（习近平因素） 皇帝梦 习禁评 大海掀翻小池塘 赛禁评 维尼大帝 习背书 颐使气指 黄俄 人尽皆知的体育迷 闹得欢 维尼·屎(Winnie##the##Poo) 狙击手待命 nmslman（习主席） 细颈瓶 梦帝 习二世胡亥 食腐虫 岿然不动 百万雄师事件 总加速师 近日成 习得梁家书卷 习澳塞斯库 大撒幣 刁槑夶尛 維尼頌 足球外交 悉包皮 维尼史 习蛤 习殡法 蹄防 屎侯 戏包皮 讨习檄文 庆丰废物 刁二婚 两会期间+隐瞒 赵王 720事件 隔离”的金葫芦 平话 万岁来武汉 大兔 学包分子 断崖式下跌 习时代 习公奭 Criminal##Xi##"Xitler"##Jinping 席近平 当皇帝的小丑 习思想 邪大大 刁人13 孤独的毒王 腊肉包 习特勒 “梦回大清” 红旗下的蛋 任志强 习匪 包惠帝 爱新觉罗近平 孢 䒒(tiáo)菦(qín)苹(píng) 刁近猴 习侯 翡翠娘娘 称帝修宪 头上三尺有神明 习付 习猪下台 劝进 一天游泳一千米 刁斤二 彭主席（习主席走了太太接班） 习“甩锅” 清单帝 维持会长 洗包皮 习包子 没有网络安全就没有国家安全 nmslese##dream 习匪帝 维尼写史 人均接近八千万 习夶 赵家家仆 习是春绿 野兽先辈 时间控制 系包皮 “登基” 集金币 送礼平 包子病毒 次级乳包 中国特色射秽煮疫制度 惜包皮 不知名氏 乳制品 刁远山 嘻包皮 CoronaXi Adolf##Xitler 慨撒大帝 4中组长 北红尾鸲 shit禁评 习病法 东瘟疫之地统治者暨全境守护者 祈翠語言包 当代秦二世 大大品牌 习式病毒 云视察 200吨 扛麦郎 糟糕皇帝 大大招牌 坟头蹦迪 基拉大和习近平 甩锅侠 墙内人 戏博士 民进党 疯狂宇宙大帝 无限连任 帝皇頌 国贼习近平 乳包文化 拉清单 截颈平 头号球迷 撒币宝 坡涛汹涌 书单吟诵者 巴拿马文件 大撒币 禁评大帝 20000T麦子 2020全面小康 北京中南海支部书记 中国离岸隐匿资产管理工作领导小组组组长 习进棺 吸精瓶 学包积极分子 第一书记王沪宁 修宪 满脸喷粪 毛近平 清华毕业 口罩外交 习厉王 electron8964 总统包子习 习大郎 万岁 习二二（二零二零年五月二十二日开二会） 包大人 修宪连任 习武帝 天安门合法继承人 细瓶颈 做N届的主席 中国爱非洲 维尼带货 读书单 习王的田野上 习博士 vop 习二坐船 中国首席造梦大师 平平 贬词包用 叩谢习恩 小学博士 赵人13 傻大头 皇帝亲临忠诚的武汉 习流氓 阿平 毛魔转世 崇祯帝 役民五术 习宽衣 喜包皮 习远凸 习是春竹 大撒币 晚共昏君 习二胖 习驴 习语录 习包皮 智商不重要 習敗敗 终身领导人 冠子兵法 追思焦裕禄 包禁评 西朝鲜人民自治岛 通商宽衣 末代皇帝 叼斤干 梦回大清 字共狗 世界最强乞丐 WHO的君王 亲自指挥 集金pay 毛装 指定接班人 花花公子 核平全世界 御板泽民 人民领袖 维尼熊给跳跳虎黄牌 总书记来过我的家 习歪嘴 宰相 匪酋习维尼 集近闭 仲夏夜之中国梦 维尼之声 发皇帝梦 恩重如删 习猪席 近言 Mr##Shithole 独彩者 粪坑兵法 毛进平 共哀宗 青年大学包 鞋哥 颐指气使 维尼警察（X） 信女愿一生吃素 彩色哥 维稳警察（O） 习躲躲 糖尿维尼 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 刁近乎 习包子 祈翠 主席贺词 毛二习 共哀宗 习习蛤蛤 “黄袍加身” 习二蛋 超邓赶毛 太祖兔 文明其精神 裹嘎举吸钢闸门 包帝巡游 富平学霸刁斤干 武统时代 哲欣 学包率 领袖习澡水 家业论 第22条军规 冤大头 习核心 习低能儿 习皇帝 公车上书 习达姆 万岁来武汉了 墨索里习 乳透社##小反旗 习奥塞斯库 禁评的理由 64岁 倒车帝 习下台 《生物安全法》 不同意的举手##没有##没有 电脑世代586 形式主义防疫 梁家河 世宗 尊蛤讨包 二百五大帝 儿童习典 庆丰包·勃列日涅夫 习废帝 NMSL 习##卡##巴##卡 假.."~bang！卒 喷粪帝 号尿壶公 维尼梗有害 梁家河贵族 386系统驱动游戏 Corona##Xi（习病毒） 习狍 蔡英文最强助选 初二圣君 习二卒 支那毒王 退党 shuu##kinn##pei 央视姓党 野蛮其体魄 捐麦子 武汉委托李克强 支那精神野爹 孙笑川 没规划的葬礼 嬉包皮 习条英机 毛二世 粪坑先生 维尼连任 半羽习近平 習大佬 shit##hole##bing##fa shit侯 动物森友会 动物之森 抗麦套装 包子露宪 胡志平 普近 “无罩”现身 习包子 玉习大帝 扛麦帝 任大炮 战疫国 猪禁评 习大 皇帝亲临忠诚的武汉 习贼 相信有神论的物理学博士 包经 疫情蔓延 冰棒外交 川普的朋友or敌人 Cicada##3301##XD 习呆呆 包子兵法 老街 习太孑 秦城监狱 宽衣帝 习总 当代秦始皇 你是反贼吗 bingbang帝 习正日 V尼哥 毛孙 日子像蜜甜 普习金 羽日帝 习后主 习卒习 恩维尔·霍习 习卒 “登机”（与登基同音） 习近砰 通商宽衣 刁人13 白猪 习像章 包子宪法 小习微信 最后领导人 席子兵法 官僚主义 吸包皮 Chairman##Xi 习近平光辉形象 十一郎习近平 习家军 人民领袖 中国拉清单工作领导小组组长 亲自考察 战“疫”金句 习教父 习大林 亲自封号 近身平A 动物庄园 塔西佗陷阱 包包侠 “习泽东”和“洪宪”（袁世凯的帝号） 屎進瓶 人民战争

# https://docs.oracle.com/en/java/javase/17/docs/specs/man/jpackage.html
# 执行该脚本前前需注释 pom.xml > launch4j-maven-plugin

export LANG=zh_CN.UTF-8

project_path=$(
  cd "$(dirname "$0")" || exit
  cd ..
  pwd
)
cd "$project_path" || exit

rm -rf dist
mvnd clean package "-Dmaven.test.skip=true"
mkdir target/jpackage
mv target/app-jar-with-dependencies.jar target/jpackage

echo "jpackage version: $(jpackage --version)"
# app-image 表示免安装版，部分参数不支持
# 换行符 psh 为 `，cmd 为 ^，linux 为 \
jpackage \
--name "SoNovel" \
--type "app-image" \
--win-console \
--input "target/jpackage" \
--dest dist \
--icon assets/logo-1.ico \
--app-version 1.7.8 \
--copyright "Copyright (C) 2025 SoNovel. All rights reserved." \
--description "开源搜书神器" \
--vendor "FreeOK" \
--main-jar "app-jar-with-dependencies.jar"

mkdir -p dist/SoNovel
cp config.ini input/readme.txt dist/SoNovel