# 九评 万岁 梦帝 “无罩”现身 孙笑川 庆丰包·勃列日涅夫 蔡英文最强助选 习二蛋 习索里尼 不知名氏 岿然不动 《生物安全法》 任志强 胡志平 退党 大海掀翻小池塘 戴口赵 战“疫”金句 疯狂宇宙 习二二（二零二零年五月二十二日开二会） 黑白翠 习呆呆 习猪席 毛近平 禁评封号 冲塔 央视姓党 “皇帝梦” 席子兵法 大撒币 毛二习 梦回大清 疫情蔓延 习时代 御板泽民 当皇帝的小丑 腊肉包 总统包子习 嬉包皮 不同意的举手##没有##没有 习殡法 习king 尊蛤讨包 习低能儿 动物森友会 修宪 毛装 习达姆 东方project 塔西佗陷阱 A##Big##Deal 爱新觉罗·近平 惜包皮 刁人13 习家军 喷粪帝 维尼警察（X） 乳包文化 动森 骑巨龙 超邓赶毛 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 隔离”的金葫芦 习皇的新装 习流氓 WHO的君王 慨撒大帝 維尼頌 做N届的主席 专治各种不服 毛进平 习老八 猪禁评 一天游泳一千米 习教父 习二坐船 庆丰称帝 祈翠 川普的朋友or敌人 发皇帝梦 习太孑 习像章 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 包包侠 扛麦帝 维尼大帝 玉习大帝 孢 习进棺 影子末帝 中国的新皇帝 近日成 习大犬 相信有神论的物理学博士 卡近菲 动物庄园 花花公子 氼兲嫑炛 指定接班人 文明其精神 坡涛汹涌 皇帝亲临忠诚的武汉 独裁者 百万雄师事件 腊肉馅儿包子 XD 恐惊天上人 习特勒 习尿瓶 任大炮 枪毙名单 2020全面小康 野兽主席 习远凸 毛二 倒车 东瘟疫之地统治者暨全境守护者 灰习牛 大国造疫 国贼习近平 习语 习梦思 包帝巡游 大大招牌 哲欣 毛二世 親自視頻 习匪 当代秦始皇 皇帝亲临忠诚的武汉 毛魔转世 刁二将 习包子 粪坑先生 儿童习典 贬词包用 维尼带货 老街 习是春绿 没规划的葬礼 习皇帝 维尼史 刁后主 总加速师 外交习语 習大佬 红旗下的蛋 崇祯 禁评大帝 刁近乎 习言乱语 两会期间+隐瞒 习后主 夶 共哀宗 习大乞 习夶 一带一路 秦城监狱 习习蛤蛤 耀眼黄红黄 nmslese##dream “习泽东”和“洪宪”（袁世凯的帝号） 支那毒王 这个年很静 次级乳包 十日文革 每日祈翠 冰棒外交 爱新觉罗近平 习得梁家书卷 粪坑兵法 主席+终身制 祈翠語言包 习猪头 冠子兵法 亲自考察 神明论 皇帝梦 叩谢习恩 黄俄 形式主义防疫 智商不重要 口罩大会 书单吟诵者 野兽先辈 维尼梗有害 视频看望 无限连任 vop 维尼写史 初二圣君 我是一个足球迷 20000T麦子 抗麦套装 动物之森 习狍 Voice##of##Pooh 朝令夕改 nmslman（习主席） Cicada##3301##XD 公车上书 纳翠党 武统时代 那翠化 武当七侠的政治斗争 中国离岸隐匿资产管理工作领导小组组组长 游泳一千米 云视察 维稳警察（O） 洗尽贫 时间控制 通商宽衣 近身平A 颐指气使 万岁来武汉 彩色哥 裸宽包子劾心 64岁 习总输记 当代秦二世 屎進瓶 包经 袭包皮 维尼熊给跳跳虎黄牌 习澳塞斯库 习孢子 习匪帝 细颈瓶 习武帝 xdd 习emperor 官僚主义 习和谐 富平学霸刁斤干 主席贺词 屎禁评 傻大头 集金pay 墙内人 刁人13 维尼挂彩 沼气专家 讨习檄文 第22条军规 习大林 Mr##Shithole 习猪下台 瘟疫领主习近平 习二世胡亥 包子病毒 戏博士 人民领袖 刁远山 Heil##Xitler 习二卒 親自蒞臨 裹嘎举吸钢闸门 CoronaXi 役民五术 终身领导人 你是反贼吗 集近闭 共哀宗 坟头蹦迪 習敗北 戏包皮 末代皇帝 糟糕皇帝 法外狂徒Lucy（德国） 白猪 宰相 庆丰帝的千秋梦 清单帝 没有网络安全就没有国家安全 包子露宪 狙击手待命 习下台 刁斤二 通商宽衣 糖尿维尼 甩锅侠 基拉大和习近平 包包大人 赵王 扛麦郎 连专家也为之叹服的电脑天才 平&强 virus##king SB包子 不强自息 感恩教育 720事件 刁斤山 ChinaXi 格萨尔 鞋哥 Corona##Xi（习病毒） 习是春竹 喜包皮 万岁来武汉了 现任匪首 习背书 习卒 撒币宝 赵人13 习三点 习大 习侯 读书单 添宪宝宝 庆丰废物 墨索里习 习思想 狙击手待命 赵家家仆 袁世凯第二 追思焦裕禄 拉清单 疯狂宇宙大帝 五毛主席 包子兵法 亲自指挥疫情 昆明湖涨潮 习一尊 国王 习贼 习梦死 集金币 中国拉清单工作领导小组组长 读稿机 信女愿一生吃素 巴拿马文件 九大诉求 大兔 红二代 捐麦子 民进党 武汉委托李克强 Adolf##Xitler 习王的田野上 叩谢习恩 习语录 学包分子 习大帝 习病法 习Core 领袖习澡水 习式病毒 金科律玉 习卒习 截颈平 人均接近八千万 洗包皮 席近平 禁评的理由 半羽习近平 大大品牌 习包子 赵弹 帝皇頌 西朝鲜人民自治岛 中国首席造梦大师 习正日 习“甩锅” 习瘟猪 中国离岸隐匿资产管理工作领导小组组组长 “梦回大清” 太祖兔 叼斤干 学包率 总书记来过我的家 包子金刚腿 包禁评 中字头组长 近言 Criminal##Xi##"Xitler"##Jinping 习近砰 习近平光辉形象 习条英机 习禁评 不敢高声语 新影帝 重地之战 倒车帝 厕所革命 习犬犬 小学博士 恩重如删 闹得欢 10号跳跳虎被维尼拉清单 错误执行者 中国爱非洲 维尼·屎(Winnie##the##Poo) 刁近猴 “黄袍加身” 送礼平 悉包皮 The##Xi##Factor（习近平因素） 习躲躲 shit##hole##bing##fa “登基” shit侯 劝进 维尼之声 满脸喷粪 野蛮其体魄 习屎黄 亲自指挥 维尼快乐组织（Winnie##Happy##Organization）简称WHO 称帝修宪 人尽皆知的体育迷 习包子的Fa 小习微信 系包皮 习三拍 平平 普习金 吸精瓶 习梦撕 支那精神野爹 青年大学包 匪酋习维尼 习驴 疯狂宇宙包 NMSL 毛孙 皇帝的新衣 电脑世代586 吸包皮 崇祯帝 迈克尔·索伊 XDD 大撒幣 习兵法 野心习 彭主席（习主席走了太太接班） 学包积极分子 总书记来我家 坡涛汹涌 老歪脖子树 韦来书记 包惠帝 4中组长 人民战争 习蛤 习包皮 䒒(tiáo)菦(qín)苹(píng) 梁家河 “复辟” 中国特色射秽煮疫制度 阳台上的哨兵 V尼哥 刁槑夶尛 字共狗 维尼连任 大锅瞻遗 习尔布特 断崖式下跌 宽衣帝 习大郎 天安门合法继承人 假.."~bang！卒 北京中南海支部书记 尼哥 平话 颐使气指 邪大大 维尼DISCO electron8964 200吨 习宽衣 羽日帝 习核心 习二胖 彩色熊 “登机”（与登基同音） 法习斯 吃赵弹 大撒币 习##卡##巴##卡 细瓶颈 世宗 386系统驱动游戏 习付 恩维尔·霍习 包子宪法 习厉王 独彩者 bingbang帝 习总 人类命运共同体首席架构师 冤大头 乳透社##小反旗 日子像蜜甜 亲自脱贫 修宪连任 習敗敗 乳制品 阿道夫-习 习包子 习奥塞斯库 屎侯 嘻包皮 头号球迷 足球外交 习歪嘴 刁二婚 习张三丰 普近 家业论 维持会长 十一郎习近平 习废帝 孤独的毒王 赛禁评 北红尾鸲 最后领导人 号尿壶公 二百五大帝 仲夏夜之中国梦 梁家河贵族 灭共助推器 蹄防 shit禁评 维尼熊 包大人 背书单 人民领袖 习奥赛斯库 亲自删评 口罩外交 第一书记王沪宁 阿平 shuu##kinn##pei 瘟疫降生习近平 刁大犬 小学居士 核平全世界 清华毕业 狙击手布阵 习博士 Chairman##Xi 世界最强乞丐 战疫国 包皇 晚共昏君 倒车斯基 食腐虫 头上三尺有神明 亲自封号 赵付 习公奭 翡翠娘娘 号屎洞

project_path=$(
  cd "$(dirname "$0")" || exit
  cd ..
  pwd
)
cd "$project_path" || exit

mvn clean package "-Dmaven.test.skip=true"
mkdir target/jpackage
mv target/app-jar-with-dependencies.jar target/jpackage

echo "jpackage version: $(jpackage --version)"
# 在 linux 环境会转换为 .deb 文件
# type=app-image 记得去掉--about-url
jpackage \
--name "SoNovel" \
--input "target/jpackage" \
--dest dist \
--icon assets/logo-1.ico \
--app-version 1.7.8 \
--copyright "Copyright (C) 2025 SoNovel. All rights reserved." \
--description "开源搜书神器" \
--vendor "FreeOK" \
--main-jar "app-jar-with-dependencies.jar"

cp config.ini input/readme.txt dist/SoNovel

echo "开始压缩打包"
tar czvf dist/SoNovel_linux.tar.gz dist/SoNovel