# 人类命运共同体首席架构师 习驴 叩谢习恩 狙击手布阵 疯狂宇宙 孤独的毒王 shuu##kinn##pei 包经 維尼頌 战疫国 吸包皮 民进党 儿童习典 毛二习 重地之战 习背书 习卒习 10号跳跳虎被维尼拉清单 维尼连任 昆明湖涨潮 当代秦始皇 迈克尔·索伊 现任匪首 Corona##Xi（习病毒） 匪酋习维尼 国王 动物之森 普近 总书记来过我的家 总书记来我家 红旗下的蛋 屎進瓶 糖尿维尼 习武帝 V尼哥 习得梁家书卷 习躲躲 习emperor 亲自考察 习侯 猪禁评 包子宪法 学包积极分子 送礼平 习付 戏博士 头上三尺有神明 习核心 中国首席造梦大师 阿道夫-习 追思焦裕禄 习近砰 文明其精神 皇帝亲临忠诚的武汉 塔西佗陷阱 那翠化 东方project 包子兵法 习老八 超邓赶毛 习言乱语 宽衣帝 共哀宗 习式病毒 习澳塞斯库 书单吟诵者 习奥赛斯库 人民领袖 捐麦子 习狍 末代皇帝 维尼挂彩 习时代 “无罩”现身 青年大学包 电脑世代586 习二世胡亥 白猪 刁近乎 习二蛋 小习微信 习宽衣 洗尽贫 Heil##Xitler 习大林 近言 野兽主席 东瘟疫之地统治者暨全境守护者 腊肉包 大兔 习张三丰 习贼 狙击手待命 半羽习近平 包子病毒 习索里尼 领袖习澡水 2020全面小康 裹嘎举吸钢闸门 习思想 习匪 没规划的葬礼 刁远山 吸精瓶 系包皮 习厉王 习条英机 终身领导人 维稳警察（O） 核平全世界 屎禁评 中字头组长 喷粪帝 SB包子 人民领袖 羽日帝 人尽皆知的体育迷 主席贺词 颐使气指 腊肉馅儿包子 十一郎习近平 维尼梗有害 不强自息 习Core 习三拍 祈翠 乳制品 悉包皮 抗麦套装 习犬犬 习蛤 号尿壶公 口罩外交 bingbang帝 第一书记王沪宁 梦帝 乳透社##小反旗 野心习 支那毒王 维尼之声 独彩者 习夶 中国特色射秽煮疫制度 The##Xi##Factor（习近平因素） 通商宽衣 ChinaXi 字共狗 国贼习近平 习呆呆 第22条军规 梦回大清 彩色熊 Voice##of##Pooh 习卒 截颈平 支那精神野爹 Chairman##Xi 习兵法 主席+终身制 外交习语 坟头蹦迪 习博士 习特勒 䒒(tiáo)菦(qín)苹(píng) 中国爱非洲 中国离岸隐匿资产管理工作领导小组组组长 梁家河贵族 沼气专家 你是反贼吗 袭包皮 习瘟猪 庆丰包·勃列日涅夫 习语 宰相 富平学霸刁斤干 做N届的主席 独裁者 习语录 瘟疫降生习近平 习猪头 习禁评 维尼熊 刁斤山 野蛮其体魄 刁二婚 花花公子 玉习大帝 黄俄 纳翠党 大国造疫 习包子 祈翠語言包 禁评封号 习大郎 狙击手待命 近日成 刁人13 平平 万岁来武汉 亲自指挥疫情 习二二（二零二零年五月二十二日开二会） 习殡法 大大品牌 任志强 xdd CoronaXi 彭主席（习主席走了太太接班） 九评 習敗敗 不知名氏 爱新觉罗·近平 世宗 氼兲嫑炛 刁二将 包子金刚腿 XD 岿然不动 断崖式下跌 习大帝 平&强 shit##hole##bing##fa 公车上书 恩重如删 包帝巡游 习二卒 错误执行者 皇帝梦 毛近平 维持会长 包包侠 毛装 “登基” 吃赵弹 墙内人 习达姆 恐惊天上人 集金币 习和谐 冲塔 “梦回大清” 糟糕皇帝 日子像蜜甜 席子兵法 耀眼黄红黄 习低能儿 云视察 习皇的新装 足球外交 Mr##Shithole 清华毕业 平话 习包子的Fa 背书单 二百五大帝 习梦思 中国离岸隐匿资产管理工作领导小组组组长 庆丰废物 隔离”的金葫芦 傻大头 连专家也为之叹服的电脑天才 指定接班人 倒车 习进棺 nmslese##dream 韦来书记 维尼熊给跳跳虎黄牌 疯狂宇宙大帝 每日祈翠 老歪脖子树 朝令夕改 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 退党 厕所革命 习匪帝 4中组长 virus##king 总统包子习 这个年很静 最后领导人 习病法 刁槑夶尛 vop 读稿机 信女愿一生吃素 习是春绿 庆丰称帝 食腐虫 翡翠娘娘 人均接近八千万 Adolf##Xitler 包皇 习总 任大炮 习后主 冠子兵法 老街 《生物安全法》 添宪宝宝 天安门合法继承人 扛麦郎 大锅瞻遗 刁大犬 太祖兔 维尼写史 倒车斯基 九大诉求 形式主义防疫 鞋哥 维尼DISCO 习“甩锅” 动物森友会 习皇帝 晚共昏君 蹄防 親自視頻 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 习二胖 近身平A 劝进 习包子 大海掀翻小池塘 共哀宗 贬词包用 习下台 灭共助推器 没有网络安全就没有国家安全 中国的新皇帝 戴口赵 两会期间+隐瞒 黑白翠 习像章 习远凸 相信有神论的物理学博士 细颈瓶 视频看望 习二坐船 习三点 習敗北 20000T麦子 习习蛤蛤 金科律玉 崇祯帝 大撒币 尼哥 红二代 小学居士 毛孙 坡涛汹涌 包禁评 坡涛汹涌 动物庄园 嬉包皮 学包分子 口罩大会 386系统驱动游戏 习梦死 “皇帝梦” 粪坑兵法 一带一路 裸宽包子劾心 灰习牛 习梦撕 瘟疫领主习近平 官僚主义 初二圣君 Cicada##3301##XD 习king 称帝修宪 习大乞 喜包皮 不敢高声语 习包皮 影子末帝 毛二 骑巨龙 毛二世 粪坑先生 央视姓党 尊蛤讨包 习总输记 “登机”（与登基同音） 袁世凯第二 皇帝亲临忠诚的武汉 习屎黄 清单帝 十日文革 彩色哥 习流氓 孢 屎侯 赵家家仆 恩维尔·霍习 習大佬 役民五术 甩锅侠 神明论 阿平 闹得欢 习废帝 动森 满脸喷粪 总加速师 习猪下台 习教父 武统时代 游泳一千米 修宪连任 维尼警察（X） 头号球迷 集金pay 万岁 大撒幣 孙笑川 爱新觉罗近平 刁斤二 墨索里习 习尿瓶 蔡英文最强助选 习##卡##巴##卡 拉清单 读书单 当皇帝的小丑 御板泽民 shit侯 百万雄师事件 包包大人 A##Big##Deal 习是春竹 感恩教育 electron8964 维尼·屎(Winnie##the##Poo) NMSL 夶 格萨尔 五毛主席 乳包文化 “习泽东”和“洪宪”（袁世凯的帝号） 习歪嘴 刁人13 卡近菲 小学博士 家业论 扛麦帝 疫情蔓延 赵付 “复辟” 维尼快乐组织（Winnie##Happy##Organization）简称WHO 刁近猴 亲自封号 基拉大和习近平 不同意的举手##没有##没有 大撒币 学包率 WHO的君王 法习斯 哲欣 嘻包皮 集近闭 一天游泳一千米 大大招牌 习家军 北京中南海支部书记 禁评的理由 习公奭 武当七侠的政治斗争 习王的田野上 枪毙名单 法外狂徒Lucy（德国） 我是一个足球迷 时间控制 新影帝 习大犬 XDD 崇祯 亲自脱贫 世界最强乞丐 Criminal##Xi##"Xitler"##Jinping 皇帝的新衣 倒车帝 西朝鲜人民自治岛 野兽先辈 维尼大帝 假.."~bang！卒 親自蒞臨 颐指气使 习奥塞斯库 习尔布特 撒币宝 万岁来武汉了 维尼史 赵弹 川普的朋友or敌人 赵王 阳台上的哨兵 发皇帝梦 包子露宪 席近平 惜包皮 疯狂宇宙包 通商宽衣 帝皇頌 人民战争 习包子 武汉委托李克强 仲夏夜之中国梦 禁评大帝 nmslman（习主席） 普习金 战“疫”金句 亲自删评 习正日 秦城监狱 专治各种不服 庆丰帝的千秋梦 习大 细瓶颈 中国拉清单工作领导小组组长 维尼带货 冰棒外交 讨习檄文 梁家河 习近平光辉形象 冤大头 无限连任 巴拿马文件 习太孑 刁后主 慨撒大帝 “黄袍加身” 习一尊 亲自指挥 修宪 叼斤干 shit禁评 智商不重要 北红尾鸲 邪大大 赛禁评 毛进平 习猪席 64岁 洗包皮 720事件 叩谢习恩 包大人 习孢子 当代秦二世 毛魔转世 次级乳包 胡志平 200吨 包惠帝 赵人13 戏包皮 号屎洞

project_path=$(
  cd "$(dirname "$0")" || exit
  cd ..
  pwd
)
cd "$project_path" || exit

mvn clean package "-Dmaven.test.skip=true"
mkdir -p nobug/jpackage
mv nobug/app-jar-with-dependencies.jar nobug/jpackage

echo "开始构建 exe"
echo "jpackage version: $(jpackage --version)"
jpackage \
--name "SoNovel" \
--type "app-image" \
--win-console \
--input "nobug/jpackage" \
--dest dist \
--icon assets/logo-1.ico \
--app-version 1.7.8 \
--copyright "Copyright (C) 2025 SoNovel. All rights reserved." \
--description "开源搜书神器" \
--vendor "FreeOK" \
--main-jar "app-jar-with-dependencies.jar"

cp config.ini input/readme.txt dist/SoNovel
rm dist/SoNovel/*.ico

echo "开始压缩打包"
tar czvf dist/sonovel-win.tar.gz dist/SoNovel