/* 视频看望 nmslman（习主席） 北红尾鸲 头上三尺有神明 习卒习 赵人13 世界最强乞丐 普近 疯狂宇宙包 梦帝 甴近平 戴口赵 书单吟诵者 习厉王 shuu##kinn##pei 阿平 毛孙 做N届的主席 主席贺词 天安门合法继承人 习近平光辉形象 大大品牌 习得梁家书卷 甴种 日子像蜜甜 习卒 墨索里习 习兵法 恩维尔·霍习 亲自考察 满脸喷粪 “复辟” 九大诉求 公车上书 读书单 不强自息 习猪头 你是反贼吗 羽日帝 nmslese##dream 武汉委托李克强 習敗北 吃赵弹 讨习檄文 卡近菲 包子宪法 Criminal##Xi##"Xitler"##Jinping 百万雄师事件 半羽习近平 梁家河 劝进 毛近平 感恩教育 近身平A “无罩”现身 习式病毒 中国的新皇帝 十里山路不换肩 大兔 习猪下台 胡志平 二次袁、袁世凯二世、袁二 细瓶颈 添宪宝宝 袁世凯第二 神明论 习殡法 十日文革 白猪 NMSL 专治各种不服 疯狂宇宙大帝 庆丰废物 断崖式下跌 追思焦裕禄 席子兵法 Chairman##Xi 屎進瓶 20000T麦子 毛装 习二蛋 无限连任 发皇帝梦 初二圣君 维稳警察（O） 信女愿一生吃素 亲自脱贫 习梦思 习武帝 假.."~bang！卒 习近砰 习张三丰 平&强 习包子 隔离”的金葫芦 习躲躲 花花公子 赵弹 支那精神野爹 习太孑 主席+终身制 习二二（二零二零年五月二十二日开二会） 习大郎 共哀宗 习尽贫 武当七侠的政治斗争 抗麦套装 恩重如删 金科律玉 包子病毒 CoronaXi 习大犬 人民领袖 送礼平 枪毙名单 外交习语 非洲大撒币 近言 人类命运共同体首席架构师 习emperor 蹄防 裹嘎举吸钢闸门 腊肉馅儿包子 习思想 維尼頌 禁评大帝 习犬犬 庆丰帝的千秋梦 親自視頻 Cicada##3301##XD 习奥塞斯库、齐奥塞斯库 狙击手待命 粪坑兵法 坟头蹦迪 赵王 彩色熊 骑巨龙 习像章 总统包子习 习后主 共哀宗 皇帝梦 学包积极分子 九评 习老八 习远凸 厕所革命 习呆呆 总加速师 习三拍 皇帝亲临忠诚的武汉 习狍 黄俄 相信有神论的物理学博士 清华毕业 宽衣帝 系包皮 习背书 细颈瓶 当代秦二世 读稿机 习歪嘴 修宪帝 大撒币 截颈平 720事件 嘻包皮 Heil##Xitler 黑白翠 韦来书记 孙笑川 习习蛤蛤 十一郎习近平 倒车帝 叼斤干 武统时代 习皇帝 那翠化 shit##hole##bing##fa 习包子 总书记来过我的家 重地之战 喜包皮 甩锅侠 独裁国贼 人均接近八千万 战“疫”金句 亲自封号 近日成 “习泽东”和“洪宪”（袁世凯的帝号） shit禁评 文明其精神 习屎黄 孤独的毒王 习澳塞斯库 Voice##of##Pooh 习Core 64岁 一天游泳一千米 纳翠党 普习金 新影帝 腊肉包 习二坐船 庆丰称帝 号屎洞 WHO的君王 崇祯帝 大海掀翻小池塘 称帝修宪 总书记来我家 4中组长 云视察 裸宽包子劾心 《生物安全法》 习语 人民战争 习时代 役民五术 习瘟猪 赵家家仆 刁后主 太祖兔 这个年很静 万岁 集金币 萨格尔王 刁近猴 10号跳跳虎被维尼拉清单 大国造疫 習敗敗 集金pay bingbang帝 官僚主义 不知名氏 刁人13 老歪脖子树 乳透社##小反旗 号尿壶公 XD 口罩外交 老街 倒车斯基 大撒幣 维尼之声 最后领导人 央视姓党 末代皇帝 迈克尔·索伊 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 颐使气指 维尼警察（X） 毛进平 维尼史 维尼熊 法外狂徒Lucy（德国） 指定接班人 口罩大会 “皇帝梦” 通商宽衣 川普的朋友or敌人 亲自删评 祈翠 习一尊 支那毒王 维尼梗有害 帝皇頌 没规划的葬礼 宰相 第22条军规 退党 仲夏夜之中国梦 刁二将 背书单 彭主席（习主席走了太太接班） 小学居士 习大 屎侯 瘟疫降生习近平 包包侠 习皇的新装 习言乱语 习宽衣 大大招牌 中国拉清单工作领导小组组长 集近闭 错误执行者 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 塔西佗陷阱 戏博士 东方project 巴拿马文件 傻大头 毛泽东2.0 捐麦子 毛二世 亲自指挥 喷粪帝 瘟疫领主习近平 刁斤二 氼兲嫑炛 当代秦始皇 恐惊天上人 万岁来武汉了 吸包皮 蔡英文最强助选 习家军 包大人 毛魔转世 席近平 修宪 小学博士 儿童习典 时间控制 红旗下的蛋 尼哥 电脑世代586 小习微信 刁斤山 孢 疫情蔓延 习条英机 终身领导人 游泳一千米 耀眼黄红黄 习公奭 彩色哥 习核心 超邓赶毛 习##卡##巴##卡 惜包皮 糟糕皇帝 西朝鲜人民自治岛 战疫国 中字头组长 狙击手待命 秦城监狱 核平全世界 清单帝 Corona##Xi（习病毒） 刁人13 屎禁评 冲塔 shit侯 匪酋习维尼 习二世胡亥 习贼 中国爱非洲 习“甩锅” 岿然不动 两会期间+隐瞒 维尼·屎(Winnie##the##Poo) 野蛮其体魄 灰习牛 习达姆 禁评封号 富平学霸刁斤干 连专家也为之叹服的电脑天才 民进党 386系统驱动游戏 vop 扛麦郎 青年大学包 尊蛤讨包 习二卒 中国离岸隐匿资产管理工作领导小组组组长 不同意的举手##没有##没有 当皇帝的小丑 乳制品 次级乳包 梁家河贵族 大锅瞻遗 包包大人 坡涛汹涌 习二胖 红二代 野兽主席 东瘟疫之地统治者暨全境守护者 刁远山 洗包皮 袭包皮 粪坑先生 毛二习 拉清单 维尼大帝 维尼快乐组织（Winnie##Happy##Organization）简称WHO 御板泽民 包子金刚腿 SB包子 夶 习大乞 贬词包用 悉包皮 2020全面小康 习包子 习奥赛斯库 狙击手布阵 “梦回大清” 动物之森 维尼DISCO 嬉包皮 xdd 平平 “黄袍加身” electron8964 动物庄园 格萨尔 A##Big##Deal “登基” 禁评的理由 习语录 叩谢习恩 动森 习孢子 习猪席 崇祯 疯狂宇宙 刁槑夶尛 习包皮 野心习 习尔布特 阳台上的哨兵 习索里尼 灭共助推器 智商不重要 包帝巡游 习大林 修宪连任 野兽先辈 习下台 冠子兵法 朝令夕改 庆丰包·勃列日涅夫 学包分子 200吨 二百斤 包子兵法 鞋哥 倒车 头号球迷 习病法 哲欣 习壳郎 第一书记王沪宁 冤大头 形式主义防疫 习包子的Fa 维尼熊给跳跳虎黄牌 习奥塞斯库 糖尿维尼 人尽皆知的体育迷 足球外交 冰棒外交 “登机”（与登基同音） 不敢高声语 习教父 包禁评 墙内人 Adolf##Xitler 习付 维持会长 字共狗 习梦死 包经 习正日 梦回大清 维尼带货 包子露宪 一带一路 国王 扛麦帝 闹得欢 习废帝 习总 包惠帝 毛二 䒒(tiáo)菦(qín)苹(píng) 影子末帝 宽衣大帝 习王的田野上 刁大犬 万岁来武汉 任大炮 习king 习特勒 北京中南海支部书记 virus##king 坡涛汹涌 每日祈翠 翡翠娘娘 习侯 习和谐 皇帝的新衣 中国离岸隐匿资产管理工作领导小组组组长 中国首席造梦大师 通商宽衣 晚共昏君 阿道夫-习 親自蒞臨 清零宗、清零帝 学包率 昆明湖涨潮 习大帝 人民领袖 颐指气使 独裁者 习低能儿 爱新觉罗近平 包皇 习博士 猪禁评 现任匪首 中国特色射秽煮疫制度 玉习大帝 皇帝亲临忠诚的武汉 五毛主席 刁近乎 戏包皮 习总输记 撒币宝 沼气专家 家业论 平话 习流氓 乳包文化 习驴 基拉大和习近平 没有网络安全就没有国家安全 The##Xi##Factor（习近平因素） 习蛤 ChinaXi 动物森友会 习是春绿 叩谢习恩 任志强 维尼写史 习是春竹 习夶 食腐虫 亲自指挥疫情 习进棺 習大佬 V尼哥 法习斯 习匪 国贼习近平 洗尽贫 维尼挂彩 吸精瓶 领袖习澡水 刁二婚 习禁评 世宗 赵付 慨撒大帝 祈翠語言包 习尿瓶 独彩者 习匪帝 赛禁评 习梦撕 我是一个足球迷 邪大大 XDD 习三点 习曱甴 爱新觉罗·近平 维尼连任 二百五大帝 Mr##Shithole */
package com.pcdd.sonovel.core;

import com.pcdd.sonovel.model.AppConfig;
import com.pcdd.sonovel.model.Rule;
import lombok.AllArgsConstructor;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@AllArgsConstructor
public class ChapterFormatter {

    private final AppConfig config;

    /**
     * 格式化正文排版
     */
    public String format(String content) {
        Rule.Chapter r = new Source(config).rule.getChapter();

        // <p>段落</p>
        if (r.isParagraphTagClosed()) {
            // 非 <p> 闭合标签（例如 <span>段落</span>）替换为 <p>
            return content.replaceAll("<(?!p\\b)([^>]+)>(.*?)</\\1>", "<p>$2</p>");
        }
        // 标签不闭合，用某个标签分隔，例如：段落1<br><br>段落2
        String tag = r.getParagraphTag();
        StringBuilder sb = new StringBuilder();

        for (String line : content.split(tag)) {
            if (!line.isBlank()) {
                sb.append("<p>").append(line).append("</p>");
            }
        }

        return sb.toString();
    }

}