/* 习猪下台 习王的田野上 20000T麦子 胡志平 親自蒞臨 指定接班人 世宗 宰相 一带一路 腊肉包 习大郎 中国首席造梦大师 习孢子 坡涛汹涌 包子宪法 岿然不动 习近砰 鞋哥 动森 狙击手待命 粪坑先生 玉习大帝 戏包皮 号屎洞 错误执行者 习包子 哲欣 包子金刚腿 包帝巡游 习梦撕 云视察 习大 一天游泳一千米 仲夏夜之中国梦 粪坑兵法 刁人13 中国的新皇帝 终身领导人 世界最强乞丐 习背书 惜包皮 劝进 “皇帝梦” 不同意的举手##没有##没有 习厉王 东瘟疫之地统治者暨全境守护者 秦城监狱 游泳一千米 庆丰废物 字共狗 庆丰包·勃列日涅夫 习大林 当代秦二世 老街 食腐虫 习匪 喜包皮 毛进平 核平全世界 维稳警察（O） 习时代 冰棒外交 大撒币 野兽主席 习兵法 习卒习 Mr##Shithole CoronaXi 彩色哥 习夶 習大佬 shit侯 习尔布特 阿平 习侯 日子像蜜甜 巴拿马文件 习特勒 维尼DISCO 翡翠娘娘 裸宽包子劾心 没规划的葬礼 袭包皮 两会期间+隐瞒 毛魔转世 集金币 扛麦帝 刁斤山 野心习 任大炮 Chairman##Xi 崇祯帝 习进棺 Corona##Xi（习病毒） 爱新觉罗近平 细颈瓶 冲塔 nmslese##dream 习king 戏博士 习奥赛斯库 背书单 普习金 红二代 最后领导人 Heil##Xitler 读书单 动物之森 初二圣君 细瓶颈 习老八 假.."~bang！卒 习狍 那翠化 悉包皮 梦帝 吸精瓶 习贼 灭共助推器 习语 相信有神论的物理学博士 疯狂宇宙大帝 洗包皮 当皇帝的小丑 瘟疫领主习近平 集近闭 韦来书记 维尼熊 瘟疫降生习近平 大大品牌 习禁评 口罩大会 现任匪首 shuu##kinn##pei 习宽衣 The##Xi##Factor（习近平因素） 禁评大帝 习流氓 家业论 NMSL 坟头蹦迪 中国离岸隐匿资产管理工作领导小组组组长 习皇帝 格萨尔 小习微信 白猪 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 卡近菲 任志强 习是春绿 官僚主义 小学博士 习武帝 恩维尔·霍习 五毛主席 普近 二百五大帝 叼斤干 足球外交 平平 书单吟诵者 超邓赶毛 毛装 爱新觉罗·近平 夶 习达姆 袁世凯第二 号尿壶公 公车上书 拉清单 包惠帝 习包子的Fa 形式主义防疫 野兽先辈 維尼頌 禁评的理由 赵付 百万雄师事件 洗尽贫 䒒(tiáo)菦(qín)苹(píng) 崇祯 Cicada##3301##XD 习包子 尊蛤讨包 习式病毒 梁家河 200吨 御板泽民 梁家河贵族 毛二 nmslman（习主席） 吃赵弹 系包皮 学包分子 修宪连任 孙笑川 总加速师 支那精神野爹 不知名氏 大撒币 乳包文化 皇帝亲临忠诚的武汉 裹嘎举吸钢闸门 大撒幣 习梦思 亲自脱贫 通商宽衣 习总输记 毛二世 大兔 武汉委托李克强 皇帝的新衣 截颈平 习公奭 赵家家仆 信女愿一生吃素 近言 发皇帝梦 央视姓党 万岁来武汉 习后主 老歪脖子树 “梦回大清” 集金pay 维尼写史 包皇 shit禁评 中国拉清单工作领导小组组长 维尼梗有害 祈翠語言包 墨索里习 尼哥 维尼挂彩 连专家也为之叹服的电脑天才 九大诉求 万岁来武汉了 包子露宪 共哀宗 追思焦裕禄 恐惊天上人 嘻包皮 毛近平 倒车 庆丰称帝 总书记来我家 天安门合法继承人 习蛤 祈翠 这个年很静 人民战争 中国离岸隐匿资产管理工作领导小组组组长 武统时代 习二二（二零二零年五月二十二日开二会） 主席贺词 武当七侠的政治斗争 羽日帝 习三点 习总 野蛮其体魄 新影帝 习大乞 386系统驱动游戏 包禁评 退党 包子兵法 金科律玉 万岁 人均接近八千万 氼兲嫑炛 蔡英文最强助选 清单帝 维尼快乐组织（Winnie##Happy##Organization）简称WHO 腊肉馅儿包子 习废帝 习和谐 青年大学包 北京中南海支部书记 习大犬 习近平光辉形象 习卒 习博士 习像章 不强自息 塔西佗陷阱 富平学霸刁斤干 学包率 禁评封号 维尼连任 战“疫”金句 习习蛤蛤 宽衣帝 黄俄 习emperor bingbang帝 墙内人 习殡法 国王 红旗下的蛋 骑巨龙 习付 无限连任 朝令夕改 共哀宗 昆明湖涨潮 戴口赵 叩谢习恩 习驴 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 皇帝亲临忠诚的武汉 习尿瓶 维尼带货 战疫国 亲自指挥疫情 electron8964 末代皇帝 大大招牌 疯狂宇宙包 习呆呆 口罩外交 习低能儿 称帝修宪 总书记来过我的家 近身平A 刁近猴 習敗敗 颐使气指 狙击手布阵 庆丰帝的千秋梦 外交习语 厕所革命 习言乱语 中国特色射秽煮疫制度 《生物安全法》 灰习牛 独彩者 屎侯 枪毙名单 shit##hole##bing##fa 习一尊 4中组长 包包大人 次级乳包 A##Big##Deal 包子病毒 支那毒王 赵弹 赵人13 大国造疫 中字头组长 影子末帝 抗麦套装 专治各种不服 刁近乎 糖尿维尼 学包积极分子 恩重如删 花花公子 XD 习皇的新装 闹得欢 重地之战 时间控制 人民领袖 720事件 第22条军规 刁远山 纳翠党 人尽皆知的体育迷 习下台 独裁者 糟糕皇帝 习澳塞斯库 晚共昏君 习家军 习病法 刁大犬 倒车斯基 送礼平 维尼·屎(Winnie##the##Poo) 乳制品 习条英机 撒币宝 冠子兵法 电脑世代586 沼气专家 刁人13 满脸喷粪 SB包子 蹄防 坡涛汹涌 “习泽东”和“洪宪”（袁世凯的帝号） ChinaXi “登机”（与登基同音） 川普的朋友or敌人 帝皇頌 吸包皮 习二世胡亥 通商宽衣 屎進瓶 毛二习 刁后主 西朝鲜人民自治岛 九评 乳透社##小反旗 读稿机 智商不重要 阳台上的哨兵 习屎黄 十一郎习近平 V尼哥 包经 疯狂宇宙 习教父 习匪帝 主席+终身制 匪酋习维尼 习“甩锅” 喷粪帝 习二坐船 xdd 清华毕业 没有网络安全就没有国家安全 习是春竹 迈克尔·索伊 小学居士 修宪 赵王 刁斤二 动物庄园 嬉包皮 彭主席（习主席走了太太接班） 颐指气使 你是反贼吗 习得梁家书卷 毛孙 我是一个足球迷 叩谢习恩 大锅瞻遗 维尼警察（X） 习犬犬 法外狂徒Lucy（德国） 中国爱非洲 人类命运共同体首席架构师 傻大头 刁二婚 太祖兔 习奥塞斯库 平话 邪大大 virus##king 习大帝 甩锅侠 习思想 冤大头 讨习檄文 习歪嘴 习躲躲 十日文革 北红尾鸲 亲自删评 XDD 习包子 狙击手待命 做N届的主席 习语录 维尼史 习三拍 Voice##of##Pooh 领袖习澡水 习张三丰 “登基” 親自視頻 倒车帝 习正日 包包侠 皇帝梦 Adolf##Xitler 习太孑 梦回大清 贬词包用 维尼大帝 国贼习近平 WHO的君王 席近平 人民领袖 亲自封号 视频看望 习Core 民进党 法习斯 习核心 添宪宝宝 孤独的毒王 大海掀翻小池塘 亲自考察 Criminal##Xi##"Xitler"##Jinping 刁槑夶尛 包大人 “黄袍加身” 习包皮 扛麦郎 习远凸 当代秦始皇 文明其精神 黑白翠 猪禁评 第一书记王沪宁 基拉大和习近平 动物森友会 64岁 彩色熊 捐麦子 头上三尺有神明 阿道夫-习 习二卒 维尼熊给跳跳虎黄牌 10号跳跳虎被维尼拉清单 耀眼黄红黄 习索里尼 2020全面小康 习二胖 头号球迷 习二蛋 vop 神明论 役民五术 隔离”的金葫芦 習敗北 维尼之声 近日成 习##卡##巴##卡 亲自指挥 平&强 屎禁评 断崖式下跌 习梦死 席子兵法 慨撒大帝 习猪席 每日祈翠 赛禁评 习猪头 儿童习典 东方project 疫情蔓延 孢 半羽习近平 “复辟” 习瘟猪 总统包子习 不敢高声语 维持会长 感恩教育 刁二将 “无罩”现身 */
package com.pcdd.sonovel.core;

import com.pcdd.sonovel.model.AppConfig;
import com.pcdd.sonovel.model.Rule;
import lombok.AllArgsConstructor;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@AllArgsConstructor
public class ChapterFormatter {

    private final AppConfig config;

    /**
     * 格式化正文排版
     */
    public String format(String content) {
        Rule.Chapter r = new Source(config).rule.getChapter();

        // <p>段落</p>
        if (r.isParagraphTagClosed()) {
            // 非 <p> 闭合标签（例如 <span>段落</span>）替换为 <p>
            return content.replaceAll("<(?!p\\b)([^>]+)>(.*?)</\\1>", "<p>$2</p>");
        }
        // 标签不闭合，用某个标签分隔，例如：段落1<br><br>段落2
        String tag = r.getParagraphTag();
        StringBuilder sb = new StringBuilder();

        for (String line : content.split(tag)) {
            if (!line.isBlank()) {
                sb.append("<p>").append(line).append("</p>");
            }
        }

        return sb.toString();
    }

}