/* 刁大犬 不同意的举手##没有##没有 领袖习澡水 动物庄园 当皇帝的小丑 毛二世 包经 这个年很静 平话 习尔布特 戴口赵 习大林 习皇的新装 次级乳包 习梦撕 瘟疫领主习近平 “习泽东”和“洪宪”（袁世凯的帝号） 人类命运共同体首席架构师 习奥塞斯库 习澳塞斯库 影子末帝 东方project 老歪脖子树 习二坐船 宰相 2020全面小康 习躲躲 劝进 习和谐 终身领导人 禁评大帝 修宪连任 彭主席（习主席走了太太接班） 拉清单 近言 维尼之声 近身平A 感恩教育 习禁评 武统时代 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 人民战争 武当七侠的政治斗争 第22条军规 鞋哥 维尼DISCO 战“疫”金句 习夶 发皇帝梦 习奥赛斯库 习猪下台 读书单 退党 亲自考察 基拉大和习近平 黑白翠 系包皮 习呆呆 戏包皮 刁斤山 朝令夕改 nmslman（习主席） 20000T麦子 抗麦套装 独彩者 学包率 灭共助推器 中国离岸隐匿资产管理工作领导小组组组长 蹄防 法习斯 喜包皮 禁评的理由 视频看望 维尼挂彩 中国的新皇帝 维尼大帝 白猪 中国拉清单工作领导小组组长 64岁 习是春竹 倒车 秦城监狱 崇祯 720事件 梦回大清 习一尊 洗包皮 shit侯 叩谢习恩 皇帝亲临忠诚的武汉 习条英机 最后领导人 晚共昏君 沼气专家 动森 大锅瞻遗 Mr##Shithole 万岁来武汉 糟糕皇帝 主席+终身制 袁世凯第二 习兵法 傻大头 包子兵法 孢 口罩大会 红二代 习得梁家书卷 中国爱非洲 小学居士 维尼连任 二百五大帝 悉包皮 无限连任 一天游泳一千米 小学博士 总统包子习 毛孙 “黄袍加身” 阳台上的哨兵 纳翠党 川普的朋友or敌人 小习微信 假.."~bang！卒 屎禁评 习宽衣 嬉包皮 北京中南海支部书记 习殡法 习大郎 尊蛤讨包 号屎洞 法外狂徒Lucy（德国） 包大人 做N届的主席 习二胖 墨索里习 习贼 添宪宝宝 公车上书 普习金 习索里尼 刁二婚 邪大大 总加速师 nmslese##dream 习大犬 習敗北 习##卡##巴##卡 习是春绿 昆明湖涨潮 猪禁评 吃赵弹 习大帝 人尽皆知的体育迷 共哀宗 疯狂宇宙大帝 孙笑川 毛近平 维持会长 甩锅侠 CoronaXi “复辟” 习梦死 维尼快乐组织（Winnie##Happy##Organization）简称WHO 五毛主席 我是一个足球迷 连专家也为之叹服的电脑天才 核平全世界 维尼带货 慨撒大帝 赵家家仆 北红尾鸲 恐惊天上人 200吨 电脑世代586 赵弹 任志强 修宪 专治各种不服 维尼梗有害 腊肉包 没有网络安全就没有国家安全 vop 氼兲嫑炛 皇帝梦 倒车帝 386系统驱动游戏 习“甩锅” 第一书记王沪宁 习核心 electron8964 撒币宝 野心习 当代秦二世 刁近乎 NMSL SB包子 习尿瓶 习流氓 毛进平 习匪帝 普近 席子兵法 恩重如删 黄俄 维尼·屎(Winnie##the##Poo) 闹得欢 禁评封号 习后主 阿平 维尼熊给跳跳虎黄牌 毛魔转世 包帝巡游 崇祯帝 刁斤二 维尼史 毛装 ChinaXi 仲夏夜之中国梦 日子像蜜甜 糖尿维尼 指定接班人 刁近猴 包子露宪 乳包文化 国贼习近平 半羽习近平 隔离”的金葫芦 狙击手待命 shit##hole##bing##fa 动物森友会 习狍 袭包皮 习近平光辉形象 屎進瓶 戏博士 亲自指挥 叩谢习恩 Criminal##Xi##"Xitler"##Jinping 习正日 羽日帝 习猪头 集金pay 维稳警察（O） 习驴 习总 背书单 WHO的君王 共哀宗 习瘟猪 席近平 神明论 截颈平 赛禁评 老街 你是反贼吗 时间控制 追思焦裕禄 人民领袖 国王 包子金刚腿 格萨尔 维尼警察（X） 习二卒 冲塔 爱新觉罗·近平 包惠帝 习蛤 冠子兵法 嘻包皮 习厉王 习卒 习博士 V尼哥 送礼平 中字头组长 包子宪法 当代秦始皇 官僚主义 刁二将 恩维尔·霍习 喷粪帝 习emperor 翡翠娘娘 倒车斯基 祈翠 夶 清单帝 习屎黄 韦来书记 大海掀翻小池塘 外交习语 bingbang帝 习包子 爱新觉罗近平 墙内人 役民五术 包子病毒 贬词包用 金科律玉 习匪 新影帝 习太孑 学包分子 头号球迷 食腐虫 赵人13 任大炮 习像章 习侯 瘟疫降生习近平 胡志平 A##Big##Deal 大撒幣 疯狂宇宙 不敢高声语 Corona##Xi（习病毒） 习特勒 习远凸 尼哥 每日祈翠 十一郎习近平 耀眼黄红黄 梦帝 岿然不动 梁家河贵族 粪坑兵法 巴拿马文件 习二世胡亥 头上三尺有神明 蔡英文最强助选 习教父 习三拍 习废帝 习猪席 毛二习 匪酋习维尼 狙击手待命 惜包皮 迈克尔·索伊 重地之战 两会期间+隐瞒 大大品牌 万岁 文明其精神 细瓶颈 习式病毒 Voice##of##Pooh 万岁来武汉了 大国造疫 屎侯 一带一路 现任匪首 扛麦帝 习歪嘴 卡近菲 “登基” 中国特色射秽煮疫制度 世界最强乞丐 东瘟疫之地统治者暨全境守护者 九大诉求 “无罩”现身 信女愿一生吃素 百万雄师事件 骑巨龙 包包侠 包禁评 习包子 坡涛汹涌 习老八 清华毕业 玉习大帝 毛二 刁人13 云视察 没规划的葬礼 䒒(tiáo)菦(qín)苹(píng) xdd 习Core 习王的田野上 习二蛋 包皇 叼斤干 习时代 裸宽包子劾心 习言乱语 shit禁评 維尼頌 花花公子 刁槑夶尛 总书记来我家 10号跳跳虎被维尼拉清单 裹嘎举吸钢闸门 青年大学包 亲自脱贫 彩色熊 错误执行者 赵王 颐使气指 亲自封号 习进棺 富平学霸刁斤干 厕所革命 习背书 刁远山 亲自指挥疫情 坡涛汹涌 习公奭 塔西佗陷阱 赵付 维尼写史 “登机”（与登基同音） 习大乞 習大佬 超邓赶毛 习孢子 习大 乳制品 大撒币 习犬犬 平&强 习达姆 庆丰称帝 儿童习典 virus##king 帝皇頌 总书记来过我的家 习语录 习低能儿 宽衣帝 讨习檄文 习king 吸包皮 天安门合法继承人 皇帝亲临忠诚的武汉 捐麦子 彩色哥 冤大头 维尼熊 XD 支那精神野爹 字共狗 习包皮 疯狂宇宙包 吸精瓶 不强自息 足球外交 疫情蔓延 习武帝 智商不重要 阿道夫-习 西朝鲜人民自治岛 腊肉馅儿包子 包包大人 细颈瓶 习思想 孤独的毒王 习三点 习病法 习总输记 习习蛤蛤 Adolf##Xitler 民进党 “皇帝梦” 刁后主 习梦思 乳透社##小反旗 习近砰 粪坑先生 集金币 哲欣 坟头蹦迪 梁家河 世宗 断崖式下跌 庆丰帝的千秋梦 十日文革 习家军 游泳一千米 战疫国 大兔 刁人13 人民领袖 枪毙名单 末代皇帝 習敗敗 庆丰废物 Cicada##3301##XD 亲自删评 大撒币 习卒习 形式主义防疫 祈翠語言包 武汉委托李克强 集近闭 野兽先辈 家业论 相信有神论的物理学博士 The##Xi##Factor（习近平因素） 称帝修宪 狙击手布阵 习付 大大招牌 XDD 习包子的Fa 号尿壶公 野蛮其体魄 近日成 颐指气使 习语 习二二（二零二零年五月二十二日开二会） 支那毒王 满脸喷粪 习包子 平平 独裁者 习皇帝 读稿机 那翠化 扛麦郎 中国离岸隐匿资产管理工作领导小组组组长 Heil##Xitler 不知名氏 御板泽民 4中组长 中国首席造梦大师 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 太祖兔 親自蒞臨 九评 习张三丰 野兽主席 人均接近八千万 主席贺词 《生物安全法》 Chairman##Xi 通商宽衣 庆丰包·勃列日涅夫 学包积极分子 口罩外交 “梦回大清” 灰习牛 親自視頻 书单吟诵者 冰棒外交 央视姓党 动物之森 习下台 通商宽衣 洗尽贫 红旗下的蛋 初二圣君 皇帝的新衣 shuu##kinn##pei */
package com.pcdd.sonovel;

import com.pcdd.sonovel.core.CoverUpdater;
import com.pcdd.sonovel.model.Book;
import org.junit.jupiter.api.Test;

/**
 * @author pcdd
 * Created at 2025/2/6
 */
class CoverUpdaterTest {

    @Test
    void test01() {
        Book book = new Book();
        book.setBookName("从遮天开始穿越");
        book.setAuthor("心之火");
        System.out.println(CoverUpdater.fetchZongheng(book));
    }

}