/* 号屎洞 第22条军规 惜包皮 习歪嘴 儿童习典 习猪席 岿然不动 九评 維尼頌 毛二世 “梦回大清” 独彩者 老街 nmslese##dream 习索里尼 习王的田野上 错误执行者 毛二习 刁大犬 吃赵弹 vop 包子露宪 亲自封号 习正日 阿道夫-习 Corona##Xi（习病毒） 坟头蹦迪 习二世胡亥 裹嘎举吸钢闸门 席子兵法 发皇帝梦 习近砰 习二蛋 蹄防 习卒习 恩重如删 疯狂宇宙大帝 大撒幣 习一尊 孤独的毒王 包子金刚腿 修宪连任 刁人13 皇帝亲临忠诚的武汉 习曱甴 嘻包皮 彩色熊 习尽贫 习侯 集近闭 东瘟疫之地统治者暨全境守护者 迈克尔·索伊 指定接班人 戏包皮 仲夏夜之中国梦 添宪宝宝 维尼之声 彭主席（习主席走了太太接班） 刁近乎 刁近猴 二百五大帝 疯狂宇宙 习驴 亲自删评 中国离岸隐匿资产管理工作领导小组组组长 阳台上的哨兵 普习金 世界最强乞丐 袭包皮 祈翠語言包 猪禁评 习二二（二零二零年五月二十二日开二会） 习达姆 梁家河贵族 刁人13 崇祯 外交习语 刁二将 当代秦二世 字共狗 毛二 梦帝 维尼梗有害 习教父 领袖习澡水 中字头组长 维尼熊 家业论 梁家河 洗包皮 集金pay 亲自考察 习包子的Fa 扛麦郎 习是春绿 200吨 习卒 䒒(tiáo)菦(qín)苹(píng) 没规划的葬礼 习包子 包子宪法 文明其精神 习禁评 武当七侠的政治斗争 学包积极分子 世宗 习包皮 64岁 习进棺 习king 细瓶颈 习尿瓶 玉习大帝 小学居士 刁远山 当代秦始皇 习付 十一郎习近平 影子末帝 习奥塞斯库、齐奥塞斯库 习总输记 Chairman##Xi 终身领导人 习特勒 御板泽民 “登机”（与登基同音） 习大郎 你是反贼吗 任志强 疫情蔓延 野蛮其体魄 习语 糖尿维尼 宽衣帝 梦回大清 A##Big##Deal 親自視頻 親自蒞臨 大兔 口罩大会 习奥塞斯库 习时代 初二圣君 “无罩”现身 胡志平 共哀宗 shit##hole##bing##fa 刁斤山 bingbang帝 人类命运共同体首席架构师 习二卒 习皇帝 公车上书 西朝鲜人民自治岛 红二代 巴拿马文件 书单吟诵者 习武帝 灰习牛 乳包文化 当皇帝的小丑 赵家家仆 智商不重要 习二坐船 万岁来武汉了 “复辟” 近身平A 大大品牌 维尼熊给跳跳虎黄牌 头号球迷 十里山路不换肩 羽日帝 喜包皮 卡近菲 共哀宗 习三点 中国首席造梦大师 夶 新影帝 拉清单 萨格尔王 爱新觉罗·近平 习犬犬 皇帝梦 坡涛汹涌 腊肉包 小习微信 戴口赵 屎禁评 动森 习壳郎 维尼快乐组织（Winnie##Happy##Organization）简称WHO 中国的新皇帝 冠子兵法 嬉包皮 习殡法 独裁者 细颈瓶 大大招牌 习包子 读书单 甴种 皇帝亲临忠诚的武汉 xdd 中国拉清单工作领导小组组长 electron8964 称帝修宪 最后领导人 狙击手布阵 裸宽包子劾心 习张三丰 習敗敗 任大炮 毛装 万岁 尼哥 习大林 系包皮 朝令夕改 720事件 亲自指挥疫情 喷粪帝 “习泽东”和“洪宪”（袁世凯的帝号） 习躲躲 瘟疫领主习近平 非洲大撒币 彩色哥 习低能儿 宽衣大帝 人民领袖 庆丰帝的千秋梦 糟糕皇帝 倒车斯基 Mr##Shithole 断崖式下跌 翡翠娘娘 Cicada##3301##XD 五毛主席 刁槑夶尛 毛泽东2.0 《生物安全法》 灭共助推器 疯狂宇宙包 习“甩锅” 粪坑先生 习条英机 习近平光辉形象 习厉王 包经 支那毒王 包子病毒 富平学霸刁斤干 万岁来武汉 电脑世代586 氼兲嫑炛 习梦死 维尼挂彩 包惠帝 冰棒外交 超邓赶毛 不同意的举手##没有##没有 读稿机 抗麦套装 金科律玉 WHO的君王 习##卡##巴##卡 腊肉馅儿包子 习大犬 黄俄 爱新觉罗近平 近言 不知名氏 习思想 维尼警察（X） 总加速师 赵王 习尔布特 习匪 足球外交 动物之森 墙内人 The##Xi##Factor（习近平因素） 宰相 习大帝 习远凸 禁评大帝 甩锅侠 感恩教育 习梦撕 十日文革 习匪帝 法外狂徒Lucy（德国） 习废帝 赛禁评 北红尾鸲 墨索里习 习包子 赵付 习猪头 习大 武汉委托李克强 耀眼黄红黄 中国特色射秽煮疫制度 第一书记王沪宁 皇帝的新衣 官僚主义 习习蛤蛤 小学博士 近日成 恩维尔·霍习 维尼带货 一天游泳一千米 通商宽衣 野兽主席 时间控制 纳翠党 川普的朋友or敌人 大海掀翻小池塘 人尽皆知的体育迷 习下台 坡涛汹涌 法习斯 庆丰废物 两会期间+隐瞒 沼气专家 戏博士 秦城监狱 视频看望 nmslman（习主席） 邪大大 独裁国贼 这个年很静 做N届的主席 崇祯帝 维尼史 半羽习近平 习总 屎進瓶 习病法 吸包皮 狙击手待命 习博士 叼斤干 习狍 亲自指挥 太祖兔 洗尽贫 刁后主 毛魔转世 役民五术 主席+终身制 狙击手待命 民进党 格萨尔 维尼写史 平话 捐麦子 云视察 隔离”的金葫芦 SB包子 习猪下台 习孢子 习老八 现任匪首 战疫国 4中组长 武统时代 倒车帝 讨习檄文 哲欣 习澳塞斯库 中国离岸隐匿资产管理工作领导小组组组长 习核心 撒币宝 支那精神野爹 习呆呆 倒车 毛近平 XD 习奥赛斯库 颐指气使 平平 扛麦帝 XDD 赵人13 叩谢习恩 形式主义防疫 virus##king 维尼大帝 总书记来我家 背书单 吸精瓶 主席贺词 每日祈翠 习公奭 刁斤二 红旗下的蛋 袁世凯第二 习梦思 颐使气指 禁评封号 shit侯 习言乱语 CoronaXi 头上三尺有神明 清华毕业 鞋哥 包子兵法 习宽衣 习家军 shuu##kinn##pei 大国造疫 天安门合法继承人 二百斤 修宪帝 习大乞 Voice##of##Pooh “皇帝梦” 乳透社##小反旗 习Core 大撒币 截颈平 “登基” 总统包子习 一带一路 号尿壶公 亲自脱贫 修宪 习和谐 通商宽衣 九大诉求 游泳一千米 人民领袖 闹得欢 满脸喷粪 习二胖 甴近平 习皇的新装 追思焦裕禄 基拉大和习近平 悉包皮 冤大头 普近 习瘟猪 相信有神论的物理学博士 中国爱非洲 屎侯 白猪 慨撒大帝 维稳警察（O） 赵弹 习蛤 习三拍 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 包帝巡游 央视姓党 习得梁家书卷 習敗北 10号跳跳虎被维尼拉清单 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 我是一个足球迷 蔡英文最强助选 习屎黄 维尼连任 人均接近八千万 重地之战 祈翠 庆丰称帝 尊蛤讨包 昆明湖涨潮 晚共昏君 Criminal##Xi##"Xitler"##Jinping 连专家也为之叹服的电脑天才 没有网络安全就没有国家安全 包包大人 国王 维持会长 包大人 劝进 瘟疫降生习近平 习语录 NMSL Heil##Xitler V尼哥 “黄袍加身” shit禁评 人民战争 20000T麦子 叩谢习恩 野心习 动物庄园 次级乳包 傻大头 假.."~bang！卒 日子像蜜甜 习太孑 野兽先辈 食腐虫 无限连任 习流氓 那翠化 Adolf##Xitler 孢 枪毙名单 百万雄师事件 习贼 习兵法 包包侠 包禁评 末代皇帝 贬词包用 黑白翠 习emperor 送礼平 匪酋习维尼 ChinaXi 维尼DISCO 习夶 习式病毒 专治各种不服 阿平 老歪脖子树 毛孙 包皇 二次袁、袁世凯二世、袁二 毛进平 青年大学包 核平全世界 韦来书记 席近平 学包分子 刁二婚 冲塔 塔西佗陷阱 习像章 不敢高声语 骑巨龙 退党 信女愿一生吃素 帝皇頌 禁评的理由 386系统驱动游戏 习是春竹 东方project 孙笑川 粪坑兵法 战“疫”金句 学包率 习后主 花花公子 厕所革命 总书记来过我的家 北京中南海支部书记 清零宗、清零帝 维尼·屎(Winnie##the##Poo) 平&强 乳制品 习背书 口罩外交 清单帝 国贼习近平 恐惊天上人 2020全面小康 大锅瞻遗 習大佬 神明论 集金币 动物森友会 不强自息 庆丰包·勃列日涅夫 */
package com.pcdd.sonovel;

import com.pcdd.sonovel.core.CoverUpdater;
import com.pcdd.sonovel.model.Book;
import org.junit.jupiter.api.Test;

/**
 * @author pcdd
 * Created at 2025/2/6
 */
class CoverUpdaterTest {

    @Test
    void test01() {
        Book book = new Book();
        book.setBookName("从遮天开始穿越");
        book.setAuthor("心之火");
        System.out.println(CoverUpdater.fetchZongheng(book));
    }

}