/* 捐麦子 北京中南海支部书记 背书单 包子宪法 赵付 彩色熊 修宪连任 习二坐船 习二卒 维尼快乐组织（Winnie##Happy##Organization）简称WHO 维尼史 匪酋习维尼 亲自考察 Criminal##Xi##"Xitler"##Jinping 野兽先辈 庆丰包·勃列日涅夫 世界最强乞丐 刁斤二 习匪帝 隔离”的金葫芦 皇帝亲临忠诚的武汉 国贼习近平 习像章 习一尊 习教父 习奥赛斯库 大大品牌 “皇帝梦” Chairman##Xi 维尼熊 习索里尼 金科律玉 总书记来过我的家 细瓶颈 习尔布特 这个年很静 毛魔转世 恐惊天上人 XDD 维尼之声 万岁来武汉 习核心 中国的新皇帝 习付 ChinaXi vop 每日祈翠 中国爱非洲 央视姓党 包惠帝 学包率 裸宽包子劾心 迈克尔·索伊 习包子 倒车帝 包大人 家业论 維尼頌 习是春绿 赛禁评 CoronaXi 追思焦裕禄 毛近平 包子兵法 悉包皮 纳翠党 儿童习典 你是反贼吗 第22条军规 读稿机 时间控制 刁人13 庆丰废物 厕所革命 The##Xi##Factor（习近平因素） 疫情蔓延 习包子的Fa 习武帝 孢 法外狂徒Lucy（德国） 习家军 祈翠語言包 包子露宪 晚共昏君 屎侯 主席+终身制 “登基” 拉清单 习大郎 闹得欢 中字头组长 习屎黄 屎進瓶 XD 包帝巡游 九大诉求 鞋哥 习大 总加速师 蹄防 近身平A 20000T麦子 倒车 刁人13 赵弹 习包子 刁大犬 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 游泳一千米 中国特色射秽煮疫制度 白猪 习老八 “梦回大清” 习语 习梦撕 瘟疫领主习近平 五毛主席 支那精神野爹 习蛤 毛二 平话 维稳警察（O） 慨撒大帝 翡翠娘娘 皇帝亲临忠诚的武汉 狙击手布阵 武当七侠的政治斗争 仲夏夜之中国梦 皇帝梦 倒车斯基 赵家家仆 洗包皮 包包侠 亲自指挥 近言 蔡英文最强助选 习宽衣 独裁者 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 叩谢习恩 疯狂宇宙包 习侯 习病法 刁近乎 腊肉包 傻大头 维尼带货 一带一路 习皇帝 扛麦帝 习澳塞斯库 任志强 吸包皮 当代秦始皇 习进棺 200吨 小学博士 甩锅侠 大国造疫 卡近菲 习废帝 主席贺词 秦城监狱 习二世胡亥 清单帝 朝令夕改 退党 颐指气使 习习蛤蛤 哲欣 世宗 Corona##Xi（习病毒） 习猪头 添宪宝宝 食腐虫 V尼哥 720事件 影子末帝 中国离岸隐匿资产管理工作领导小组组组长 墨索里习 冲塔 nmslman（习主席） 修宪 信女愿一生吃素 WHO的君王 阿平 大锅瞻遗 格萨尔 不强自息 劝进 爱新觉罗近平 “习泽东”和“洪宪”（袁世凯的帝号） 习包皮 不同意的举手##没有##没有 386系统驱动游戏 我是一个足球迷 终身领导人 花花公子 集近闭 灭共助推器 中国首席造梦大师 习近砰 习呆呆 错误执行者 习流氓 战疫国 役民五术 习得梁家书卷 习思想 尼哥 毛二世 梁家河贵族 习张三丰 野心习 糖尿维尼 任大炮 《生物安全法》 贬词包用 亲自封号 西朝鲜人民自治岛 electron8964 帝皇頌 民进党 A##Big##Deal 梦帝 相信有神论的物理学博士 假.."~bang！卒 宰相 没有网络安全就没有国家安全 禁评的理由 头上三尺有神明 普近 习博士 一天游泳一千米 习二胖 4中组长 梦回大清 习公奭 超邓赶毛 通商宽衣 刁二将 青年大学包 爱新觉罗·近平 屎禁评 包包大人 总统包子习 习正日 疯狂宇宙 颐使气指 习达姆 彭主席（习主席走了太太接班） 习奥塞斯库 叼斤干 动物森友会 嬉包皮 裹嘎举吸钢闸门 庆丰称帝 习厉王 亲自删评 习卒 形式主义防疫 刁后主 岿然不动 总书记来我家 赵王 洗尽贫 红旗下的蛋 发皇帝梦 百万雄师事件 禁评大帝 学包积极分子 人类命运共同体首席架构师 赵人13 庆丰帝的千秋梦 人均接近八千万 现任匪首 习远凸 大撒币 九评 习Core 不知名氏 小学居士 SB包子 集金pay 连专家也为之叹服的电脑天才 刁远山 近日成 习尿瓶 太祖兔 川普的朋友or敌人 恩重如删 习太孑 疯狂宇宙大帝 坡涛汹涌 讨习檄文 清华毕业 习和谐 维尼警察（X） 枪毙名单 撒币宝 習敗敗 人民领袖 巴拿马文件 称帝修宪 万岁来武汉了 官僚主义 习emperor 习王的田野上 习是春竹 中国拉清单工作领导小组组长 喜包皮 书单吟诵者 断崖式下跌 孙笑川 东瘟疫之地统治者暨全境守护者 禁评封号 shit##hole##bing##fa 10号跳跳虎被维尼拉清单 䒒(tiáo)菦(qín)苹(píng) 冠子兵法 习近平光辉形象 神明论 嘻包皮 包子金刚腿 次级乳包 野蛮其体魄 习特勒 公车上书 惜包皮 习皇的新装 平平 习躲躲 Heil##Xitler 瘟疫降生习近平 bingbang帝 平&强 不敢高声语 学包分子 富平学霸刁斤干 刁近猴 习夶 维尼写史 坟头蹦迪 习大林 亲自指挥疫情 没规划的葬礼 氼兲嫑炛 两会期间+隐瞒 习##卡##巴##卡 武汉委托李克强 叩谢习恩 维尼连任 北红尾鸲 “黄袍加身” 野兽主席 习孢子 维尼DISCO 习“甩锅” 羽日帝 习下台 习低能儿 十日文革 当皇帝的小丑 习三点 维尼梗有害 shuu##kinn##pei 习king 头号球迷 习歪嘴 大大招牌 十一郎习近平 耀眼黄红黄 习猪席 习总输记 扛麦郎 习犬犬 习兵法 日子像蜜甜 习三拍 包皇 冤大头 Cicada##3301##XD 塔西佗陷阱 shit侯 乳制品 坡涛汹涌 喷粪帝 初二圣君 习条英机 普习金 御板泽民 nmslese##dream 习包子 电脑世代586 戏博士 乳包文化 习梦死 二百五大帝 毛装 习梦思 东方project 亲自脱贫 智商不重要 宽衣帝 习贼 墙内人 习禁评 大撒幣 感恩教育 狙击手待命 習敗北 战“疫”金句 毛二习 小习微信 习瘟猪 大兔 梁家河 戏包皮 Voice##of##Pooh 外交习语 灰习牛 席近平 老歪脖子树 足球外交 当代秦二世 专治各种不服 尊蛤讨包 Adolf##Xitler 支那毒王 崇祯帝 皇帝的新衣 字共狗 基拉大和习近平 习狍 法习斯 袭包皮 核平全世界 刁斤山 冰棒外交 阳台上的哨兵 号屎洞 系包皮 “复辟” 习背书 玉习大帝 shit禁评 狙击手待命 恩维尔·霍习 孤独的毒王 毛进平 做N届的主席 习总 读书单 人民战争 共哀宗 黑白翠 号尿壶公 刁二婚 吃赵弹 领袖习澡水 口罩大会 “无罩”现身 习驴 维尼熊给跳跳虎黄牌 阿道夫-习 習大佬 包子病毒 维尼挂彩 韦来书记 文明其精神 老街 维尼大帝 Mr##Shithole 习后主 粪坑兵法 动物之森 第一书记王沪宁 戴口赵 彩色哥 送礼平 糟糕皇帝 细颈瓶 习语录 大撒币 xdd 维尼·屎(Winnie##the##Poo) 毛孙 人民领袖 猪禁评 通商宽衣 祈翠 胡志平 包禁评 那翠化 崇祯 NMSL 昆明湖涨潮 黄俄 习卒习 粪坑先生 视频看望 親自蒞臨 动森 末代皇帝 腊肉馅儿包子 最后领导人 国王 集金币 习匪 动物庄园 2020全面小康 习大乞 万岁 习式病毒 武统时代 习殡法 “登机”（与登基同音） 席子兵法 重地之战 人尽皆知的体育迷 吸精瓶 习二蛋 新影帝 邪大大 親自視頻 virus##king 习二二（二零二零年五月二十二日开二会） 夶 64岁 习时代 维持会长 截颈平 口罩外交 共哀宗 袁世凯第二 云视察 中国离岸隐匿资产管理工作领导小组组组长 骑巨龙 沼气专家 半羽习近平 包经 习大帝 乳透社##小反旗 习言乱语 习猪下台 红二代 满脸喷粪 指定接班人 无限连任 独彩者 抗麦套装 天安门合法继承人 习大犬 大海掀翻小池塘 刁槑夶尛 */
package com.pcdd.sonovel;

import cn.hutool.core.lang.Console;
import lombok.SneakyThrows;
import org.jsoup.Connection;
import org.jsoup.Jsoup;

public class JsoupTest {

    /**
     * <a href="https://github.com/jhy/jsoup/pull/2164">jsoup-1.18.1增加了Response进度事件接口</a>
     */
    @SneakyThrows
    public static void main(String[] args) {
        String url = "https://www.baidu.com/";

        Connection con = Jsoup.connect(url).timeout(5000)
                .onResponseProgress((processed, total, percent, response) -> {
                    Console.log(percent + "%");
                });

        System.out.println(con.response());
    }

}