/* 屎禁评 翡翠娘娘 糖尿维尼 习Core 恐惊天上人 386系统驱动游戏 200吨 玉习大帝 非洲大撒币 裹嘎举吸钢闸门 第一书记王沪宁 习尔布特 战“疫”金句 老歪脖子树 甴种 最后领导人 慨撒大帝 亲自封号 电脑世代586 五毛主席 庆丰包·勃列日涅夫 习曱甴 细颈瓶 战疫国 毛装 第22条军规 习和谐 中国离岸隐匿资产管理工作领导小组组组长 习二坐船 赛禁评 庆丰称帝 宰相 一天游泳一千米 野兽主席 尊蛤讨包 喷粪帝 維尼頌 人类命运共同体首席架构师 总加速师 二百五大帝 习犬犬 那翠化 彭主席（习主席走了太太接班） 乳制品 包子兵法 XDD 禁评大帝 习宽衣 主席贺词 迈克尔·索伊 习家军 冠子兵法 恩重如删 野心习 维尼大帝 不同意的举手##没有##没有 共哀宗 读书单 疯狂宇宙包 习习蛤蛤 习侯 武统时代 毛泽东2.0 猪禁评 仲夏夜之中国梦 人均接近八千万 shuu##kinn##pei 习emperor 文明其精神 shit禁评 习“甩锅” 朝令夕改 独裁国贼 习呆呆 错误执行者 维尼快乐组织（Winnie##Happy##Organization）简称WHO 格萨尔 东瘟疫之地统治者暨全境守护者 讨习檄文 巴拿马文件 夶 习大 武当七侠的政治斗争 东方project 满脸喷粪 习奥塞斯库 720事件 亲自考察 叼斤干 习像章 习是春竹 洗尽贫 阿平 刁斤二 形式主义防疫 贬词包用 清零宗、清零帝 清华毕业 刁后主 electron8964 国王 沼气专家 维尼连任 毛二世 习流氓 “登基” 万岁来武汉了 现任匪首 你是反贼吗 大海掀翻小池塘 习二胖 习语录 习匪帝 支那毒王 习梦撕 隔离”的金葫芦 vop 动物之森 孤独的毒王 坟头蹦迪 二百斤 䒒(tiáo)菦(qín)苹(píng) 大国造疫 习语 核平全世界 包包侠 独彩者 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ A##Big##Deal Voice##of##Pooh 白猪 系包皮 屎侯 追思焦裕禄 习正日 邪大大 WHO的君王 扛麦郎 北红尾鸲 日子像蜜甜 粪坑先生 集近闭 信女愿一生吃素 初二圣君 平平 动物森友会 习梦死 习##卡##巴##卡 习奥塞斯库、齐奥塞斯库 颐指气使 劝进 中国离岸隐匿资产管理工作领导小组组组长 “梦回大清” 64岁 号尿壶公 祈翠語言包 习病法 狙击手布阵 席子兵法 戴口赵 纳翠党 中国首席造梦大师 领袖习澡水 大撒幣 大兔 黄俄 virus##king 习驴 习殡法 习式病毒 习包皮 习大犬 平话 中国的新皇帝 乳包文化 任志强 习二二（二零二零年五月二十二日开二会） 每日祈翠 西朝鲜人民自治岛 毛二 发皇帝梦 云视察 彩色哥 学包积极分子 次级乳包 皇帝亲临忠诚的武汉 人尽皆知的体育迷 习奥赛斯库 孢 老街 CoronaXi 红二代 二次袁、袁世凯二世、袁二 习躲躲 半羽习近平 卡近菲 包帝巡游 世界最强乞丐 视频看望 习达姆 习蛤 当皇帝的小丑 包子金刚腿 习是春绿 影子末帝 修宪帝 习王的田野上 指定接班人 恩维尔·霍习 人民领袖 中国拉清单工作领导小组组长 无限连任 戏包皮 bingbang帝 习二世胡亥 动森 百万雄师事件 十一郎习近平 “复辟” 坡涛汹涌 瘟疫降生习近平 相信有神论的物理学博士 维尼·屎(Winnie##the##Poo) 包包大人 shit侯 习包子 习特勒 瘟疫领主习近平 屎進瓶 习思想 塔西佗陷阱 习皇帝 2020全面小康 刁远山 彩色熊 通商宽衣 一带一路 阳台上的哨兵 “黄袍加身” 天安门合法继承人 大大招牌 书单吟诵者 庆丰废物 习近平光辉形象 习猪头 十日文革 羽日帝 法外狂徒Lucy（德国） 近身平A 十里山路不换肩 习总输记 习包子 shit##hole##bing##fa 习大乞 习教父 习孢子 宽衣帝 我是一个足球迷 习澳塞斯库 毛二习 爱新觉罗近平 胡志平 黑白翠 近言 梁家河贵族 狙击手待命 习三拍 富平学霸刁斤干 基拉大和习近平 没有网络安全就没有国家安全 赵付 拉清单 叩谢习恩 学包分子 包子宪法 习屎黄 xdd 任大炮 庆丰帝的千秋梦 親自視頻 皇帝梦 官僚主义 游泳一千米 退党 冤大头 ChinaXi 习尽贫 习时代 XD 颐使气指 超邓赶毛 两会期间+隐瞒 习梦思 吸精瓶 习壳郎 刁近乎 中字头组长 腊肉包 疫情蔓延 九评 毛近平 川普的朋友or敌人 人民领袖 毛孙 不知名氏 习厉王 赵家家仆 习匪 赵王 中国特色射秽煮疫制度 普近 这个年很静 吃赵弹 倒车斯基 包禁评 习瘟猪 倒车 習敗北 添宪宝宝 学包率 岿然不动 蔡英文最强助选 小学居士 扛麦帝 骑巨龙 习武帝 冲塔 赵人13 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 習敗敗 刁大犬 没规划的葬礼 Chairman##Xi Mr##Shithole 嘻包皮 不强自息 新影帝 习低能儿 亲自删评 集金pay 习后主 禁评的理由 撒币宝 喜包皮 习条英机 做N届的主席 NMSL 习尿瓶 央视姓党 花花公子 墨索里习 足球外交 刁槑夶尛 狙击手待命 截颈平 维尼警察（X） 裸宽包子劾心 耀眼黄红黄 习近砰 修宪 20000T麦子 习张三丰 青年大学包 亲自指挥 4中组长 包经 读稿机 毛进平 韦来书记 冰棒外交 习二卒 九大诉求 红旗下的蛋 人民战争 当代秦二世 习狍 习大郎 习大林 习言乱语 袭包皮 习歪嘴 習大佬 崇祯 总书记来我家 毛魔转世 习贼 国贼习近平 V尼哥 习远凸 洗包皮 维尼熊给跳跳虎黄牌 小学博士 赵弹 甩锅侠 总书记来过我的家 习皇的新装 厕所革命 Criminal##Xi##"Xitler"##Jinping 役民五术 孙笑川 习卒习 习得梁家书卷 头号球迷 阿道夫-习 主席+终身制 重地之战 独裁者 刁二婚 惜包皮 包子露宪 禁评封号 当代秦始皇 习进棺 不敢高声语 帝皇頌 习兵法 背书单 灰习牛 万岁来武汉 “无罩”现身 习大帝 梁家河 粪坑兵法 时间控制 习包子的Fa 哲欣 晚共昏君 习下台 刁二将 假.."~bang！卒 疯狂宇宙 外交习语 习包子 倒车帝 戏博士 习一尊 枪毙名单 连专家也为之叹服的电脑天才 梦回大清 万岁 叩谢习恩 食腐虫 习老八 习博士 神明论 亲自脱贫 习猪下台 糟糕皇帝 维稳警察（O） 习公奭 Adolf##Xitler 集金币 修宪连任 親自蒞臨 nmslese##dream 家业论 头上三尺有神明 智商不重要 匪酋习维尼 维尼史 维尼写史 习总 包子病毒 习夶 维尼带货 习背书 昆明湖涨潮 刁近猴 刁人13 坡涛汹涌 SB包子 灭共助推器 平&强 野蛮其体魄 “皇帝梦” 维尼熊 公车上书 包惠帝 支那精神野爹 中国爱非洲 习索里尼 抗麦套装 习卒 习付 席近平 太祖兔 称帝修宪 终身领导人 尼哥 闹得欢 小习微信 刁人13 秦城监狱 祈翠 亲自指挥疫情 习废帝 萨格尔王 刁斤山 末代皇帝 乳透社##小反旗 感恩教育 维尼挂彩 nmslman（习主席） 口罩大会 “习泽东”和“洪宪”（袁世凯的帝号） 皇帝的新衣 维持会长 蹄防 断崖式下跌 民进党 习禁评 甴近平 大撒币 《生物安全法》 近日成 野兽先辈 崇祯帝 动物庄园 法习斯 傻大头 清单帝 10号跳跳虎被维尼拉清单 爱新觉罗·近平 习太孑 金科律玉 皇帝亲临忠诚的武汉 Cicada##3301##XD 儿童习典 疯狂宇宙大帝 嬉包皮 御板泽民 维尼梗有害 习二蛋 The##Xi##Factor（习近平因素） 习三点 普习金 包皇 通商宽衣 大锅瞻遗 “登机”（与登基同音） 武汉委托李克强 捐麦子 悉包皮 氼兲嫑炛 号屎洞 Heil##Xitler 吸包皮 字共狗 送礼平 习猪席 梦帝 维尼之声 墙内人 包大人 大大品牌 口罩外交 袁世凯第二 共哀宗 宽衣大帝 鞋哥 腊肉馅儿包子 Corona##Xi（习病毒） 世宗 总统包子习 细瓶颈 维尼DISCO 习king 专治各种不服 北京中南海支部书记 习核心 */
package com.pcdd.sonovel;

import cn.hutool.core.lang.Console;
import lombok.SneakyThrows;
import org.jsoup.Connection;
import org.jsoup.Jsoup;

public class JsoupTest {

    /**
     * <a href="https://github.com/jhy/jsoup/pull/2164">jsoup-1.18.1增加了Response进度事件接口</a>
     */
    @SneakyThrows
    public static void main(String[] args) {
        String url = "https://www.baidu.com/";

        Connection con = Jsoup.connect(url).timeout(5000)
                .onResponseProgress((processed, total, percent, response) -> {
                    Console.log(percent + "%");
                });

        System.out.println(con.response());
    }

}