/* 习包子的Fa 习尽贫 习言乱语 裹嘎举吸钢闸门 Heil##Xitler 法外狂徒Lucy（德国） 彩色熊 感恩教育 习三拍 普近 儿童习典 习索里尼 近言 富平学霸刁斤干 习背书 九评 两会期间+隐瞒 习宽衣 拉清单 习近砰 习家军 纳翠党 习大乞 包子兵法 “登机”（与登基同音） 习曱甴 信女愿一生吃素 习大林 惜包皮 匪酋习维尼 习低能儿 习太孑 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 屎禁评 狙击手待命 央视姓党 书单吟诵者 东瘟疫之地统治者暨全境守护者 爱新觉罗近平 virus##king 新影帝 孢 禁评的理由 维尼史 宰相 习公奭 总统包子习 游泳一千米 集近闭 亲自考察 包禁评 习思想 现任匪首 阿平 习武帝 中国拉清单工作领导小组组长 习呆呆 习教父 食腐虫 Corona##Xi（习病毒） 相信有神论的物理学博士 人尽皆知的体育迷 䒒(tiáo)菦(qín)苹(píng) 岿然不动 武统时代 维尼挂彩 腊肉馅儿包子 ChinaXi 学包分子 瘟疫领主习近平 贬词包用 吸包皮 世界最强乞丐 习语录 帝皇頌 动物庄园 习驴 清单帝 国王 习特勒 任大炮 不同意的举手##没有##没有 习和谐 维尼警察（X） 小学居士 太祖兔 维尼熊 禁评封号 天安门合法继承人 总书记来过我的家 崇祯 人均接近八千万 习正日 习包子 战“疫”金句 断崖式下跌 bingbang帝 无限连任 维尼快乐组织（Winnie##Happy##Organization）简称WHO 字共狗 武当七侠的政治斗争 追思焦裕禄 做N届的主席 二次袁、袁世凯二世、袁二 中国离岸隐匿资产管理工作领导小组组组长 赵付 扛麦帝 习二世胡亥 包包侠 口罩大会 习病法 五毛主席 超邓赶毛 劝进 包子金刚腿 习二蛋 彭主席（习主席走了太太接班） 普习金 习张三丰 支那精神野爹 羽日帝 中国爱非洲 “复辟” 习核心 耀眼黄红黄 金科律玉 习得梁家书卷 末代皇帝 刁近猴 包帝巡游 维尼·屎(Winnie##the##Poo) 疯狂宇宙大帝 当皇帝的小丑 习奥塞斯库 发皇帝梦 粪坑兵法 邪大大 习尿瓶 卡近菲 平话 刁远山 北京中南海支部书记 近身平A 包皇 CoronaXi 十日文革 习皇帝 刁人13 中国特色射秽煮疫制度 毛孙 祈翠語言包 骑巨龙 抗麦套装 半羽习近平 毛泽东2.0 习殡法 “梦回大清” 维尼梗有害 影子末帝 十里山路不换肩 坡涛汹涌 习条英机 官僚主义 nmslese##dream 错误执行者 A##Big##Deal 维持会长 指定接班人 孤独的毒王 习下台 老歪脖子树 讨习檄文 白猪 nmslman（习主席） 喷粪帝 十一郎习近平 读书单 毛二世 塔西佗陷阱 习贼 禁评大帝 屎侯 嬉包皮 毛装 习禁评 格萨尔 战疫国 墨索里习 包经 最后领导人 袭包皮 疫情蔓延 公车上书 XDD 通商宽衣 二百五大帝 维尼连任 一天游泳一千米 送礼平 夶 重地之战 “黄袍加身” 花花公子 基拉大和习近平 习后主 仲夏夜之中国梦 青年大学包 祈翠 爱新觉罗·近平 xdd 背书单 万岁 习壳郎 习屎黄 连专家也为之叹服的电脑天才 Voice##of##Pooh 习老八 大撒币 西朝鲜人民自治岛 习进棺 习匪 捐麦子 亲自指挥疫情 親自蒞臨 Criminal##Xi##"Xitler"##Jinping 口罩外交 恩维尔·霍习 习兵法 宽衣大帝 大国造疫 玉习大帝 倒车帝 蹄防 狙击手布阵 梦回大清 枪毙名单 坟头蹦迪 电脑世代586 习是春竹 国贼习近平 学包率 总加速师 XD 足球外交 阳台上的哨兵 习孢子 庆丰帝的千秋梦 庆丰包·勃列日涅夫 习emperor 乳包文化 人民战争 维尼之声 坡涛汹涌 万岁来武汉了 独裁者 亲自封号 electron8964 灭共助推器 动森 不强自息 退党 刁大犬 亲自删评 V尼哥 动物森友会 阿道夫-习 叩谢习恩 灰习牛 疯狂宇宙包 野兽先辈 一带一路 次级乳包 任志强 平平 200吨 毛二习 习习蛤蛤 习犬犬 崇祯帝 川普的朋友or敌人 习狍 嘻包皮 习侯 老街 刁槑夶尛 习夶 这个年很静 修宪帝 韦来书记 習敗北 沼气专家 刁人13 中国首席造梦大师 习二胖 鞋哥 中国的新皇帝 赵家家仆 翡翠娘娘 喜包皮 专治各种不服 习##卡##巴##卡 毛近平 赵王 猪禁评 习蛤 习一尊 10号跳跳虎被维尼拉清单 shit##hole##bing##fa WHO的君王 习厉王 非洲大撒币 糟糕皇帝 习像章 习卒 包惠帝 Adolf##Xitler 2020全面小康 冲塔 彩色哥 法习斯 习梦撕 隔离”的金葫芦 独彩者 氼兲嫑炛 习大犬 初二圣君 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 习二卒 百万雄师事件 颐指气使 形式主义防疫 号屎洞 习远凸 习付 皇帝的新衣 支那毒王 刁二婚 皇帝亲临忠诚的武汉 大大品牌 总书记来我家 毛进平 洗包皮 巴拿马文件 役民五术 主席贺词 尊蛤讨包 你是反贼吗 习二二（二零二零年五月二十二日开二会） 当代秦二世 小习微信 习猪席 核平全世界 吸精瓶 近日成 习流氓 人民领袖 主席+终身制 冰棒外交 假.."~bang！卒 包子病毒 冠子兵法 甴种 智商不重要 20000T麦子 刁斤二 小学博士 神明论 添宪宝宝 傻大头 386系统驱动游戏 习卒习 习近平光辉形象 恩重如删 细颈瓶 孙笑川 甴近平 习尔布特 每日祈翠 大锅瞻遗 维尼DISCO 清华毕业 迈克尔·索伊 红二代 刁二将 家业论 维尼熊给跳跳虎黄牌 头号球迷 那翠化 习瘟猪 日子像蜜甜 习匪帝 世宗 黄俄 习式病毒 没规划的葬礼 野心习 恐惊天上人 Cicada##3301##XD 腊肉包 习奥塞斯库、齐奥塞斯库 习大郎 东方project 习皇的新装 吃赵弹 疯狂宇宙 64岁 糖尿维尼 视频看望 毛二 洗尽贫 集金pay “登基” 习梦死 庆丰称帝 维尼带货 习大 720事件 甩锅侠 细瓶颈 慨撒大帝 野蛮其体魄 习是春绿 刁斤山 云视察 习达姆 习“甩锅” 习包皮 习猪头 亲自指挥 習大佬 SB包子 昆明湖涨潮 平&强 4中组长 武汉委托李克强 独裁国贼 粪坑先生 維尼頌 “皇帝梦” 习梦思 终身领导人 厕所革命 倒车斯基 维稳警察（O） 习总输记 瘟疫降生习近平 野兽主席 亲自脱贫 习三点 習敗敗 中字头组长 修宪 赵人13 修宪连任 共哀宗 The##Xi##Factor（习近平因素） 叩谢习恩 萨格尔王 大大招牌 截颈平 共哀宗 扛麦郎 维尼大帝 包子露宪 外交习语 乳透社##小反旗 习king 蔡英文最强助选 我是一个足球迷 习语 人类命运共同体首席架构师 动物之森 shit禁评 庆丰废物 皇帝亲临忠诚的武汉 “无罩”现身 狙击手待命 习大帝 满脸喷粪 习博士 没有网络安全就没有国家安全 习时代 第22条军规 戏博士 人民领袖 叼斤干 朝令夕改 皇帝梦 习废帝 大兔 大海掀翻小池塘 《生物安全法》 九大诉求 shit侯 倒车 秦城监狱 集金币 包子宪法 系包皮 清零宗、清零帝 北红尾鸲 头上三尺有神明 颐使气指 第一书记王沪宁 尼哥 时间控制 大撒幣 御板泽民 号尿壶公 包包大人 屎進瓶 乳制品 习王的田野上 刁近乎 梁家河贵族 包大人 裸宽包子劾心 梦帝 习二坐船 学包积极分子 不敢高声语 当代秦始皇 习包子 胡志平 梁家河 民进党 称帝修宪 墙内人 晚共昏君 领袖习澡水 Mr##Shithole 宽衣帝 万岁来武汉 刁后主 习猪下台 通商宽衣 赵弹 vop 席近平 戴口赵 戏包皮 习Core 红旗下的蛋 读稿机 闹得欢 习歪嘴 二百斤 习总 袁世凯第二 撒币宝 维尼写史 习澳塞斯库 親自視頻 NMSL 习躲躲 哲欣 shuu##kinn##pei 中国离岸隐匿资产管理工作领导小组组组长 席子兵法 不知名氏 Chairman##Xi 悉包皮 黑白翠 赛禁评 文明其精神 “习泽东”和“洪宪”（袁世凯的帝号） 冤大头 习奥赛斯库 习包子 毛魔转世 */
package com.pcdd.sonovel.handle;

import cn.hutool.core.io.FileUtil;
import cn.hutool.core.lang.Console;
import cn.hutool.core.util.StrUtil;
import com.pcdd.sonovel.model.AppConfig;
import com.pcdd.sonovel.model.Book;
import lombok.AllArgsConstructor;
import lombok.SneakyThrows;

import java.io.File;

/**
 * @author pcdd
 * Created at 2024/3/17
 */
@AllArgsConstructor
public class CrawlerPostHandler {

    private final AppConfig config;

    @SneakyThrows
    public void handle(Book book, File saveDir) {
        String extName = config.getExtName();
        StringBuilder s = new StringBuilder(StrUtil.format("\n<== 《{}》（{}）下载完毕，", book.getBookName(), book.getAuthor()));

        if (extName.matches("(?i)^(txt|epub|pdf)$")) {
            s.append("正在合并为 ").append(extName.toUpperCase());
        }
        if ("html".equals(extName)) {
            s.append("正在生成 HTML 目录文件");
        }
        Console.log(s.append(" ..."));

        // 等待文件系统更新索引
        int attempts = 10;
        while (FileUtil.isDirEmpty(saveDir) && attempts > 0) {
            Thread.sleep(100);
            attempts--;
        }

        PostHandlerFactory.getHandler(extName, config).handle(book, saveDir);
    }

}