/* 百万雄师事件 4中组长 连专家也为之叹服的电脑天才 相信有神论的物理学博士 日子像蜜甜 习Core 习王的田野上 玉习大帝 哲欣 云视察 捐麦子 习张三丰 央视姓党 习包皮 万岁来武汉 彭主席（习主席走了太太接班） 昆明湖涨潮 无限连任 维尼快乐组织（Winnie##Happy##Organization）简称WHO 赵王 悉包皮 习背书 灭共助推器 人民领袖 国贼习近平 北红尾鸲 称帝修宪 习猪席 修宪连任 习思想 金科律玉 书单吟诵者 主席贺词 习包子 平&强 迈克尔·索伊 大大品牌 胡志平 卡近菲 次级乳包 20000T麦子 人民战争 习二二（二零二零年五月二十二日开二会） 习澳塞斯库 习后主 家业论 毛二世 墨索里习 nmslese##dream 崇祯 习宽衣 慨撒大帝 每日祈翠 习是春绿 NMSL 维尼挂彩 64岁 狙击手待命 包大人 彩色熊 傻大头 当代秦二世 习特勒 新影帝 五毛主席 赵人13 倒车斯基 刁槑夶尛 毛装 习卒习 宰相 口罩大会 维尼连任 720事件 武汉委托李克强 亲自指挥 读稿机 维尼熊 中国离岸隐匿资产管理工作领导小组组组长 乳制品 瘟疫降生习近平 “习泽东”和“洪宪”（袁世凯的帝号） 孢 祈翠語言包 习三点 vop 习二世胡亥 禁评大帝 大海掀翻小池塘 裹嘎举吸钢闸门 孙笑川 10号跳跳虎被维尼拉清单 尼哥 西朝鲜人民自治岛 花花公子 口罩外交 毛进平 冲塔 包子宪法 这个年很静 shit禁评 親自視頻 小学博士 乳包文化 庆丰称帝 小习微信 信女愿一生吃素 叼斤干 近日成 习近平光辉形象 发皇帝梦 中国的新皇帝 末代皇帝 蔡英文最强助选 不强自息 shit##hole##bing##fa 刁近猴 席子兵法 添宪宝宝 喜包皮 恩重如删 嘻包皮 维尼·屎(Winnie##the##Poo) 平平 禁评封号 超邓赶毛 Chairman##Xi 中国拉清单工作领导小组组长 老街 包帝巡游 亲自脱贫 “登基” 一天游泳一千米 巴拿马文件 戏博士 席近平 细瓶颈 吸包皮 习卒 智商不重要 习皇的新装 屎進瓶 嬉包皮 粪坑先生 习太孑 坡涛汹涌 半羽习近平 墙内人 你是反贼吗 任大炮 退党 习蛤 现任匪首 主席+终身制 “复辟” 总书记来过我的家 习语 通商宽衣 习武帝 动物之森 “登机”（与登基同音） 纳翠党 最后领导人 习条英机 东瘟疫之地统治者暨全境守护者 大兔 夶 武统时代 习远凸 阿道夫-习 赵付 野兽先辈 习歪嘴 中国离岸隐匿资产管理工作领导小组组组长 CoronaXi 200吨 彩色哥 习侯 平话 大撒币 食腐虫 独裁者 抗麦套装 习式病毒 扛麦郎 没规划的葬礼 岿然不动 习瘟猪 习##卡##巴##卡 独彩者 亲自封号 皇帝亲临忠诚的武汉 近言 习言乱语 中国特色射秽煮疫制度 习大 皇帝梦 恐惊天上人 撒币宝 中国爱非洲 韦来书记 灰习牛 错误执行者 Mr##Shithole 官僚主义 甩锅侠 晚共昏君 叩谢习恩 狙击手布阵 包包侠 习核心 爱新觉罗·近平 刁人13 颐指气使 刁大犬 第一书记王沪宁 中字头组长 近身平A 隔离”的金葫芦 崇祯帝 冠子兵法 戴口赵 袁世凯第二 包子兵法 习老八 XDD 维尼梗有害 普近 习大乞 皇帝亲临忠诚的武汉 十一郎习近平 人均接近八千万 枪毙名单 共哀宗 战“疫”金句 庆丰帝的千秋梦 邪大大 追思焦裕禄 御板泽民 Corona##Xi（习病毒） 维尼史 习大帝 影子末帝 习梦思 人类命运共同体首席架构师 视频看望 红二代 习废帝 Criminal##Xi##"Xitler"##Jinping 任志强 习索里尼 毛二习 通商宽衣 阳台上的哨兵 电脑世代586 背书单 役民五术 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 九大诉求 习时代 沼气专家 shuu##kinn##pei 習大佬 红旗下的蛋 刁后主 我是一个足球迷 太祖兔 足球外交 战疫国 糖尿维尼 二百五大帝 帝皇頌 维尼熊给跳跳虎黄牌 惜包皮 疯狂宇宙大帝 包子露宪 学包积极分子 颐使气指 宽衣帝 梦回大清 瘟疫领主习近平 习是春竹 猪禁评 野兽主席 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 习进棺 游泳一千米 习尿瓶 十日文革 习犬犬 习达姆 头上三尺有神明 九评 大撒币 翡翠娘娘 習敗北 神明论 讨习檄文 不知名氏 Adolf##Xitler 世宗 习公奭 习匪 大锅瞻遗 贬词包用 感恩教育 刁斤二 武当七侠的政治斗争 儿童习典 习付 共哀宗 爱新觉罗近平 祈翠 习下台 当代秦始皇 民进党 满脸喷粪 习禁评 糟糕皇帝 virus##king 包皇 梦帝 梁家河贵族 黑白翠 终身领导人 老歪脖子树 疯狂宇宙包 䒒(tiáo)菦(qín)苹(píng) 习教父 假.."~bang！卒 万岁来武汉了 人民领袖 bingbang帝 親自蒞臨 毛近平 基拉大和习近平 刁人13 习习蛤蛤 Heil##Xitler 习孢子 习呆呆 时间控制 2020全面小康 厕所革命 梁家河 习屎黄 阿平 习二蛋 习病法 WHO的君王 一带一路 世界最强乞丐 做N届的主席 白猪 野蛮其体魄 动森 习低能儿 总统包子习 重地之战 倒车 习贼 动物庄园 “皇帝梦” 拉清单 亲自指挥疫情 秦城监狱 386系统驱动游戏 冤大头 ChinaXi 匪酋习维尼 习像章 皇帝的新衣 包子金刚腿 袭包皮 习皇帝 东方project SB包子 毛魔转世 维尼DISCO 习尔布特 刁近乎 习梦死 习和谐 耀眼黄红黄 习大林 庆丰废物 尊蛤讨包 塔西佗陷阱 维稳警察（O） 裸宽包子劾心 仲夏夜之中国梦 习奥塞斯库 屎禁评 习猪下台 那翠化 清单帝 习夶 大国造疫 洗尽贫 清华毕业 富平学霸刁斤干 喷粪帝 骑巨龙 支那精神野爹 习驴 习king 赵家家仆 万岁 粪坑兵法 法外狂徒Lucy（德国） Voice##of##Pooh 刁斤山 疫情蔓延 維尼頌 国王 包经 恩维尔·霍习 习包子 习二卒 习包子 乳透社##小反旗 头号球迷 学包分子 习家军 《生物安全法》 维尼警察（X） 习厉王 两会期间+隐瞒 字共狗 系包皮 人尽皆知的体育迷 学包率 包包大人 号屎洞 shit侯 习大郎 法习斯 刁二婚 集金pay 形式主义防疫 青年大学包 刁远山 维尼带货 习一尊 毛二 集金币 习匪帝 腊肉馅儿包子 号尿壶公 普习金 断崖式下跌 野心习 吃赵弹 习兵法 坟头蹦迪 小学居士 不同意的举手##没有##没有 不敢高声语 没有网络安全就没有国家安全 叩谢习恩 总加速师 维尼之声 Cicada##3301##XD 领袖习澡水 习“甩锅” 孤独的毒王 “黄袍加身” 习语录 总书记来我家 修宪 习总 习三拍 中国首席造梦大师 朝令夕改 习近砰 包惠帝 腊肉包 习得梁家书卷 习奥赛斯库 文明其精神 氼兲嫑炛 闹得欢 The##Xi##Factor（习近平因素） 读书单 动物森友会 专治各种不服 禁评的理由 “无罩”现身 electron8964 庆丰包·勃列日涅夫 维持会长 维尼写史 “梦回大清” 习正日 V尼哥 习殡法 洗包皮 扛麦帝 包禁评 习二胖 核平全世界 第22条军规 川普的朋友or敌人 吸精瓶 指定接班人 集近闭 北京中南海支部书记 XD 习大犬 蹄防 狙击手待命 赵弹 鞋哥 习总输记 习梦撕 大撒幣 细颈瓶 習敗敗 天安门合法继承人 习躲躲 疯狂宇宙 nmslman（习主席） 包子病毒 xdd 倒车帝 习狍 外交习语 习猪头 劝进 格萨尔 赛禁评 初二圣君 习流氓 维尼大帝 屎侯 A##Big##Deal 当皇帝的小丑 习emperor 黄俄 送礼平 截颈平 刁二将 坡涛汹涌 支那毒王 习包子的Fa 大大招牌 公车上书 习二坐船 亲自删评 亲自考察 冰棒外交 羽日帝 毛孙 习博士 戏包皮 */
package com.pcdd.sonovel.handle;

import com.pcdd.sonovel.model.AppConfig;
import lombok.experimental.UtilityClass;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@UtilityClass
public class PostHandlerFactory {

    public PostProcessingHandler getHandler(String extName, AppConfig config) {
        return switch (extName) {
            case "txt" -> new TxtMergeHandler(config);
            case "epub" -> new EpubMergeHandler();
            case "html" -> new HtmlTocHandler();
            default -> throw new IllegalArgumentException("Unsupported format: " + extName);
        };
    }
}