/* 习大乞 独彩者 猪禁评 北红尾鸲 大国造疫 傻大头 习包子 氼兲嫑炛 Criminal##Xi##"Xitler"##Jinping vop 花花公子 近言 “复辟” 领袖习澡水 格萨尔 背书单 扛麦帝 习贼 包大人 总书记来过我的家 甩锅侠 动物之森 维尼史 习king 恩维尔·霍习 NMSL 习王的田野上 宽衣大帝 颐指气使 习尽贫 习二世胡亥 习曱甴 包经 Corona##Xi（习病毒） 闹得欢 坡涛汹涌 nmslese##dream 不强自息 系包皮 席近平 指定接班人 初二圣君 人民战争 习包子 洗尽贫 叩谢习恩 集金pay 习呆呆 蹄防 包子兵法 倒车帝 红二代 孤独的毒王 刁近猴 CoronaXi 习猪席 习病法 维尼挂彩 冤大头 平话 习背书 吸包皮 赵王 冲塔 通商宽衣 习流氓 ChinaXi 习卒习 读稿机 读书单 清单帝 富平学霸刁斤干 视频看望 通商宽衣 包子宪法 习emperor 儿童习典 拉清单 抗麦套装 习躲躲 屎侯 维尼熊 当代秦二世 任志强 家业论 时间控制 XDD 习奥塞斯库、齐奥塞斯库 两会期间+隐瞒 足球外交 一天游泳一千米 彩色熊 刁人13 梁家河 糖尿维尼 终身领导人 习二蛋 腊肉包 习三点 错误执行者 Voice##of##Pooh Adolf##Xitler 动森 亲自封号 普习金 第一书记王沪宁 悉包皮 字共狗 720事件 WHO的君王 戴口赵 席子兵法 无限连任 专治各种不服 爱新觉罗·近平 役民五术 习式病毒 bingbang帝 世宗 “习泽东”和“洪宪”（袁世凯的帝号） shuu##kinn##pei 口罩大会 大撒幣 孢 中国首席造梦大师 386系统驱动游戏 巴拿马文件 添宪宝宝 支那精神野爹 庆丰帝的千秋梦 习卒 连专家也为之叹服的电脑天才 沼气专家 信女愿一生吃素 当皇帝的小丑 太祖兔 东瘟疫之地统治者暨全境守护者 发皇帝梦 狙击手布阵 习孢子 尊蛤讨包 习思想 退党 赵家家仆 影子末帝 叼斤干 蔡英文最强助选 韦来书记 习习蛤蛤 世界最强乞丐 毛装 粪坑先生 习像章 “登机”（与登基同音） 维稳警察（O） 习大犬 捐麦子 习二坐船 Heil##Xitler 贬词包用 禁评封号 维尼熊给跳跳虎黄牌 二百斤 中国的新皇帝 皇帝梦 200吨 九评 習敗北 嬉包皮 半羽习近平 厕所革命 支那毒王 习语录 习近砰 包子露宪 每日祈翠 二百五大帝 重地之战 清华毕业 習敗敗 习“甩锅” 战“疫”金句 御板泽民 大大品牌 末代皇帝 乳透社##小反旗 习夶 毛二习 包帝巡游 刁斤二 刁后主 习猪头 外交习语 习达姆 迈克尔·索伊 XD 清零宗、清零帝 你是反贼吗 virus##king 庆丰包·勃列日涅夫 习包子的Fa 毛进平 习张三丰 昆明湖涨潮 “皇帝梦” 习索里尼 习禁评 夶 习犬犬 皇帝的新衣 狙击手待命 老歪脖子树 习教父 九大诉求 习澳塞斯库 恩重如删 小学居士 习低能儿 称帝修宪 万岁来武汉 毛泽东2.0 云视察 恐惊天上人 老街 裹嘎举吸钢闸门 那翠化 刁近乎 习博士 习皇帝 嘻包皮 纳翠党 习得梁家书卷 习条英机 习武帝 头号球迷 Chairman##Xi V尼哥 维尼梗有害 习进棺 习宽衣 朝令夕改 近身平A “登基” 维尼快乐组织（Winnie##Happy##Organization）简称WHO 非洲大撒币 五毛主席 祈翠 核平全世界 4中组长 彩色哥 亲自删评 中国离岸隐匿资产管理工作领导小组组组长 维尼DISCO 金科律玉 二次袁、袁世凯二世、袁二 墨索里习 维尼之声 疯狂宇宙包 小习微信 邪大大 维持会长 习二卒 10号跳跳虎被维尼拉清单 瘟疫降生习近平 习梦撕 粪坑兵法 习梦思 electron8964 讨习檄文 习匪帝 习梦死 习蛤 习后主 动物庄园 刁远山 习下台 假.."~bang！卒 人尽皆知的体育迷 习公奭 国贼习近平 萨格尔王 shit禁评 习包子 习太孑 祈翠語言包 慨撒大帝 袁世凯第二 包包大人 平平 疯狂宇宙大帝 万岁 平&强 SB包子 习皇的新装 哲欣 号尿壶公 骑巨龙 普近 爱新觉罗近平 电脑世代586 戏包皮 武统时代 没有网络安全就没有国家安全 庆丰废物 玉习大帝 川普的朋友or敌人 形式主义防疫 不同意的举手##没有##没有 武汉委托李克强 文明其精神 皇帝亲临忠诚的武汉 “无罩”现身 坡涛汹涌 共哀宗 nmslman（习主席） 野蛮其体魄 总统包子习 习奥赛斯库 习厉王 习时代 万岁来武汉了 刁二将 习侯 梦回大清 习驴 习特勒 学包率 倒车斯基 习付 次级乳包 袭包皮 毛二 枪毙名单 独裁者 人类命运共同体首席架构师 口罩外交 洗包皮 习言乱语 共哀宗 刁人13 习总 习大郎 维尼·屎(Winnie##the##Poo) 民进党 中国爱非洲 shit##hole##bing##fa 大兔 鞋哥 维尼大帝 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 中国特色射秽煮疫制度 修宪 皇帝亲临忠诚的武汉 学包积极分子 宰相 现任匪首 法习斯 仲夏夜之中国梦 东方project 习三拍 习远凸 修宪帝 官僚主义 习狍 习和谐 国王 送礼平 习总输记 这个年很静 䒒(tiáo)菦(qín)苹(píng) 智商不重要 百万雄师事件 西朝鲜人民自治岛 不敢高声语 吸精瓶 64岁 毛魔转世 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 细瓶颈 刁大犬 親自視頻 超邓赶毛 冰棒外交 习大林 叩谢习恩 大海掀翻小池塘 岿然不动 羽日帝 崇祯帝 习殡法 游泳一千米 彭主席（习主席走了太太接班） 乳制品 青年大学包 天安门合法继承人 包子金刚腿 红旗下的蛋 中字头组长 喷粪帝 十日文革 包包侠 毛二世 耀眼黄红黄 匪酋习维尼 劝进 扛麦郎 做N届的主席 近日成 崇祯 小学博士 习废帝 xdd 日子像蜜甜 食腐虫 习壳郎 庆丰称帝 禁评的理由 瘟疫领主习近平 习尔布特 习瘟猪 梦帝 尼哥 疫情蔓延 习包皮 墙内人 我是一个足球迷 包禁评 感恩教育 亲自指挥 习家军 刁斤山 习尿瓶 习老八 维尼警察（X） 书单吟诵者 中国拉清单工作领导小组组长 毛近平 “黄袍加身” 赵付 卡近菲 修宪连任 疯狂宇宙 战疫国 细颈瓶 “梦回大清” 武当七侠的政治斗争 任大炮 黑白翠 刁二婚 包皇 人民领袖 翡翠娘娘 神明论 习Core 隔离”的金葫芦 新影帝 大撒币 追思焦裕禄 学包分子 习核心 没规划的葬礼 主席贺词 shit侯 赵弹 截颈平 维尼带货 禁评大帝 灭共助推器 习是春绿 屎進瓶 习一尊 基拉大和习近平 习大帝 法外狂徒Lucy（德国） 倒车 人民领袖 习##卡##巴##卡 習大佬 親自蒞臨 裸宽包子劾心 糟糕皇帝 第22条军规 戏博士 黄俄 集近闭 中国离岸隐匿资产管理工作领导小组组组长 維尼頌 野兽主席 喜包皮 当代秦始皇 亲自脱贫 坟头蹦迪 The##Xi##Factor（习近平因素） 甴近平 十一郎习近平 灰习牛 北京中南海支部书记 阳台上的哨兵 梁家河贵族 甴种 秦城监狱 总加速师 习正日 A##Big##Deal 狙击手待命 野心习 习屎黄 集金币 习二胖 大锅瞻遗 人均接近八千万 习歪嘴 央视姓党 习兵法 习二二（二零二零年五月二十二日开二会） 20000T麦子 号屎洞 胡志平 动物森友会 包惠帝 白猪 十里山路不换肩 总书记来我家 习匪 最后领导人 孙笑川 包子病毒 2020全面小康 吃赵弹 刁槑夶尛 撒币宝 冠子兵法 公车上书 惜包皮 维尼连任 大大招牌 习奥塞斯库 阿平 赵人13 晚共昏君 亲自考察 一带一路 乳包文化 亲自指挥疫情 宽衣帝 习猪下台 腊肉馅儿包子 塔西佗陷阱 满脸喷粪 习大 断崖式下跌 独裁国贼 颐使气指 Cicada##3301##XD 习是春竹 野兽先辈 Mr##Shithole 屎禁评 阿道夫-习 习语 头上三尺有神明 帝皇頌 习近平光辉形象 毛孙 赛禁评 《生物安全法》 不知名氏 维尼写史 主席+终身制 相信有神论的物理学博士 */
package com.pcdd.sonovel.handle;

import com.pcdd.sonovel.model.AppConfig;
import lombok.experimental.UtilityClass;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@UtilityClass
public class PostHandlerFactory {

    public PostProcessingHandler getHandler(String extName, AppConfig config) {
        return switch (extName) {
            case "txt" -> new TxtMergeHandler(config);
            case "epub" -> new EpubMergeHandler();
            case "html" -> new HtmlTocHandler();
            case "pdf" -> new PdfMergeHandler(config);
            default -> throw new IllegalArgumentException("Unsupported format: " + extName);
        };
    }
}