/* 劝进 指定接班人 当代秦始皇 书单吟诵者 战疫国 岿然不动 386系统驱动游戏 刁大犬 西朝鲜人民自治岛 狙击手布阵 习梦撕 习匪 系包皮 当代秦二世 吸包皮 平&强 做N届的主席 庆丰称帝 羽日帝 每日祈翠 习二二（二零二零年五月二十二日开二会） Mr##Shithole 刁二将 万岁来武汉了 nmslman（习主席） 最后领导人 习教父 黄俄 习卒 中国爱非洲 读书单 总加速师 尼哥 乳包文化 人民战争 The##Xi##Factor（习近平因素） 刁人13 主席+终身制 帝皇頌 庆丰帝的千秋梦 世界最强乞丐 习博士 崇祯帝 屎進瓶 领袖习澡水 翡翠娘娘 头号球迷 冤大头 叩谢习恩 朝令夕改 国贼习近平 中国拉清单工作领导小组组长 刁近猴 习条英机 习思想 毛近平 戴口赵 现任匪首 疫情蔓延 号尿壶公 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 祈翠語言包 “登机”（与登基同音） 人民领袖 惜包皮 中国的新皇帝 民进党 習大佬 维尼熊 习梦死 哲欣 64岁 贬词包用 总书记来我家 撒币宝 “无罩”现身 背书单 “黄袍加身” 红旗下的蛋 扛麦郎 颐使气指 总书记来过我的家 习正日 总统包子习 习呆呆 巴拿马文件 错误执行者 纳翠党 亲自脱贫 刁远山 《生物安全法》 嘻包皮 中国特色射秽煮疫制度 刁近乎 裹嘎举吸钢闸门 习驴 瘟疫降生习近平 包子兵法 赵人13 时间控制 刁二婚 孤独的毒王 那翠化 阿道夫-习 野兽主席 糟糕皇帝 万岁来武汉 习梦思 共哀宗 包子金刚腿 日子像蜜甜 包包侠 独裁者 xdd 包子露宪 习二蛋 大海掀翻小池塘 胡志平 中国首席造梦大师 包皇 动物庄园 爱新觉罗·近平 习殡法 儿童习典 习特勒 洗尽贫 坡涛汹涌 习公奭 中字头组长 普习金 狙击手待命 喜包皮 A##Big##Deal 习老八 没规划的葬礼 天安门合法继承人 孙笑川 ChinaXi 习犬犬 北京中南海支部书记 大兔 习式病毒 末代皇帝 裸宽包子劾心 10号跳跳虎被维尼拉清单 习包子的Fa 亲自封号 夶 傻大头 习二世胡亥 蹄防 号屎洞 中国离岸隐匿资产管理工作领导小组组组长 连专家也为之叹服的电脑天才 习孢子 疯狂宇宙大帝 习习蛤蛤 阿平 倒车 平平 小学博士 包帝巡游 习太孑 刁斤二 大大招牌 大国造疫 你是反贼吗 电脑世代586 狙击手待命 皇帝亲临忠诚的武汉 习三点 习下台 共哀宗 骑巨龙 普近 毛二习 疯狂宇宙包 习背书 electron8964 富平学霸刁斤干 戏博士 尊蛤讨包 口罩大会 梁家河贵族 超邓赶毛 禁评封号 䒒(tiáo)菦(qín)苹(píng) 习厉王 刁斤山 食腐虫 官僚主义 习语录 崇祯 灰习牛 近日成 不强自息 小学居士 我是一个足球迷 大锅瞻遗 腊肉馅儿包子 习兵法 川普的朋友or敌人 毛二世 nmslese##dream 二百五大帝 头上三尺有神明 2020全面小康 维尼梗有害 十一郎习近平 感恩教育 亲自指挥疫情 Corona##Xi（习病毒） Cicada##3301##XD 央视姓党 习包子 习卒习 维尼带货 “登基” 习包子 禁评的理由 习尔布特 习核心 习猪席 习大 习王的田野上 人均接近八千万 通商宽衣 学包率 白猪 赵付 维尼史 相信有神论的物理学博士 习后主 法习斯 袁世凯第二 灭共助推器 追思焦裕禄 家业论 字共狗 人民领袖 习大林 核平全世界 粪坑兵法 赛禁评 集金币 習敗敗 vop 五毛主席 720事件 习屎黄 武统时代 公车上书 一带一路 祈翠 习时代 习索里尼 游泳一千米 习大郎 无限连任 习Core 维尼大帝 习猪头 XD 粪坑先生 习是春绿 习蛤 习进棺 塔西佗陷阱 老街 疯狂宇宙 刁人13 赵弹 当皇帝的小丑 红二代 专治各种不服 习皇的新装 昆明湖涨潮 终身领导人 学包分子 集近闭 彩色熊 黑白翠 役民五术 近身平A 习狍 形式主义防疫 习躲躲 细颈瓶 親自視頻 影子末帝 习像章 九评 重地之战 修宪连任 习emperor 清华毕业 世宗 习付 赵王 动物森友会 支那毒王 bingbang帝 习张三丰 SB包子 毛孙 皇帝梦 截颈平 迈克尔·索伊 捐麦子 坟头蹦迪 习包皮 习“甩锅” 刁后主 嬉包皮 shit禁评 吸精瓶 习猪下台 洗包皮 NMSL 大大品牌 颐指气使 200吨 包子病毒 习瘟猪 隔离”的金葫芦 讨习檄文 玉习大帝 维尼DISCO 一天游泳一千米 袭包皮 禁评大帝 格萨尔 发皇帝梦 文明其精神 人类命运共同体首席架构师 毛进平 “习泽东”和“洪宪”（袁世凯的帝号） 宰相 习大乞 维尼连任 习远凸 维尼警察（X） 鞋哥 习总 送礼平 习家军 国王 庆丰废物 断崖式下跌 野心习 半羽习近平 邪大大 习近砰 墨索里习 没有网络安全就没有国家安全 习二卒 习近平光辉形象 屎禁评 野兽先辈 退党 修宪 庆丰包·勃列日涅夫 野蛮其体魄 维持会长 武汉委托李克强 宽衣帝 维尼之声 包经 Heil##Xitler 恐惊天上人 习武帝 virus##king 冰棒外交 吃赵弹 倒车帝 梦帝 习废帝 北红尾鸲 shit侯 拉清单 20000T麦子 习流氓 读稿机 法外狂徒Lucy（德国） Voice##of##Pooh Chairman##Xi 习侯 甩锅侠 习是春竹 万岁 习包子 闹得欢 卡近菲 叼斤干 猪禁评 不敢高声语 新影帝 仲夏夜之中国梦 耀眼黄红黄 亲自指挥 韦来书记 外交习语 习三拍 集金pay 这个年很静 第一书记王沪宁 太祖兔 添宪宝宝 御板泽民 席近平 包禁评 匪酋习维尼 主席贺词 腊肉包 假.."~bang！卒 大撒幣 阳台上的哨兵 WHO的君王 叩谢习恩 刁槑夶尛 信女愿一生吃素 “皇帝梦” 维尼快乐组织（Winnie##Happy##Organization）简称WHO 孢 动物之森 习##卡##巴##卡 云视察 包惠帝 动森 近言 V尼哥 习和谐 悉包皮 战“疫”金句 亲自删评 维尼·屎(Winnie##the##Poo) 老歪脖子树 毛装 百万雄师事件 习夶 恩重如删 皇帝亲临忠诚的武汉 扛麦帝 习禁评 口罩外交 维尼写史 习皇帝 席子兵法 shit##hole##bing##fa 第22条军规 包包大人 厕所革命 两会期间+隐瞒 乳透社##小反旗 初二圣君 爱新觉罗近平 独彩者 细瓶颈 青年大学包 皇帝的新衣 习低能儿 坡涛汹涌 枪毙名单 大撒币 维尼挂彩 习言乱语 习尿瓶 習敗北 任大炮 十日文革 CoronaXi 親自蒞臨 倒车斯基 支那精神野爹 蔡英文最强助选 满脸喷粪 习歪嘴 习澳塞斯库 乳制品 瘟疫领主习近平 人尽皆知的体育迷 习大帝 亲自考察 冲塔 武当七侠的政治斗争 习匪帝 清单帝 通商宽衣 习奥赛斯库 九大诉求 毛魔转世 习总输记 习二胖 基拉大和习近平 任志强 次级乳包 神明论 足球外交 晚共昏君 习语 称帝修宪 东瘟疫之地统治者暨全境守护者 梁家河 Adolf##Xitler 习二坐船 shuu##kinn##pei XDD 包子宪法 彩色哥 恩维尔·霍习 维稳警察（O） 抗麦套装 赵家家仆 沼气专家 习达姆 花花公子 习贼 不同意的举手##没有##没有 习宽衣 平话 “梦回大清” 学包积极分子 小习微信 维尼熊给跳跳虎黄牌 视频看望 冠子兵法 氼兲嫑炛 大撒币 智商不重要 維尼頌 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 中国离岸隐匿资产管理工作领导小组组组长 屎侯 包大人 不知名氏 喷粪帝 秦城监狱 慨撒大帝 毛二 戏包皮 习病法 梦回大清 习得梁家书卷 习大犬 金科律玉 Criminal##Xi##"Xitler"##Jinping “复辟” 彭主席（习主席走了太太接班） 东方project 墙内人 4中组长 习king 习一尊 糖尿维尼 习奥塞斯库 */
package com.pcdd.sonovel.handle;

import com.pcdd.sonovel.model.SearchResult;
import lombok.experimental.UtilityClass;

import java.util.*;
import java.util.stream.Collectors;

/**
 * @author pcdd
 * Created at 2025/1/15
 */
@UtilityClass
public class SearchResultsHandler {

    /**
     * 优化源站的搜索结果
     */
    public List<SearchResult> handle(List<SearchResult> list) {
        // 按照作者分组
        Map<String, List<SearchResult>> authorGroups = list.stream()
                .collect(Collectors.groupingBy(SearchResult::getAuthor, LinkedHashMap::new, Collectors.toList()));

        // 对每个组进行排序
        return authorGroups.values().stream()
                // 根据每个作者对应的书籍数量进行降序排序
                .sorted((entry1, entry2) -> Integer.compare(entry2.size(), entry1.size()))
                // 每个作者的多个作品按书名排序，而只有一个作品的作者则不做排序
                .map(group -> group.size() > 1
                        ? group.stream().sorted(Comparator.comparing(SearchResult::getBookName)).toList()
                        : group)
                .flatMap(Collection::stream)
                .toList();
    }

}