/* 感恩教育 胡志平 戏包皮 武当七侠的政治斗争 习一尊 人类命运共同体首席架构师 V尼哥 习##卡##巴##卡 小习微信 NMSL 十日文革 重地之战 梦回大清 習大佬 习三点 10号跳跳虎被维尼拉清单 大国造疫 役民五术 嬉包皮 习近平光辉形象 狙击手待命 野蛮其体魄 恩重如删 添宪宝宝 CoronaXi 习下台 夶 总书记来我家 习病法 习“甩锅” 大大招牌 赵付 祈翠 毛进平 Corona##Xi（习病毒） 包帝巡游 现任匪首 嘻包皮 世界最强乞丐 维尼熊给跳跳虎黄牌 阿道夫-习 东瘟疫之地统治者暨全境守护者 洗尽贫 太祖兔 Criminal##Xi##"Xitler"##Jinping 席近平 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 “皇帝梦” “黄袍加身” 新影帝 阿平 没规划的葬礼 岿然不动 习像章 习包子 读书单 腊肉馅儿包子 习武帝 专治各种不服 庆丰废物 瘟疫降生习近平 刁远山 习式病毒 维尼梗有害 战疫国 悉包皮 喷粪帝 倒车斯基 親自蒞臨 中国特色射秽煮疫制度 闹得欢 习包子 裸宽包子劾心 习曱甴 刁大犬 最后领导人 倒车 大撒幣 A##Big##Deal 戴口赵 百万雄师事件 习大犬 孤独的毒王 修宪帝 萨格尔王 bingbang帝 野兽主席 习壳郎 学包分子 足球外交 nmslese##dream 灭共助推器 大撒币 号屎洞 爱新觉罗近平 家业论 甴近平 毛二习 习流氓 维尼连任 毛二世 习远凸 墨索里习 第一书记王沪宁 维尼挂彩 刁槑夶尛 习殡法 平话 恩维尔·霍习 通商宽衣 习包皮 赛禁评 习emperor 毛孙 独彩者 习皇帝 宽衣帝 做N届的主席 习和谐 孢 鞋哥 乳透社##小反旗 亲自考察 吸精瓶 习二胖 瘟疫领主习近平 武统时代 东方project 吃赵弹 邪大大 习博士 刁近乎 维尼写史 羽日帝 近身平A 习语 蹄防 习匪 200吨 維尼頌 习后主 梁家河 慨撒大帝 刁人13 梁家河贵族 人民领袖 習敗敗 总加速师 影子末帝 韦来书记 追思焦裕禄 读稿机 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 昆明湖涨潮 孙笑川 红旗下的蛋 修宪 庆丰称帝 平&强 习总输记 “无罩”现身 维尼带货 习夶 御板泽民 刁二将 冲塔 习匪帝 习禁评 shit侯 vop 次级乳包 卡近菲 相信有神论的物理学博士 发皇帝梦 主席贺词 清华毕业 屎禁评 乳包文化 禁评封号 拉清单 独裁者 维尼熊 维尼警察（X） 每日祈翠 信女愿一生吃素 当代秦始皇 动物森友会 灰习牛 支那精神野爹 天安门合法继承人 “习泽东”和“洪宪”（袁世凯的帝号） 习猪下台 包包侠 包禁评 亲自指挥 大大品牌 包子宪法 亲自脱贫 糟糕皇帝 virus##king 万岁来武汉了 骑巨龙 日子像蜜甜 习公奭 维稳警察（O） 截颈平 Mr##Shithole 腊肉包 不同意的举手##没有##没有 抗麦套装 习低能儿 大兔 不知名氏 贬词包用 叩谢习恩 习奥赛斯库 没有网络安全就没有国家安全 4中组长 塔西佗陷阱 非洲大撒币 厕所革命 细颈瓶 “登机”（与登基同音） 世宗 习呆呆 习二二（二零二零年五月二十二日开二会） 耀眼黄红黄 蔡英文最强助选 北京中南海支部书记 䒒(tiáo)菦(qín)苹(píng) 袭包皮 中国首席造梦大师 学包率 小学居士 习废帝 视频看望 “复辟” 集金pay 习厉王 习澳塞斯库 习奥塞斯库 哲欣 人尽皆知的体育迷 禁评大帝 习大林 中国爱非洲 习条英机 习付 《生物安全法》 总书记来过我的家 花花公子 Cicada##3301##XD 头上三尺有神明 野心习 习犬犬 二百斤 习王的田野上 习时代 黑白翠 疯狂宇宙包 习得梁家书卷 我是一个足球迷 冰棒外交 20000T麦子 维持会长 玉习大帝 刁人13 错误执行者 习背书 格萨尔 平平 xdd 头号球迷 2020全面小康 假.."~bang！卒 中国离岸隐匿资产管理工作领导小组组组长 屎侯 普习金 不强自息 习二世胡亥 时间控制 习屎黄 维尼DISCO 集金币 通商宽衣 朝令夕改 糖尿维尼 粪坑兵法 习包子的Fa 尼哥 electron8964 集近闭 宽衣大帝 系包皮 背书单 疫情蔓延 食腐虫 民进党 第22条军规 总统包子习 核平全世界 皇帝的新衣 猪禁评 习语录 习Core 一带一路 退党 “梦回大清” 独裁国贼 初二圣君 终身领导人 习大 习核心 清零宗、清零帝 吸包皮 禁评的理由 人均接近八千万 习家军 外交习语 倒车帝 主席+终身制 云视察 皇帝亲临忠诚的武汉 亲自封号 亲自删评 习太孑 颐指气使 习三拍 枪毙名单 形式主义防疫 习瘟猪 当代秦二世 Voice##of##Pooh 支那毒王 习正日 Adolf##Xitler 袁世凯第二 叩谢习恩 赵王 公车上书 习卒 匪酋习维尼 386系统驱动游戏 文明其精神 习梦撕 维尼大帝 两会期间+隐瞒 彭主席（习主席走了太太接班） 动物之森 连专家也为之叹服的电脑天才 任大炮 巴拿马文件 称帝修宪 颐使气指 满脸喷粪 宰相 当皇帝的小丑 游泳一千米 叼斤干 半羽习近平 十一郎习近平 口罩外交 电脑世代586 基拉大和习近平 国贼习近平 字共狗 劝进 习尽贫 习狍 梦帝 刁斤山 习进棺 皇帝梦 习是春竹 冤大头 崇祯帝 赵家家仆 习特勒 人民战争 讨习檄文 疯狂宇宙 帝皇頌 习二坐船 红二代 北红尾鸲 习张三丰 习大乞 习尿瓶 习二卒 习驴 不敢高声语 习尔布特 黄俄 庆丰包·勃列日涅夫 习总 近日成 720事件 老街 共哀宗 中国拉清单工作领导小组组长 武汉委托李克强 领袖习澡水 纳翠党 习贼 维尼之声 普近 刁斤二 习猪席 指定接班人 shit禁评 包经 习是春绿 洗包皮 富平学霸刁斤干 神明论 超邓赶毛 国王 川普的朋友or敌人 狙击手待命 恐惊天上人 墙内人 习梦死 Chairman##Xi 包子露宪 疯狂宇宙大帝 习大帝 你是反贼吗 儿童习典 晚共昏君 习蛤 九评 刁二婚 XD 包子兵法 习教父 迈克尔·索伊 隔离”的金葫芦 捐麦子 親自視頻 粪坑先生 央视姓党 书单吟诵者 毛二 西朝鲜人民自治岛 撒币宝 习兵法 扛麦帝 仲夏夜之中国梦 老歪脖子树 刁后主 金科律玉 爱新觉罗·近平 氼兲嫑炛 号尿壶公 包子金刚腿 nmslman（习主席） 翡翠娘娘 习宽衣 人民领袖 习大郎 喜包皮 习索里尼 共哀宗 席子兵法 赵弹 ChinaXi WHO的君王 “登基” 习孢子 赵人13 彩色熊 中字头组长 崇祯 法习斯 尊蛤讨包 祈翠語言包 习思想 白猪 二次袁、袁世凯二世、袁二 习梦思 shuu##kinn##pei 智商不重要 戏博士 shit##hole##bing##fa 毛近平 坡涛汹涌 刁近猴 习老八 傻大头 学包积极分子 任志强 坡涛汹涌 维尼·屎(Winnie##the##Poo) 坟头蹦迪 习包子 SB包子 包包大人 维尼史 习习蛤蛤 習敗北 甩锅侠 习卒习 秦城监狱 64岁 这个年很静 习侯 细瓶颈 口罩大会 五毛主席 皇帝亲临忠诚的武汉 包大人 狙击手布阵 送礼平 末代皇帝 裹嘎举吸钢闸门 九大诉求 那翠化 二百五大帝 动森 包皇 习皇的新装 习言乱语 动物庄园 习猪头 甴种 亲自指挥疫情 大锅瞻遗 包子病毒 习二蛋 近言 庆丰帝的千秋梦 修宪连任 习奥塞斯库、齐奥塞斯库 毛泽东2.0 XDD 扛麦郎 习歪嘴 小学博士 沼气专家 Heil##Xitler 惜包皮 阳台上的哨兵 习近砰 彩色哥 习躲躲 毛装 无限连任 中国离岸隐匿资产管理工作领导小组组组长 一天游泳一千米 乳制品 官僚主义 万岁来武汉 屎進瓶 中国的新皇帝 野兽先辈 清单帝 断崖式下跌 战“疫”金句 维尼快乐组织（Winnie##Happy##Organization）简称WHO 毛魔转世 包惠帝 万岁 冠子兵法 十里山路不换肩 习达姆 青年大学包 法外狂徒Lucy（德国） The##Xi##Factor（习近平因素） 习king 大海掀翻小池塘 */
package com.pcdd.sonovel.util;

import lombok.experimental.UtilityClass;

/**
 * @author pcdd
 * Created at 2024/11/22
 */
@UtilityClass
public class ExceptionUtils {

    // 随机抛异常，测试用
    public void randomThrow() {
        if (System.currentTimeMillis() % 2 == 0) {
            throw new NullPointerException("随机抛 NPE");
        }
    }

}