/* 捐麦子 毛二习 灭共助推器 不敢高声语 疯狂宇宙 习得梁家书卷 颐指气使 人类命运共同体首席架构师 梁家河 习公奭 倒车 动森 视频看望 爱新觉罗近平 截颈平 共哀宗 邪大大 “复辟” 任大炮 “登机”（与登基同音） 习二世胡亥 SB包子 足球外交 习达姆 virus##king 习三拍 袭包皮 习像章 习病法 傻大头 御板泽民 戏博士 战“疫”金句 半羽习近平 梁家河贵族 叩谢习恩 习梦思 大大品牌 大撒币 蔡英文最强助选 维尼DISCO 头号球迷 习包子 习卒习 主席+终身制 十一郎习近平 通商宽衣 错误执行者 维尼熊给跳跳虎黄牌 习蛤 ChinaXi 十日文革 习流氓 包子宪法 习emperor 习殡法 阿道夫-习 习博士 人民领袖 親自視頻 习是春竹 习屎黄 扛麦郎 刁斤山 习二卒 匪酋习维尼 糟糕皇帝 习澳塞斯库 支那精神野爹 嘻包皮 䒒(tiáo)菦(qín)苹(píng) 书单吟诵者 习总输记 夶 总加速师 领袖习澡水 巴拿马文件 万岁来武汉了 包包侠 裹嘎举吸钢闸门 习三点 刁槑夶尛 背书单 当皇帝的小丑 超邓赶毛 云视察 近言 小学博士 口罩外交 习大犬 信女愿一生吃素 尊蛤讨包 撒币宝 大锅瞻遗 通商宽衣 习宽衣 纳翠党 崇祯 中国拉清单工作领导小组组长 次级乳包 相信有神论的物理学博士 习狍 中字头组长 袁世凯第二 你是反贼吗 野兽先辈 习孢子 洗包皮 人民战争 胡志平 总书记来我家 习进棺 役民五术 疯狂宇宙包 秦城监狱 维尼史 朝令夕改 习梦死 两会期间+隐瞒 bingbang帝 亲自删评 孢 没有网络安全就没有国家安全 维尼挂彩 嬉包皮 习包子 毛装 习语录 习二蛋 祈翠語言包 包帝巡游 指定接班人 禁评大帝 刁大犬 习躲躲 平平 时间控制 北红尾鸲 没规划的葬礼 墨索里习 XD 刁二婚 包经 冤大头 维尼警察（X） 当代秦二世 大国造疫 shit##hole##bing##fa 家业论 大撒幣 墙内人 字共狗 乳透社##小反旗 习##卡##巴##卡 习Core 普近 彭主席（习主席走了太太接班） 习张三丰 习二二（二零二零年五月二十二日开二会） 核平全世界 刁远山 毛孙 发皇帝梦 连专家也为之叹服的电脑天才 东瘟疫之地统治者暨全境守护者 梦帝 灰习牛 学包分子 习时代 庆丰帝的千秋梦 中国的新皇帝 维稳警察（O） 包禁评 近身平A 爱新觉罗·近平 官僚主义 倒车帝 喷粪帝 386系统驱动游戏 习兵法 shit侯 一天游泳一千米 独彩者 习背书 万岁 包子金刚腿 疯狂宇宙大帝 屎侯 V尼哥 NMSL 大大招牌 2020全面小康 羽日帝 nmslese##dream 习犬犬 习废帝 中国离岸隐匿资产管理工作领导小组组组长 习奥赛斯库 习包子的Fa 红二代 习歪嘴 满脸喷粪 习贼 刁后主 大撒币 Criminal##Xi##"Xitler"##Jinping 断崖式下跌 甩锅侠 包皇 修宪 糖尿维尼 颐使气指 习禁评 翡翠娘娘 禁评的理由 习大林 维尼写史 瘟疫领主习近平 国贼习近平 小学居士 习是春绿 平&强 当代秦始皇 “皇帝梦” 北京中南海支部书记 习尿瓶 国王 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 200吨 初二圣君 孤独的毒王 习思想 小习微信 The##Xi##Factor（习近平因素） 清华毕业 主席贺词 世宗 维尼梗有害 习远凸 习武帝 皇帝的新衣 粪坑先生 蹄防 号屎洞 庆丰称帝 游泳一千米 Heil##Xitler 宽衣帝 富平学霸刁斤干 习和谐 彩色熊 新影帝 白猪 毛近平 吸精瓶 維尼頌 人均接近八千万 维尼之声 食腐虫 支那毒王 “黄袍加身” 大兔 东方project 武统时代 一带一路 4中组长 二百五大帝 贬词包用 屎進瓶 包子露宪 “无罩”现身 習敗北 习低能儿 习下台 动物之森 赵弹 人民领袖 近日成 喜包皮 不知名氏 民进党 包子兵法 习“甩锅” 崇祯帝 动物森友会 维尼熊 乳包文化 习奥塞斯库 维尼·屎(Winnie##the##Poo) Cicada##3301##XD 法习斯 祈翠 世界最强乞丐 习家军 习卒 亲自指挥疫情 乳制品 送礼平 习瘟猪 包大人 习厉王 迈克尔·索伊 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 中国首席造梦大师 尼哥 动物庄园 野蛮其体魄 青年大学包 习皇帝 每日祈翠 毛二世 中国离岸隐匿资产管理工作领导小组组组长 习二坐船 阿平 习老八 系包皮 冲塔 裸宽包子劾心 叩谢习恩 细颈瓶 追思焦裕禄 亲自封号 韦来书记 vop 包惠帝 习核心 感恩教育 我是一个足球迷 武汉委托李克强 毛进平 九评 粪坑兵法 electron8964 习驴 帝皇頌 五毛主席 假.."~bang！卒 习一尊 习条英机 戏包皮 平话 Chairman##Xi 格萨尔 第一书记王沪宁 耀眼黄红黄 普习金 狙击手待命 重地之战 塔西佗陷阱 习总 氼兲嫑炛 Mr##Shithole 习教父 维尼大帝 花花公子 刁二将 习习蛤蛤 天安门合法继承人 习梦撕 习言乱语 梦回大清 包子病毒 习大 修宪连任 阳台上的哨兵 读稿机 影子末帝 习王的田野上 那翠化 xdd 皇帝亲临忠诚的武汉 狙击手布阵 野心习 骑巨龙 叼斤干 习匪 猪禁评 习后主 习猪头 仲夏夜之中国梦 习近砰 悉包皮 讨习檄文 最后领导人 文明其精神 任志强 无限连任 维尼连任 习式病毒 “登基” 维持会长 维尼带货 专治各种不服 劝进 神明论 西朝鲜人民自治岛 庆丰包·勃列日涅夫 独裁者 恩重如删 中国特色射秽煮疫制度 腊肉包 抗麦套装 64岁 外交习语 黑白翠 黄俄 赵家家仆 口罩大会 扛麦帝 终身领导人 720事件 习尔布特 集金pay 学包积极分子 沼气专家 智商不重要 “习泽东”和“洪宪”（袁世凯的帝号） 做N届的主席 称帝修宪 習大佬 吃赵弹 赵王 宰相 玉习大帝 退党 毛二 坟头蹦迪 习二胖 10号跳跳虎被维尼拉清单 闹得欢 大海掀翻小池塘 公车上书 清单帝 腊肉馅儿包子 疫情蔓延 战疫国 惜包皮 刁人13 习付 刁斤二 刁近乎 坡涛汹涌 Corona##Xi（习病毒） 刁人13 席子兵法 共哀宗 习特勒 隔离”的金葫芦 孙笑川 拉清单 习包皮 习近平光辉形象 “梦回大清” 金科律玉 习太孑 狙击手待命 中国爱非洲 法外狂徒Lucy（德国） 毛魔转世 WHO的君王 添宪宝宝 日子像蜜甜 习匪帝 习大乞 20000T麦子 习侯 nmslman（习主席） 集近闭 电脑世代586 太祖兔 不同意的举手##没有##没有 倒车斯基 皇帝亲临忠诚的武汉 皇帝梦 这个年很静 Voice##of##Pooh 恐惊天上人 坡涛汹涌 厕所革命 基拉大和习近平 亲自指挥 习夶 彩色哥 武当七侠的政治斗争 親自蒞臨 百万雄师事件 野兽主席 戴口赵 包包大人 末代皇帝 shit禁评 细瓶颈 刁近猴 习king A##Big##Deal 赛禁评 总统包子习 习猪下台 头上三尺有神明 儿童习典 shuu##kinn##pei 第22条军规 哲欣 恩维尔·霍习 学包率 习语 习包子 鞋哥 屎禁评 瘟疫降生习近平 号尿壶公 XDD 亲自脱贫 习大郎 不强自息 习索里尼 禁评封号 卡近菲 吸包皮 習敗敗 席近平 岿然不动 冰棒外交 维尼快乐组织（Winnie##Happy##Organization）简称WHO 九大诉求 CoronaXi 庆丰废物 习呆呆 央视姓党 晚共昏君 赵人13 习猪席 洗尽贫 昆明湖涨潮 习正日 总书记来过我的家 赵付 亲自考察 集金币 枪毙名单 慨撒大帝 《生物安全法》 形式主义防疫 读书单 冠子兵法 Adolf##Xitler 老歪脖子树 川普的朋友or敌人 人尽皆知的体育迷 红旗下的蛋 老街 习大帝 万岁来武汉 习皇的新装 现任匪首 */
package com.pcdd.sonovel.util;

import lombok.experimental.UtilityClass;

/**
 * @author pcdd
 * Created at 2024/11/22
 */
@UtilityClass
public class ExceptionUtils {

    // 随机抛异常，测试用
    public void randomThrow() {
        if (System.currentTimeMillis() % 2 == 0) {
            throw new NullPointerException("随机抛 NPE");
        }
    }

}