/* 爱新觉罗·近平 习尿瓶 习皇帝 习张三丰 次级乳包 动物森友会 20000T麦子 亲自封号 民进党 巴拿马文件 第22条军规 习禁评 中国首席造梦大师 “无罩”现身 皇帝亲临忠诚的武汉 领袖习澡水 邪大大 系包皮 孢 食腐虫 学包分子 十日文革 毛二习 腊肉馅儿包子 集近闭 习大帝 儿童习典 爱新觉罗近平 坡涛汹涌 法外狂徒Lucy（德国） 糟糕皇帝 习大林 糖尿维尼 恩维尔·霍习 习语 维尼写史 塔西佗陷阱 乳包文化 喷粪帝 冲塔 习是春竹 云视察 习呆呆 Corona##Xi（习病毒） 毛二世 维尼熊给跳跳虎黄牌 習大佬 号尿壶公 人均接近八千万 “黄袍加身” 习流氓 影子末帝 习三拍 习时代 称帝修宪 赵付 撒币宝 中国离岸隐匿资产管理工作领导小组组组长 nmslman（习主席） 腊肉包 叼斤干 武统时代 64岁 维尼·屎(Winnie##the##Poo) 当皇帝的小丑 倒车斯基 习太孑 习尔布特 习近砰 习猪下台 叩谢习恩 习核心 习病法 习远凸 习习蛤蛤 超邓赶毛 禁评大帝 猪禁评 习猪头 金科律玉 nmslese##dream 狙击手布阵 阿平 文明其精神 氼兲嫑炛 习低能儿 刁近乎 羽日帝 灰习牛 shit侯 通商宽衣 沼气专家 当代秦始皇 昆明湖涨潮 shuu##kinn##pei 国贼习近平 习驴 人类命运共同体首席架构师 截颈平 战疫国 总书记来过我的家 没有网络安全就没有国家安全 初二圣君 bingbang帝 习emperor 五毛主席 亲自脱贫 宰相 送礼平 习瘟猪 习侯 “登基” 裹嘎举吸钢闸门 贬词包用 任大炮 习贼 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 习像章 彭主席（习主席走了太太接班） 2020全面小康 平话 帝皇頌 总书记来我家 习是春绿 主席+终身制 包包大人 太祖兔 习语录 “梦回大清” 毛孙 错误执行者 维尼梗有害 不知名氏 吸包皮 国王 耀眼黄红黄 粪坑兵法 西朝鲜人民自治岛 小学居士 中国特色射秽煮疫制度 末代皇帝 形式主义防疫 习思想 刁斤山 冰棒外交 小习微信 习蛤 青年大学包 吃赵弹 宽衣帝 韦来书记 退党 坟头蹦迪 习废帝 习二卒 任志强 ChinaXi 川普的朋友or敌人 悉包皮 没规划的葬礼 尼哥 包皇 禁评封号 不同意的举手##没有##没有 央视姓党 大兔 神明论 两会期间+隐瞒 习总 习包子 习达姆 习梦撕 维尼警察（X） 阿道夫-习 习宽衣 习包子的Fa 口罩外交 vop 主席贺词 习匪帝 疯狂宇宙大帝 毛进平 习老八 习澳塞斯库 日子像蜜甜 无限连任 翡翠娘娘 迈克尔·索伊 冠子兵法 刁槑夶尛 Heil##Xitler 习特勒 屎禁评 习包子 最后领导人 倒车帝 讨习檄文 刁近猴 刁二婚 习##卡##巴##卡 习二胖 親自視頻 独彩者 习梦思 中国拉清单工作领导小组组长 人尽皆知的体育迷 大锅瞻遗 颐使气指 添宪宝宝 Voice##of##Pooh 万岁 毛近平 亲自指挥 包惠帝 习二世胡亥 拉清单 岿然不动 习二蛋 10号跳跳虎被维尼拉清单 包包侠 戏博士 游泳一千米 Criminal##Xi##"Xitler"##Jinping 维尼连任 万岁来武汉 习式病毒 时间控制 慨撒大帝 禁评的理由 席近平 习和谐 刁二将 毛二 “登机”（与登基同音） 习博士 北红尾鸲 习大郎 扛麦帝 吸精瓶 席子兵法 习奥塞斯库 大撒币 习孢子 不敢高声语 朝令夕改 人民战争 黑白翠 卡近菲 外交习语 近日成 庆丰称帝 信女愿一生吃素 刁斤二 做N届的主席 包帝巡游 习下台 共哀宗 东方project 亲自指挥疫情 包子宪法 梁家河贵族 维尼史 每日祈翠 书单吟诵者 灭共助推器 隔离”的金葫芦 背书单 通商宽衣 墨索里习 V尼哥 shit##hole##bing##fa 屎進瓶 大大招牌 习皇的新装 恐惊天上人 狙击手待命 东瘟疫之地统治者暨全境守护者 武汉委托李克强 Cicada##3301##XD 人民领袖 崇祯帝 习正日 白猪 WHO的君王 袭包皮 包子露宪 学包积极分子 电脑世代586 包大人 NMSL 万岁来武汉了 维尼快乐组织（Winnie##Happy##Organization）简称WHO 屎侯 集金pay 习匪 刁后主 专治各种不服 感恩教育 御板泽民 红二代 清华毕业 富平学霸刁斤干 XD 追思焦裕禄 习三点 近身平A 习背书 庆丰帝的千秋梦 终身领导人 親自蒞臨 梦回大清 习犬犬 不强自息 重地之战 智商不重要 大国造疫 读稿机 习梦死 断崖式下跌 蔡英文最强助选 那翠化 维尼DISCO 纳翠党 崇祯 electron8964 平平 彩色熊 Chairman##Xi 指定接班人 普近 劝进 清单帝 枪毙名单 720事件 粪坑先生 习总输记 维稳警察（O） 假.."~bang！卒 习“甩锅” 戴口赵 野心习 习屎黄 维尼挂彩 祈翠 修宪连任 习条英机 习公奭 毛装 习Core 习大 亲自考察 庆丰废物 连专家也为之叹服的电脑天才 扛麦郎 习付 习家军 普习金 总加速师 维尼熊 “复辟” 傻大头 尊蛤讨包 墙内人 二百五大帝 习奥赛斯库 捐麦子 集金币 “皇帝梦” 坡涛汹涌 中国爱非洲 厕所革命 当代秦二世 头号球迷 闹得欢 祈翠語言包 习狍 口罩大会 刁远山 半羽习近平 习厉王 《生物安全法》 XDD 中国的新皇帝 细瓶颈 阳台上的哨兵 惜包皮 瘟疫领主习近平 学包率 赛禁评 现任匪首 習敗敗 号屎洞 视频看望 支那毒王 共哀宗 The##Xi##Factor（习近平因素） 习躲躲 骑巨龙 习近平光辉形象 乳透社##小反旗 野兽先辈 世界最强乞丐 抗麦套装 家业论 瘟疫降生习近平 嘻包皮 习索里尼 九评 满脸喷粪 疫情蔓延 习武帝 习言乱语 赵家家仆 疯狂宇宙包 孙笑川 动物之森 孤独的毒王 九大诉求 支那精神野爹 字共狗 冤大头 恩重如删 赵人13 官僚主义 第一书记王沪宁 习兵法 袁世凯第二 我是一个足球迷 十一郎习近平 CoronaXi 洗尽贫 平&强 习king 哲欣 世宗 人民领袖 习二二（二零二零年五月二十二日开二会） 黄俄 SB包子 习大乞 野兽主席 皇帝梦 习歪嘴 維尼頌 北京中南海支部书记 倒车 皇帝的新衣 格萨尔 玉习大帝 大大品牌 shit禁评 鞋哥 公车上书 大撒幣 习二坐船 Adolf##Xitler 这个年很静 䒒(tiáo)菦(qín)苹(píng) 秦城监狱 习夶 习一尊 中字头组长 大海掀翻小池塘 刁人13 武当七侠的政治斗争 梦帝 亲自删评 狙击手待命 细颈瓶 一天游泳一千米 修宪 你是反贼吗 维尼带货 老歪脖子树 习教父 裸宽包子劾心 甩锅侠 庆丰包·勃列日涅夫 天安门合法继承人 夶 virus##king 战“疫”金句 役民五术 野蛮其体魄 嬉包皮 386系统驱动游戏 颐指气使 中国离岸隐匿资产管理工作领导小组组组长 包经 仲夏夜之中国梦 4中组长 xdd “习泽东”和“洪宪”（袁世凯的帝号） 习王的田野上 头上三尺有神明 A##Big##Deal 百万雄师事件 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 独裁者 匪酋习维尼 皇帝亲临忠诚的武汉 一带一路 赵弹 维尼大帝 总统包子习 200吨 老街 大撒币 法习斯 习殡法 喜包皮 读书单 毛魔转世 习后主 蹄防 刁人13 包子病毒 习进棺 洗包皮 维持会长 习得梁家书卷 乳制品 新影帝 红旗下的蛋 相信有神论的物理学博士 发皇帝梦 习卒 动物庄园 胡志平 习猪席 小学博士 足球外交 叩谢习恩 彩色哥 梁家河 近言 包子金刚腿 习包皮 戏包皮 疯狂宇宙 习包子 Mr##Shithole 花花公子 动森 晚共昏君 基拉大和习近平 赵王 习卒习 習敗北 刁大犬 习大犬 维尼之声 包禁评 包子兵法 核平全世界 */
package com.pcdd.sonovel.util;

import cn.hutool.core.util.StrUtil;
import lombok.SneakyThrows;
import lombok.experimental.UtilityClass;

import java.io.File;
import java.net.HttpURLConnection;
import java.net.URL;
import java.util.Arrays;
import java.util.List;
import java.util.Objects;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@UtilityClass
public class FileUtils {

    // 文件排序，按文件名升序
    public List<File> sortFilesByName(File dir) {
        return Arrays.stream(Objects.requireNonNull(dir.listFiles()))
                .sorted((o1, o2) -> {
                    int no1 = Integer.parseInt(StrUtil.subBefore(o1.getName(), "_", false));
                    int no2 = Integer.parseInt(StrUtil.subBefore(o2.getName(), "_", false));
                    return no1 - no2;
                }).toList();
    }

    /**
     * 获取远程文件大小，HEAD 请求不会下载文件内容，只会返回文件的元数据（例如文件大小）
     *
     * @return 字节
     */
    @SneakyThrows
    public long fileSize(String fileUrl) {
        URL url = new URL(fileUrl);
        HttpURLConnection conn = (HttpURLConnection) url.openConnection();
        // 使用 HEAD 请求方法，只获取头部信息
        conn.setRequestMethod("HEAD");
        conn.setConnectTimeout(10_000);
        conn.setReadTimeout(10_000);
        int contentLength = conn.getContentLength();
        conn.disconnect();

        return contentLength == -1 ? 0 : contentLength;
    }

}