/* 习厉王 维尼熊 习总 世宗 赵家家仆 shit侯 The##Xi##Factor（习近平因素） 慨撒大帝 習大佬 夶 习条英机 习尽贫 习背书 富平学霸刁斤干 甴近平 五毛主席 习呆呆 中国爱非洲 朝令夕改 足球外交 战“疫”金句 格萨尔 指定接班人 阿道夫-习 习猪席 独彩者 食腐虫 法习斯 百万雄师事件 白猪 习兵法 shit禁评 假.."~bang！卒 无限连任 世界最强乞丐 亲自指挥疫情 主席贺词 青年大学包 习包子 西朝鲜人民自治岛 习奥塞斯库、齐奥塞斯库 蹄防 习尔布特 云视察 习核心 清零宗、清零帝 刁人13 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ electron8964 倒车斯基 包皇 家业论 V尼哥 屎禁评 习大犬 nmslese##dream 习壳郎 役民五术 Criminal##Xi##"Xitler"##Jinping 塔西佗陷阱 梁家河 隔离”的金葫芦 维尼挂彩 武当七侠的政治斗争 儿童习典 “黄袍加身” 字共狗 禁评封号 亲自指挥 号屎洞 刁近乎 习孢子 黄俄 做N届的主席 翡翠娘娘 野蛮其体魄 甴种 初二圣君 疯狂宇宙 习猪头 邪大大 刁斤山 戴口赵 御板泽民 老歪脖子树 恩重如删 包子病毒 维尼DISCO 習敗北 A##Big##Deal 习大林 包帝巡游 坟头蹦迪 中国首席造梦大师 中字头组长 皇帝梦 习Core 腊肉馅儿包子 XDD 国王 九评 满脸喷粪 维尼连任 乳透社##小反旗 清华毕业 劝进 外交习语 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 送礼平 战疫国 墙内人 刁二将 近日成 玉习大帝 赵人13 文明其精神 袭包皮 读稿机 截颈平 “无罩”现身 人类命运共同体首席架构师 独裁者 习禁评 戏包皮 习king 半羽习近平 洗包皮 近身平A 智商不重要 习包皮 细瓶颈 十日文革 任志强 习是春竹 屎侯 末代皇帝 叩谢习恩 红二代 维尼大帝 习低能儿 尊蛤讨包 习言乱语 维持会长 头上三尺有神明 刁槑夶尛 仲夏夜之中国梦 习emperor 蔡英文最强助选 冠子兵法 习近砰 清单帝 习病法 维尼·屎(Winnie##the##Poo) 习索里尼 颐指气使 梦帝 国贼习近平 喜包皮 彩色哥 形式主义防疫 刁大犬 基拉大和习近平 恩维尔·霍习 背书单 动物之森 习二二（二零二零年五月二十二日开二会） 维尼带货 孢 习##卡##巴##卡 时间控制 习博士 维尼快乐组织（Winnie##Happy##Organization）简称WHO 习总输记 喷粪帝 彭主席（习主席走了太太接班） 习梦思 CoronaXi 亲自考察 动物森友会 宰相 影子末帝 叩谢习恩 包经 习像章 官僚主义 宽衣大帝 追思焦裕禄 中国特色射秽煮疫制度 毛魔转世 维尼写史 梁家河贵族 维稳警察（O） “梦回大清” 维尼熊给跳跳虎黄牌 裸宽包子劾心 洗尽贫 习卒习 骑巨龙 坡涛汹涌 万岁来武汉 毛二 北红尾鸲 习皇的新装 祈翠語言包 Adolf##Xitler 你是反贼吗 金科律玉 大锅瞻遗 最后领导人 哲欣 专治各种不服 习屎黄 野心习 乳包文化 韦来书记 氼兲嫑炛 禁评的理由 毛进平 习思想 亲自脱贫 赵王 刁斤二 宽衣帝 屎進瓶 吸精瓶 习正日 相信有神论的物理学博士 小学居士 习二胖 习老八 习王的田野上 习得梁家书卷 当代秦始皇 习二蛋 我是一个足球迷 新影帝 20000T麦子 公车上书 刁人13 习梦撕 乳制品 二百斤 “登机”（与登基同音） 大海掀翻小池塘 习卒 shit##hole##bing##fa 孙笑川 吃赵弹 腊肉包 大撒幣 不敢高声语 央视姓党 不强自息 Voice##of##Pooh 大兔 习太孑 习二卒 迈克尔·索伊 耀眼黄红黄 帝皇頌 維尼頌 共哀宗 ChinaXi 毛二习 刁后主 恐惊天上人 裹嘎举吸钢闸门 386系统驱动游戏 习瘟猪 称帝修宪 习和谐 人民战争 武统时代 疯狂宇宙大帝 二次袁、袁世凯二世、袁二 学包率 包惠帝 野兽先辈 第22条军规 习歪嘴 北京中南海支部书记 习奥赛斯库 庆丰帝的千秋梦 包包大人 沼气专家 纳翠党 Corona##Xi（习病毒） 细颈瓶 灭共助推器 修宪帝 野兽主席 卡近菲 支那毒王 习曱甴 修宪连任 领袖习澡水 普近 xdd 集金pay 64岁 Cicada##3301##XD 习贼 习奥塞斯库 倒车帝 秦城监狱 皇帝的新衣 人均接近八千万 习近平光辉形象 720事件 不同意的举手##没有##没有 每日祈翠 总加速师 中国离岸隐匿资产管理工作领导小组组组长 口罩大会 讨习檄文 悉包皮 习侯 人民领袖 席近平 二百五大帝 大国造疫 终身领导人 孤独的毒王 席子兵法 墨索里习 习公奭 甩锅侠 皇帝亲临忠诚的武汉 䒒(tiáo)菦(qín)苹(píng) 日子像蜜甜 爱新觉罗·近平 武汉委托李克强 岿然不动 大大招牌 庆丰包·勃列日涅夫 扛麦帝 维尼警察（X） 瘟疫降生习近平 “皇帝梦” 东方project 赵付 中国的新皇帝 感恩教育 习三点 习家军 没规划的葬礼 庆丰称帝 习特勒 发皇帝梦 信女愿一生吃素 巴拿马文件 平话 一带一路 200吨 厕所革命 一天游泳一千米 親自蒞臨 红旗下的蛋 法外狂徒Lucy（德国） “复辟” 习梦死 包子兵法 太祖兔 共哀宗 书单吟诵者 拉清单 独裁国贼 习夶 习大乞 当代秦二世 习狍 崇祯 维尼史 狙击手待命 《生物安全法》 赛禁评 2020全面小康 添宪宝宝 中国离岸隐匿资产管理工作领导小组组组长 中国拉清单工作领导小组组长 彩色熊 民进党 次级乳包 习二世胡亥 平&强 习废帝 糟糕皇帝 Chairman##Xi 修宪 习猪下台 10号跳跳虎被维尼拉清单 嬉包皮 瘟疫领主习近平 黑白翠 包子宪法 总书记来过我的家 “登基” 4中组长 冤大头 撒币宝 戏博士 习驴 包大人 羽日帝 胡志平 维尼梗有害 习大 粪坑先生 SB包子 号尿壶公 头号球迷 川普的朋友or敌人 倒车 习二坐船 习式病毒 老街 習敗敗 现任匪首 习语 亲自封号 人尽皆知的体育迷 习匪 通商宽衣 鞋哥 Heil##Xitler 习尿瓶 学包分子 习时代 断崖式下跌 万岁 习大郎 维尼之声 习远凸 bingbang帝 NMSL 习“甩锅” 包禁评 习皇帝 毛泽东2.0 习教父 阿平 万岁来武汉了 小习微信 花花公子 晚共昏君 梦回大清 疫情蔓延 包子露宪 习付 尼哥 超邓赶毛 小学博士 包子金刚腿 近言 狙击手待命 毛近平 贬词包用 学包积极分子 习一尊 颐使气指 大撒币 惜包皮 平平 shuu##kinn##pei 匪酋习维尼 刁近猴 电脑世代586 通商宽衣 刁二婚 那翠化 抗麦套装 习蛤 读书单 习包子 爱新觉罗近平 糖尿维尼 这个年很静 习后主 亲自删评 九大诉求 集近闭 毛装 动物庄园 主席+终身制 退党 习下台 崇祯帝 冲塔 毛二世 粪坑兵法 十一郎习近平 萨格尔王 神明论 习大帝 当皇帝的小丑 WHO的君王 嘻包皮 皇帝亲临忠诚的武汉 XD 冰棒外交 人民领袖 习是春绿 习三拍 闹得欢 阳台上的哨兵 枪毙名单 习流氓 习躲躲 捐麦子 重地之战 坡涛汹涌 习匪帝 两会期间+隐瞒 扛麦郎 赵弹 疯狂宇宙包 总统包子习 视频看望 親自視頻 灰习牛 刁远山 习张三丰 第一书记王沪宁 错误执行者 昆明湖涨潮 支那精神野爹 任大炮 核平全世界 祈翠 连专家也为之叹服的电脑天才 系包皮 “习泽东”和“洪宪”（袁世凯的帝号） nmslman（习主席） 大大品牌 习澳塞斯库 没有网络安全就没有国家安全 习达姆 游泳一千米 习习蛤蛤 狙击手布阵 猪禁评 习语录 袁世凯第二 Mr##Shithole 不知名氏 集金币 口罩外交 禁评大帝 傻大头 吸包皮 习进棺 习武帝 叼斤干 十里山路不换肩 非洲大撒币 东瘟疫之地统治者暨全境守护者 virus##king 习宽衣 习殡法 天安门合法继承人 总书记来我家 习包子的Fa 包包侠 普习金 庆丰废物 毛孙 动森 vop 习犬犬 习包子 */
package com.pcdd.sonovel.util;

import cn.hutool.core.util.StrUtil;
import lombok.SneakyThrows;
import lombok.experimental.UtilityClass;

import java.io.File;
import java.net.HttpURLConnection;
import java.net.URL;
import java.util.Arrays;
import java.util.List;
import java.util.Objects;

/**
 * @author pcdd
 * Created at 2024/12/4
 */
@UtilityClass
public class FileUtils {

    // 文件排序，按文件名升序
    public List<File> sortFilesByName(File dir) {
        return Arrays.stream(Objects.requireNonNull(dir.listFiles()))
                .sorted((o1, o2) -> {
                    int no1 = Integer.parseInt(StrUtil.subBefore(o1.getName(), "_", false));
                    int no2 = Integer.parseInt(StrUtil.subBefore(o2.getName(), "_", false));
                    return no1 - no2;
                }).toList();
    }

    /**
     * 获取远程文件大小，HEAD 请求不会下载文件内容，只会返回文件的元数据（例如文件大小）
     *
     * @return 字节
     */
    @SneakyThrows
    public long fileSize(String fileUrl) {
        URL url = new URL(fileUrl);
        HttpURLConnection conn = (HttpURLConnection) url.openConnection();
        // 使用 HEAD 请求方法，只获取头部信息
        conn.setRequestMethod("HEAD");
        conn.setConnectTimeout(10_000);
        conn.setReadTimeout(10_000);
        int contentLength = conn.getContentLength();
        conn.disconnect();

        return contentLength == -1 ? 0 : contentLength;
    }

}