/* 送礼平 习匪 中国离岸隐匿资产管理工作领导小组组组长 口罩大会 十日文革 爱新觉罗·近平 叩谢习恩 叩谢习恩 習敗北 中国首席造梦大师 习皇帝 迈克尔·索伊 习流氓 刁斤山 沼气专家 恩维尔·霍习 习进棺 错误执行者 民进党 讨习檄文 总书记来我家 人民战争 通商宽衣 shit##hole##bing##fa 刁人13 bingbang帝 习奥赛斯库 非洲大撒币 中国离岸隐匿资产管理工作领导小组组组长 喷粪帝 第22条军规 甴种 独裁国贼 五毛主席 外交习语 集金币 墨索里习 习博士 厕所革命 习家军 任志强 专治各种不服 总书记来过我的家 赵王 修宪连任 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 習大佬 习像章 袭包皮 习##卡##巴##卡 第一书记王沪宁 口罩外交 胡志平 习孢子 嬉包皮 习公奭 当代秦始皇 维尼熊 清零宗、清零帝 电脑世代586 习尿瓶 平平 Voice##of##Pooh 冠子兵法 親自視頻 神明论 习大帝 亲自指挥 清华毕业 西朝鲜人民自治岛 北红尾鸲 赛禁评 小习微信 头号球迷 习猪下台 东方project 习病法 习总 裸宽包子劾心 习时代 习后主 世界最强乞丐 撒币宝 习猪头 玉习大帝 裹嘎举吸钢闸门 维尼写史 没有网络安全就没有国家安全 粪坑兵法 XDD 习二世胡亥 习歪嘴 智商不重要 乳透社##小反旗 二次袁、袁世凯二世、袁二 字共狗 傻大头 习包子的Fa 闹得欢 相信有神论的物理学博士 刁斤二 二百斤 包子金刚腿 习兵法 10号跳跳虎被维尼拉清单 维尼连任 国贼习近平 疯狂宇宙 老街 nmslese##dream 万岁 枪毙名单 孤独的毒王 崇祯 席近平 白猪 野兽主席 万岁来武汉 人尽皆知的体育迷 习匪帝 习皇的新装 习尔布特 习犬犬 乳制品 阿平 席子兵法 包包大人 隔离”的金葫芦 百万雄师事件 初二圣君 捐麦子 刁近猴 野蛮其体魄 习教父 nmslman（习主席） 法习斯 金科律玉 恐惊天上人 习言乱语 庆丰包·勃列日涅夫 习梦撕 官僚主义 墙内人 习总输记 shit侯 20000T麦子 集金pay 习二蛋 扛麦郎 习一尊 战疫国 包禁评 親自蒞臨 宽衣帝 包帝巡游 习得梁家书卷 刁二将 猪禁评 维尼史 “皇帝梦” V尼哥 坟头蹦迪 中国拉清单工作领导小组组长 习下台 腊肉包 习梦思 “黄袍加身” 新影帝 仲夏夜之中国梦 4中组长 习澳塞斯库 信女愿一生吃素 vop 习近砰 惜包皮 洗包皮 岿然不动 xdd 戴口赵 韦来书记 习三拍 习驴 时间控制 中国爱非洲 颐使气指 《生物安全法》 Adolf##Xitler 乳包文化 中国的新皇帝 终身领导人 坡涛汹涌 維尼頌 禁评封号 孢 武当七侠的政治斗争 狙击手布阵 赵人13 皇帝亲临忠诚的武汉 2020全面小康 武统时代 不强自息 NMSL 习条英机 200吨 东瘟疫之地统治者暨全境守护者 恩重如删 哲欣 维尼·屎(Winnie##the##Poo) 国王 秦城监狱 红旗下的蛋 独彩者 习狍 习武帝 刁后主 习付 野心习 最后领导人 红二代 习习蛤蛤 瘟疫降生习近平 习王的田野上 末代皇帝 蹄防 习宽衣 当代秦二世 习低能儿 毛泽东2.0 赵家家仆 二百五大帝 習敗敗 动物森友会 习思想 XD 法外狂徒Lucy（德国） 大撒幣 野兽先辈 儿童习典 习是春绿 战“疫”金句 习特勒 毛孙 大大品牌 悉包皮 习king 称帝修宪 习猪席 甩锅侠 大国造疫 习太孑 维尼熊给跳跳虎黄牌 袁世凯第二 平话 黑白翠 大大招牌 习奥塞斯库 包子宪法 习厉王 “复辟” 习老八 祈翠語言包 头上三尺有神明 维尼之声 支那毒王 腊肉馅儿包子 “无罩”现身 萨格尔王 赵付 十一郎习近平 皇帝梦 大锅瞻遗 包皇 游泳一千米 赵弹 系包皮 修宪 纳翠党 重地之战 吸包皮 包子露宪 习壳郎 喜包皮 颐指气使 皇帝亲临忠诚的武汉 人民领袖 Criminal##Xi##"Xitler"##Jinping 倒车斯基 领袖习澡水 连专家也为之叹服的电脑天才 川普的朋友or敌人 家业论 习殡法 亲自指挥疫情 坡涛汹涌 吃赵弹 习式病毒 书单吟诵者 退党 戏博士 庆丰称帝 习禁评 小学居士 “习泽东”和“洪宪”（袁世凯的帝号） 冤大头 役民五术 屎侯 花花公子 邪大大 刁人13 文明其精神 维尼挂彩 断崖式下跌 习侯 背书单 “梦回大清” 习是春竹 半羽习近平 次级乳包 骑巨龙 拉清单 习背书 习蛤 习正日 习卒 不同意的举手##没有##没有 感恩教育 包大人 维持会长 习大犬 习包皮 嘻包皮 梁家河贵族 耀眼黄红黄 共哀宗 你是反贼吗 近言 习废帝 没规划的葬礼 满脸喷粪 甴近平 叼斤干 公车上书 习二卒 习远凸 习“甩锅” 习Core 毛二 疯狂宇宙包 习大乞 习瘟猪 读书单 习屎黄 细瓶颈 当皇帝的小丑 添宪宝宝 彭主席（习主席走了太太接班） 抗麦套装 习近平光辉形象 视频看望 习曱甴 亲自考察 习张三丰 宰相 总加速师 基拉大和习近平 那翠化 CoronaXi 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 毛魔转世 习夶 做N届的主席 维稳警察（O） 读稿机 习达姆 狙击手待命 一带一路 皇帝的新衣 普近 Cicada##3301##XD 修宪帝 刁二婚 崇祯帝 维尼梗有害 习梦死 64岁 Corona##Xi（习病毒） 720事件 鞋哥 A##Big##Deal 狙击手待命 彩色熊 维尼快乐组织（Winnie##Happy##Organization）简称WHO 习贼 包子兵法 尼哥 吸精瓶 一天游泳一千米 糟糕皇帝 宽衣大帝 梦回大清 维尼警察（X） 学包率 北京中南海支部书记 Chairman##Xi 追思焦裕禄 万岁来武汉了 独裁者 昆明湖涨潮 大撒币 不知名氏 梦帝 习包子 九评 近日成 习语录 亲自封号 小学博士 亲自脱贫 糖尿维尼 毛二习 毛进平 Mr##Shithole 大海掀翻小池塘 号屎洞 shit禁评 央视姓党 习大林 刁大犬 九大诉求 中国特色射秽煮疫制度 习奥塞斯库、齐奥塞斯库 劝进 包子病毒 习大 彩色哥 青年大学包 每日祈翠 羽日帝 毛装 习包子 习呆呆 庆丰废物 形式主义防疫 富平学霸刁斤干 大兔 灭共助推器 任大炮 屎進瓶 禁评大帝 维尼大帝 氼兲嫑炛 WHO的君王 粪坑先生 御板泽民 洗尽贫 梁家河 黄俄 总统包子习 人类命运共同体首席架构师 截颈平 巴拿马文件 食腐虫 爱新觉罗近平 祈翠 两会期间+隐瞒 习索里尼 塔西佗陷阱 足球外交 学包分子 Heil##Xitler 学包积极分子 太祖兔 老歪脖子树 习二胖 共哀宗 中字头组长 包经 武汉委托李克强 日子像蜜甜 尊蛤讨包 䒒(tiáo)菦(qín)苹(píng) 动物之森 细颈瓶 十里山路不换肩 习二坐船 动森 人均接近八千万 蔡英文最强助选 朝令夕改 习emperor 刁远山 毛近平 禁评的理由 帝皇頌 号尿壶公 习三点 夶 亲自删评 戏包皮 假.."~bang！卒 shuu##kinn##pei 天安门合法继承人 386系统驱动游戏 “登基” 屎禁评 “登机”（与登基同音） 云视察 晚共昏君 习躲躲 卡近菲 virus##king 普习金 孙笑川 发皇帝梦 主席+终身制 支那精神野爹 瘟疫领主习近平 近身平A 格萨尔 庆丰帝的千秋梦 毛二世 ChinaXi 动物庄园 平&强 冰棒外交 无限连任 倒车帝 清单帝 超邓赶毛 世宗 习语 SB包子 包惠帝 这个年很静 The##Xi##Factor（习近平因素） 翡翠娘娘 习尽贫 主席贺词 灰习牛 electron8964 匪酋习维尼 习和谐 包包侠 现任匪首 集近闭 不敢高声语 习二二（二零二零年五月二十二日开二会） 指定接班人 阳台上的哨兵 扛麦帝 维尼带货 维尼DISCO 影子末帝 冲塔 疫情蔓延 贬词包用 通商宽衣 习包子 习大郎 倒车 核平全世界 刁近乎 刁槑夶尛 阿道夫-习 我是一个足球迷 习核心 疯狂宇宙大帝 习卒习 人民领袖 慨撒大帝 */
package com.pcdd.sonovel.util;

import cn.hutool.core.collection.CollUtil;
import com.pcdd.sonovel.core.Source;
import com.pcdd.sonovel.model.AppConfig;
import lombok.experimental.UtilityClass;

import java.util.Collection;
import java.util.List;
import java.util.stream.IntStream;

/**
 * @author pcdd
 * Created at 2025/1/29
 */
@UtilityClass
public class SourceUtils {

    // 全部书源
    public final List<Integer> ALL_IDS = IntStream.rangeClosed(1, 18).boxed().toList();
    // 需要代理的书源
    public final List<Integer> PROXY_IDS = CollUtil.newArrayList(6, 7, 12, 16);
    // 支持聚合搜索的书源
    public final Collection<Integer> AGGREGATED_IDS = CollUtil.disjunction(ALL_IDS, PROXY_IDS);


    public int getCount() {
        return ALL_IDS.size();
    }

    public List<Source> getSearchableSources() {
        return AGGREGATED_IDS.stream()
                .map(id -> {
                    AppConfig config = ConfigUtils.config();
                    config.setSourceId(id);
                    return new Source(config);
                })
                .toList();
    }

}