/* 中国特色射秽煮疫制度 彭主席（习主席走了太太接班） 东方project 习二二（二零二零年五月二十二日开二会） 皇帝梦 公车上书 半羽习近平 A##Big##Deal 维尼警察（X） 习厉王 习像章 彩色哥 最后领导人 领袖习澡水 羽日帝 川普的朋友or敌人 包经 人民战争 不强自息 習大佬 阿道夫-习 卡近菲 吸包皮 200吨 外交习语 昆明湖涨潮 新影帝 习病法 “登基” 这个年很静 XD “梦回大清” 白猪 袁世凯第二 普近 恩维尔·霍习 任志强 习尿瓶 刁二将 戏博士 嘻包皮 习习蛤蛤 習敗敗 巴拿马文件 小学博士 家业论 包子病毒 格萨尔 通商宽衣 xdd 习包子 SB包子 叩谢习恩 赵家家仆 倒车斯基 韦来书记 墨索里习 毛进平 细颈瓶 青年大学包 断崖式下跌 裹嘎举吸钢闸门 塔西佗陷阱 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 中字头组长 习博士 习进棺 坡涛汹涌 信女愿一生吃素 习二胖 北京中南海支部书记 字共狗 习二蛋 九评 nmslese##dream Criminal##Xi##"Xitler"##Jinping 习包皮 时间控制 野蛮其体魄 习教父 virus##king 通商宽衣 刁人13 黑白翠 赛禁评 维尼DISCO 习大犬 习匪 习语 秦城监狱 官僚主义 习歪嘴 庆丰称帝 电脑世代586 一带一路 儿童习典 戴口赵 庆丰废物 “无罩”现身 系包皮 撒币宝 习猪下台 老街 大撒币 不知名氏 西朝鲜人民自治岛 习总输记 爱新觉罗·近平 近言 习尔布特 老歪脖子树 祈翠 喷粪帝 皇帝亲临忠诚的武汉 习下台 刁二婚 没有网络安全就没有国家安全 人均接近八千万 北红尾鸲 “黄袍加身” 世宗 戏包皮 墙内人 习皇帝 shit侯 习太孑 口罩大会 红旗下的蛋 做N届的主席 习远凸 习得梁家书卷 退党 维尼梗有害 云视察 “习泽东”和“洪宪”（袁世凯的帝号） 人民领袖 发皇帝梦 拉清单 XDD 親自視頻 疯狂宇宙包 习大 平平 修宪连任 Voice##of##Pooh 386系统驱动游戏 亲自脱贫 送礼平 世界最强乞丐 基拉大和习近平 习卒 中国首席造梦大师 维尼大帝 万岁 沼气专家 习正日 中国拉清单工作领导小组组长 包禁评 刁斤二 毛二 学包率 我是一个足球迷 屎進瓶 Chairman##Xi 形式主义防疫 共哀宗 中国的新皇帝 感恩教育 习大乞 动物庄园 小学居士 习屎黄 《生物安全法》 赵王 习大郎 嬉包皮 习时代 习二世胡亥 乳制品 主席贺词 终身领导人 习二坐船 Corona##Xi（习病毒） NMSL 不敢高声语 那翠化 屎侯 吸精瓶 习式病毒 习孢子 初二圣君 赵付 毛近平 习近砰 席子兵法 亲自指挥疫情 书单吟诵者 习奥赛斯库 习低能儿 清单帝 习呆呆 包惠帝 习三拍 总书记来我家 electron8964 扛麦郎 皇帝亲临忠诚的武汉 细瓶颈 红二代 人尽皆知的体育迷 崇祯 重地之战 迈克尔·索伊 颐使气指 包子宪法 尼哥 头上三尺有神明 习禁评 亲自指挥 包大人 央视姓党 袭包皮 习近平光辉形象 黄俄 战疫国 习犬犬 CoronaXi 包子兵法 太祖兔 庆丰帝的千秋梦 親自蒞臨 shuu##kinn##pei 游泳一千米 Cicada##3301##XD 没规划的葬礼 瘟疫降生习近平 习后主 包子金刚腿 当代秦二世 䒒(tiáo)菦(qín)苹(píng) 刁后主 梁家河贵族 “皇帝梦” 习殡法 毛装 头号球迷 你是反贼吗 共哀宗 文明其精神 禁评封号 无限连任 ChinaXi 智商不重要 坟头蹦迪 习蛤 习付 2020全面小康 习梦撕 习废帝 习贼 耀眼黄红黄 习澳塞斯库 维尼之声 shit##hole##bing##fa 第22条军规 习背书 习流氓 皇帝的新衣 中国爱非洲 vop 毛孙 叼斤干 Adolf##Xitler “登机”（与登基同音） 读书单 吃赵弹 悉包皮 720事件 粪坑先生 习和谐 亲自封号 4中组长 刁大犬 习king 截颈平 维尼写史 维尼连任 十日文革 V尼哥 习“甩锅” 厕所革命 大海掀翻小池塘 五毛主席 天安门合法继承人 错误执行者 两会期间+隐瞒 任大炮 氼兲嫑炛 习侯 蹄防 猪禁评 10号跳跳虎被维尼拉清单 习皇的新装 武统时代 朝令夕改 法外狂徒Lucy（德国） 包包大人 学包积极分子 翡翠娘娘 腊肉馅儿包子 刁近猴 国王 二百五大帝 人类命运共同体首席架构师 御板泽民 修宪 习达姆 包子露宪 九大诉求 糟糕皇帝 亲自删评 十一郎习近平 平&强 邪大大 背书单 shit禁评 习一尊 骑巨龙 倒车 习包子 维尼快乐组织（Winnie##Happy##Organization）简称WHO 席近平 彩色熊 总书记来过我的家 倒车帝 武当七侠的政治斗争 假.."~bang！卒 捐麦子 習敗北 瘟疫领主习近平 乳包文化 灰习牛 冰棒外交 洗尽贫 习三点 武汉委托李克强 满脸喷粪 追思焦裕禄 习语录 刁近乎 闹得欢 习大帝 包帝巡游 集金币 足球外交 颐指气使 崇祯帝 清华毕业 阿平 大撒币 冠子兵法 大撒幣 习奥塞斯库 习猪头 习大林 纳翠党 宽衣帝 中国离岸隐匿资产管理工作领导小组组组长 食腐虫 总加速师 Mr##Shithole 冤大头 百万雄师事件 国贼习近平 大兔 大大招牌 疫情蔓延 疯狂宇宙 日子像蜜甜 号尿壶公 独裁者 爱新觉罗近平 习emperor 支那精神野爹 惜包皮 讨习檄文 包包侠 野兽主席 毛魔转世 习索里尼 尊蛤讨包 The##Xi##Factor（习近平因素） 现任匪首 习家军 大国造疫 习夶 粪坑兵法 习驴 习梦死 普习金 大大品牌 中国离岸隐匿资产管理工作领导小组组组长 贬词包用 岿然不动 枪毙名单 恩重如删 口罩外交 习张三丰 当代秦始皇 集近闭 糖尿维尼 玉习大帝 灭共助推器 祈翠語言包 动物之森 相信有神论的物理学博士 维尼带货 号屎洞 夶 维尼史 刁人13 乳透社##小反旗 动森 孢 集金pay 坡涛汹涌 维尼熊 亲自考察 nmslman（习主席） 习狍 支那毒王 法习斯 阳台上的哨兵 狙击手待命 慨撒大帝 指定接班人 主席+终身制 冲塔 习王的田野上 维持会长 近身平A 蔡英文最强助选 习匪帝 习卒习 习核心 毛二世 恐惊天上人 梦回大清 富平学霸刁斤干 维尼挂彩 晚共昏君 隔离”的金葫芦 习兵法 次级乳包 学包分子 抗麦套装 扛麦帝 习二卒 专治各种不服 人民领袖 小习微信 连专家也为之叹服的电脑天才 仲夏夜之中国梦 bingbang帝 野心习 习总 大锅瞻遗 习特勒 习包子 匪酋习维尼 独彩者 金科律玉 禁评大帝 万岁来武汉了 花花公子 鞋哥 习公奭 傻大头 哲欣 习梦思 称帝修宪 野兽先辈 超邓赶毛 神明论 毛二习 洗包皮 甩锅侠 习宽衣 习##卡##巴##卡 孙笑川 战“疫”金句 平话 一天游泳一千米 狙击手布阵 习Core 习猪席 疯狂宇宙大帝 梦帝 禁评的理由 核平全世界 刁远山 东瘟疫之地统治者暨全境守护者 胡志平 习包子的Fa 包皇 维稳警察（O） 劝进 维尼·屎(Winnie##the##Poo) 刁斤山 习躲躲 习是春竹 維尼頌 腊肉包 “复辟” 万岁来武汉 赵人13 习老八 狙击手待命 动物森友会 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 20000T麦子 孤独的毒王 习条英机 庆丰包·勃列日涅夫 64岁 喜包皮 每日祈翠 帝皇頌 末代皇帝 习思想 习言乱语 读稿机 Heil##Xitler 裸宽包子劾心 第一书记王沪宁 近日成 梁家河 添宪宝宝 屎禁评 视频看望 习武帝 刁槑夶尛 维尼熊给跳跳虎黄牌 叩谢习恩 WHO的君王 民进党 总统包子习 当皇帝的小丑 不同意的举手##没有##没有 影子末帝 赵弹 习瘟猪 习是春绿 宰相 役民五术 */
package com.pcdd.sonovel.model;

import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/11/30
 */
@Data
public class AppConfig {

    private String version;

    // [base]
    private String language;
    private Integer sourceId;
    private String downloadPath;
    private String extName;
    private Integer autoUpdate;
    private Integer interactiveMode;

    // [crawl]
    private Integer threads;
    private Integer minInterval;
    private Integer maxInterval;

    // [retry]
    private Integer maxRetryAttempts;
    private Integer retryMinInterval;
    private Integer retryMaxInterval;

    // [proxy]
    private Integer proxyEnabled;
    private String proxyHost;
    private Integer proxyPort;

}