/* 国王 武统时代 不强自息 疯狂宇宙大帝 退党 截颈平 包经 动物森友会 九大诉求 习武帝 习语 刁二婚 时间控制 墙内人 Adolf##Xitler 猪禁评 岿然不动 食腐虫 习公奭 惜包皮 修宪 人民战争 我是一个足球迷 习下台 川普的朋友or敌人 WHO的君王 亲自考察 习言乱语 法外狂徒Lucy（德国） 老歪脖子树 习呆呆 不敢高声语 习歪嘴 吃赵弹 包皇 彩色哥 墨索里习 耀眼黄红黄 爱新觉罗·近平 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 习废帝 没有网络安全就没有国家安全 两会期间+隐瞒 习宽衣 当代秦二世 家业论 学包分子 卡近菲 终身领导人 御板泽民 总加速师 颐指气使 习包子 中国特色射秽煮疫制度 习厉王 口罩大会 习犬犬 撒币宝 毛泽东2.0 中字头组长 通商宽衣 祈翠語言包 宽衣帝 冤大头 灭共助推器 屎進瓶 匪酋习维尼 习奥塞斯库、齐奥塞斯库 万岁 shit侯 大撒币 Criminal##Xi##"Xitler"##Jinping 中国离岸隐匿资产管理工作领导小组组组长 叩谢习恩 胡志平 bingbang帝 刁二将 386系统驱动游戏 十日文革 习付 法习斯 孤独的毒王 裹嘎举吸钢闸门 无限连任 维尼大帝 习远凸 非洲大撒币 习皇的新装 动森 毛二习 扛麦帝 贬词包用 塔西佗陷阱 昆明湖涨潮 习达姆 包子露宪 “无罩”现身 冰棒外交 最后领导人 吸精瓶 五毛主席 习老八 维持会长 那翠化 修宪连任 北京中南海支部书记 《生物安全法》 习低能儿 乳包文化 刁近猴 皇帝亲临忠诚的武汉 天安门合法继承人 百万雄师事件 足球外交 公车上书 野兽主席 庆丰称帝 皇帝亲临忠诚的武汉 战疫国 任志强 包子兵法 云视察 习病法 Corona##Xi（习病毒） 习贼 刁斤二 大海掀翻小池塘 人民领袖 平话 習敗北 习匪 习三拍 习二坐船 维尼熊 习禁评 习奥赛斯库 沼气专家 近日成 东瘟疫之地统治者暨全境守护者 甩锅侠 人尽皆知的体育迷 读书单 独彩者 狙击手待命 老街 人均接近八千万 阿道夫-习 亲自脱贫 万岁来武汉了 “复辟” 200吨 习教父 外交习语 喷粪帝 清零宗、清零帝 习梦死 骑巨龙 总书记来我家 维尼警察（X） 劝进 甴种 习梦思 悉包皮 彩色熊 送礼平 爱新觉罗近平 黑白翠 集金币 习语录 近言 央视姓党 野心习 国贼习近平 羽日帝 主席+终身制 总统包子习 错误执行者 花花公子 习猪席 糖尿维尼 日子像蜜甜 中国爱非洲 维尼·屎(Winnie##the##Poo) XDD 袁世凯第二 尊蛤讨包 习大郎 夶 大国造疫 屎禁评 共哀宗 CoronaXi 扛麦郎 萨格尔王 孢 洗包皮 习尔布特 武当七侠的政治斗争 刁近乎 恩重如删 习殡法 宽衣大帝 “皇帝梦” 习总输记 头号球迷 闹得欢 洗尽贫 亲自封号 平&强 包子金刚腿 口罩外交 瘟疫降生习近平 vop 支那精神野爹 当代秦始皇 假.."~bang！卒 断崖式下跌 细瓶颈 黄俄 The##Xi##Factor（习近平因素） 毛魔转世 毛二世 维尼连任 大大招牌 九评 仲夏夜之中国梦 中国的新皇帝 习王的田野上 官僚主义 皇帝梦 electron8964 形式主义防疫 习尽贫 习流氓 野兽先辈 V尼哥 小习微信 文明其精神 太祖兔 习大林 颐使气指 崇祯帝 习二二（二零二零年五月二十二日开二会） 金科律玉 现任匪首 嬉包皮 习奥塞斯库 东方project 习##卡##巴##卡 习Core 追思焦裕禄 刁槑夶尛 习躲躲 毛二 哲欣 禁评的理由 阿平 Chairman##Xi 习特勒 倒车帝 shuu##kinn##pei 毛进平 亲自指挥 习驴 维尼DISCO 不同意的举手##没有##没有 蹄防 普近 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 恐惊天上人 4中组长 你是反贼吗 庆丰包·勃列日涅夫 不知名氏 包包大人 厕所革命 习瘟猪 亲自删评 习近砰 冠子兵法 抗麦套装 习包子 戏博士 冲塔 习进棺 nmslman（习主席） 梦回大清 通商宽衣 习近平光辉形象 红二代 大兔 维尼梗有害 包子宪法 包惠帝 彭主席（习主席走了太太接班） 习猪下台 virus##king 习二胖 视频看望 蔡英文最强助选 十一郎习近平 习习蛤蛤 习后主 习是春绿 狙击手待命 动物之森 毛装 席子兵法 清华毕业 20000T麦子 独裁者 刁大犬 发皇帝梦 腊肉包 Voice##of##Pooh 号尿壶公 每日祈翠 恩维尔·霍习 习澳塞斯库 赵付 习emperor 庆丰废物 半羽习近平 屎侯 疫情蔓延 习曱甴 习索里尼 毛孙 学包积极分子 刁斤山 普习金 信女愿一生吃素 影子末帝 秦城监狱 xdd 习包子 64岁 维尼史 人类命运共同体首席架构师 nmslese##dream 毛近平 戴口赵 大锅瞻遗 习屎黄 习大乞 習敗敗 包子病毒 玉习大帝 习king 親自視頻 智商不重要 次级乳包 崇祯 习大帝 任大炮 习背书 “登基” 读稿机 习一尊 shit##hole##bing##fa 赛禁评 包包侠 10号跳跳虎被维尼拉清单 一带一路 习是春竹 习二蛋 2020全面小康 Mr##Shithole 满脸喷粪 习猪头 习大犬 儿童习典 习尿瓶 小学博士 独裁国贼 重地之战 尼哥 人民领袖 “登机”（与登基同音） 中国首席造梦大师 第一书记王沪宁 习“甩锅” 裸宽包子劾心 刁远山 习思想 这个年很静 Cicada##3301##XD 狙击手布阵 叩谢习恩 连专家也为之叹服的电脑天才 世宗 “梦回大清” 习包子的Fa 叼斤干 赵弹 近身平A 庆丰帝的千秋梦 ChinaXi 白猪 习得梁家书卷 維尼頌 第22条军规 习张三丰 细颈瓶 迈克尔·索伊 疯狂宇宙包 习卒习 習大佬 鞋哥 XD 拉清单 末代皇帝 习太孑 添宪宝宝 帝皇頌 维尼写史 倒车斯基 刁人13 翡翠娘娘 一天游泳一千米 隔离”的金葫芦 核平全世界 号屎洞 头上三尺有神明 万岁来武汉 集金pay 親自蒞臨 系包皮 维尼熊给跳跳虎黄牌 指定接班人 习核心 瘟疫领主习近平 嘻包皮 修宪帝 甴近平 习像章 “习泽东”和“洪宪”（袁世凯的帝号） 维稳警察（O） Heil##Xitler 韦来书记 大大品牌 粪坑兵法 神明论 习兵法 习时代 䒒(tiáo)菦(qín)苹(píng) 基拉大和习近平 习式病毒 慨撒大帝 袭包皮 集近闭 包禁评 “黄袍加身” 乳透社##小反旗 民进党 疯狂宇宙 支那毒王 习蛤 晚共昏君 习条英机 腊肉馅儿包子 二百斤 初二圣君 赵家家仆 A##Big##Deal 维尼快乐组织（Winnie##Happy##Organization）简称WHO 习博士 相信有神论的物理学博士 席近平 吸包皮 专治各种不服 乳制品 习和谐 超邓赶毛 灰习牛 阳台上的哨兵 纳翠党 习狍 西朝鲜人民自治岛 习家军 感恩教育 新影帝 720事件 维尼之声 小学居士 邪大大 习三点 亲自指挥疫情 书单吟诵者 武汉委托李克强 坡涛汹涌 大撒幣 总书记来过我的家 习二世胡亥 习壳郎 习大 二次袁、袁世凯二世、袁二 习正日 shit禁评 北红尾鸲 红旗下的蛋 富平学霸刁斤干 SB包子 孙笑川 刁人13 捐麦子 NMSL 粪坑先生 戏包皮 禁评大帝 字共狗 赵人13 氼兲嫑炛 傻大头 朝令夕改 习皇帝 习梦撕 巴拿马文件 背书单 糟糕皇帝 梦帝 主席贺词 坡涛汹涌 平平 刁后主 格萨尔 禁评封号 当皇帝的小丑 倒车 维尼带货 习总 习夶 称帝修宪 二百五大帝 领袖习澡水 动物庄园 电脑世代586 习匪帝 习二卒 坟头蹦迪 野蛮其体魄 习卒 世界最强乞丐 没规划的葬礼 役民五术 枪毙名单 讨习檄文 赵王 习侯 祈翠 包帝巡游 游泳一千米 中国离岸隐匿资产管理工作领导小组组组长 共哀宗 战“疫”金句 做N届的主席 清单帝 喜包皮 中国拉清单工作领导小组组长 梁家河 梁家河贵族 皇帝的新衣 青年大学包 习包皮 维尼挂彩 十里山路不换肩 宰相 习孢子 包大人 学包率 */
package com.pcdd.sonovel.model;

import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/11/30
 */
@Data
public class AppConfig {

    private String version;

    // [base]
    private String language;
    private String downloadPath;
    private String extName;
    private Integer autoUpdate;
    private Integer interactiveMode;
    private Integer sourceId;
    private Integer searchLimit;

    // [crawl]
    private Integer threads;
    private Integer minInterval;
    private Integer maxInterval;

    // [retry]
    private Integer maxRetryAttempts;
    private Integer retryMinInterval;
    private Integer retryMaxInterval;

    // [proxy]
    private Integer proxyEnabled;
    private String proxyHost;
    private Integer proxyPort;

}