/* 颐使气指 影子末帝 近身平A 没有网络安全就没有国家安全 时间控制 人类命运共同体首席架构师 习“甩锅” 扛麦郎 狙击手布阵 洗包皮 墨索里习 习躲躲 清单帝 习大帝 维尼写史 不强自息 爱新觉罗近平 形式主义防疫 Mr##Shithole 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ Cicada##3301##XD “梦回大清” 习包皮 梦帝 小习微信 毛进平 习大犬 法外狂徒Lucy（德国） 骑巨龙 习是春绿 习正日 半羽习近平 中字头组长 维稳警察（O） 电脑世代586 平平 动物森友会 习犬犬 爱新觉罗·近平 shuu##kinn##pei 书单吟诵者 习猪席 包经 吃赵弹 习得梁家书卷 习二二（二零二零年五月二十二日开二会） 冠子兵法 冤大头 红二代 shit禁评 习下台 疫情蔓延 NMSL 役民五术 习远凸 细瓶颈 維尼頌 乳包文化 亲自封号 百万雄师事件 庆丰包·勃列日涅夫 shit##hole##bing##fa 习和谐 枪毙名单 习二坐船 nmslese##dream 花花公子 吸包皮 习二胖 足球外交 央视姓党 毛二习 独裁者 劝进 皇帝亲临忠诚的武汉 nmslman（习主席） 胡志平 刁槑夶尛 刁大犬 孤独的毒王 亲自指挥疫情 习背书 游泳一千米 毛二 virus##king 厕所革命 习emperor 维尼之声 总书记来过我的家 第22条军规 匪酋习维尼 现任匪首 讨习檄文 无限连任 狙击手待命 习##卡##巴##卡 習敗北 人民领袖 指定接班人 习歪嘴 维尼梗有害 屎禁评 XD 背书单 我是一个足球迷 ChinaXi 祈翠語言包 九评 习二卒 习二世胡亥 包大人 五毛主席 亲自脱贫 头上三尺有神明 V尼哥 翡翠娘娘 没规划的葬礼 习匪 “登机”（与登基同音） 习式病毒 孙笑川 学包率 共哀宗 粪坑兵法 红旗下的蛋 灭共助推器 食腐虫 系包皮 习尔布特 东瘟疫之地统治者暨全境守护者 儿童习典 狙击手待命 彩色哥 习语 云视察 万岁来武汉了 禁评封号 富平学霸刁斤干 《生物安全法》 通商宽衣 大大品牌 习狍 次级乳包 共哀宗 总加速师 黄俄 親自視頻 尼哥 扛麦帝 战疫国 一天游泳一千米 习殡法 太祖兔 习禁评 親自蒞臨 国贼习近平 昆明湖涨潮 习梦死 维尼熊给跳跳虎黄牌 包子露宪 刁二将 动物之森 东方project 庆丰废物 耀眼黄红黄 包帝巡游 习总 核平全世界 刁人13 御板泽民 包子兵法 白猪 包子宪法 祈翠 720事件 习废帝 彩色熊 庆丰帝的千秋梦 习澳塞斯库 公车上书 通商宽衣 习太孑 亲自删评 官僚主义 瘟疫降生习近平 不敢高声语 亲自指挥 习猪头 乳制品 习家军 习是春竹 终身领导人 人尽皆知的体育迷 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 10号跳跳虎被维尼拉清单 裹嘎举吸钢闸门 赛禁评 倒车斯基 岿然不动 鞋哥 习兵法 慨撒大帝 刁斤山 这个年很静 大撒幣 战“疫”金句 修宪 文明其精神 任志强 仲夏夜之中国梦 氼兲嫑炛 十日文革 恩重如删 疯狂宇宙 冲塔 CoronaXi “皇帝梦” 主席贺词 万岁来武汉 386系统驱动游戏 崇祯帝 撒币宝 连专家也为之叹服的电脑天才 维尼挂彩 习条英机 初二圣君 20000T麦子 习大郎 习达姆 习匪帝 習敗敗 习皇的新装 羽日帝 200吨 习尿瓶 习习蛤蛤 基拉大和习近平 坡涛汹涌 末代皇帝 满脸喷粪 戏包皮 老街 哲欣 阿道夫-习 野蛮其体魄 维尼大帝 习近平光辉形象 不知名氏 灰习牛 抗麦套装 维尼熊 Heil##Xitler 习Core 天安门合法继承人 邪大大 SB包子 赵付 习付 拉清单 甩锅侠 贬词包用 习武帝 糟糕皇帝 任大炮 戴口赵 川普的朋友or敌人 万岁 习包子 阿平 习宽衣 中国拉清单工作领导小组组长 阳台上的哨兵 “复辟” 习张三丰 喜包皮 习包子 感恩教育 新影帝 亲自考察 习呆呆 习流氓 刁人13 恐惊天上人 动物庄园 袁世凯第二 纳翠党 格萨尔 疯狂宇宙包 修宪连任 武当七侠的政治斗争 北红尾鸲 习老八 集金币 2020全面小康 习病法 习梦思 习梦撕 席子兵法 包子病毒 vop 中国爱非洲 截颈平 号屎洞 刁近乎 习低能儿 清华毕业 赵人13 孢 维尼警察（X） 晚共昏君 瘟疫领主习近平 XDD 集金pay Criminal##Xi##"Xitler"##Jinping 习近砰 维尼快乐组织（Winnie##Happy##Organization）简称WHO 叩谢习恩 错误执行者 秦城监狱 卡近菲 中国的新皇帝 当代秦二世 维尼带货 洗尽贫 野兽主席 包包侠 沼气专家 惜包皮 假.."~bang！卒 刁后主 迈克尔·索伊 武汉委托李克强 裸宽包子劾心 习大乞 大撒币 梁家河贵族 习二蛋 吸精瓶 九大诉求 庆丰称帝 包禁评 朝令夕改 习一尊 小学博士 读书单 习猪下台 习进棺 世宗 嬉包皮 最后领导人 腊肉馅儿包子 包惠帝 添宪宝宝 习贼 维持会长 大海掀翻小池塘 学包分子 习特勒 傻大头 习语录 蹄防 习大 糖尿维尼 隔离”的金葫芦 皇帝亲临忠诚的武汉 习三点 人均接近八千万 粪坑先生 习孢子 韦来书记 习时代 梁家河 叼斤干 刁远山 习王的田野上 禁评的理由 头号球迷 皇帝梦 WHO的君王 习大林 断崖式下跌 The##Xi##Factor（习近平因素） 平话 禁评大帝 大大招牌 梦回大清 习公奭 袭包皮 学包积极分子 总书记来我家 青年大学包 国王 习瘟猪 习索里尼 法习斯 electron8964 日子像蜜甜 习奥塞斯库 Chairman##Xi 发皇帝梦 当皇帝的小丑 外交习语 习夶 习皇帝 专治各种不服 坡涛汹涌 乳透社##小反旗 毛孙 64岁 刁近猴 普习金 捐麦子 彭主席（习主席走了太太接班） 习言乱语 人民战争 称帝修宪 䒒(tiáo)菦(qín)苹(píng) 玉习大帝 巴拿马文件 读稿机 武统时代 闹得欢 习屎黄 bingbang帝 喷粪帝 宽衣帝 习驴 世界最强乞丐 动森 维尼史 习侯 腊肉包 皇帝的新衣 猪禁评 第一书记王沪宁 小学居士 颐指气使 号尿壶公 北京中南海支部书记 习奥赛斯库 追思焦裕禄 支那精神野爹 习包子 两会期间+隐瞒 大国造疫 帝皇頌 一带一路 包皇 叩谢习恩 宰相 民进党 蔡英文最强助选 平&强 维尼·屎(Winnie##the##Poo) shit侯 4中组长 习三拍 大兔 刁二婚 习king 习厉王 细颈瓶 嘻包皮 相信有神论的物理学博士 总统包子习 中国首席造梦大师 xdd 习总输记 口罩外交 支那毒王 恩维尔·霍习 近言 毛魔转世 “习泽东”和“洪宪”（袁世凯的帝号） 习包子的Fa 家业论 戏博士 送礼平 神明论 领袖习澡水 习蛤 席近平 维尼连任 倒车帝 夶 中国离岸隐匿资产管理工作领导小组组组长 大锅瞻遗 Adolf##Xitler 刁斤二 习核心 习卒 主席+终身制 十一郎习近平 信女愿一生吃素 不同意的举手##没有##没有 包子金刚腿 黑白翠 智商不重要 普近 习后主 字共狗 西朝鲜人民自治岛 独彩者 塔西佗陷阱 集近闭 坟头蹦迪 墙内人 Voice##of##Pooh 屎侯 近日成 维尼DISCO 習大佬 习博士 习教父 习卒习 金科律玉 野兽先辈 尊蛤讨包 “无罩”现身 野心习 做N届的主席 口罩大会 包包大人 二百五大帝 崇祯 每日祈翠 中国特色射秽煮疫制度 大撒币 屎進瓶 习思想 Corona##Xi（习病毒） A##Big##Deal 重地之战 视频看望 你是反贼吗 中国离岸隐匿资产管理工作领导小组组组长 “黄袍加身” 当代秦始皇 习像章 赵弹 那翠化 超邓赶毛 退党 毛装 “登基” 倒车 人民领袖 疯狂宇宙大帝 毛二世 老歪脖子树 毛近平 赵家家仆 冰棒外交 悉包皮 赵王 */
package com.pcdd.sonovel.model;

import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/3/17
 */
@Data
public class Book {

    private String url;
    private String bookName;
    private String author;
    private String intro;
    private String category;
    private String coverUrl;
    private String latestChapter;
    private String lastUpdateTime;
    private String status;
    private String wordCount;

}