/* 习歪嘴 习包子 战疫国 西朝鲜人民自治岛 动物森友会 习下台 金科律玉 劝进 Corona##Xi（习病毒） 修宪连任 野兽先辈 梦回大清 花花公子 中字头组长 大大品牌 习猪头 小学居士 第一书记王沪宁 中国特色射秽煮疫制度 维持会长 白猪 新影帝 集金币 “复辟” 毛孙 夶 老歪脖子树 当代秦始皇 戴口赵 二百五大帝 毛装 狙击手待命 任志强 指定接班人 习太孑 习大犬 甴种 冰棒外交 恩维尔·霍习 儿童习典 64岁 习贼 屎禁评 习梦思 灰习牛 习家军 包子宪法 云视察 梁家河 习尽贫 习特勒 習敗北 尊蛤讨包 庆丰称帝 爱新觉罗近平 格萨尔 习言乱语 习教父 袁世凯第二 䒒(tiáo)菦(qín)苹(píng) 富平学霸刁斤干 阿平 宽衣大帝 总书记来我家 冲塔 习大郎 悉包皮 毛二 厕所革命 乳透社##小反旗 号屎洞 shit##hole##bing##fa 人民领袖 习皇的新装 发皇帝梦 包子兵法 习呆呆 屎侯 习二胖 习是春竹 细颈瓶 大海掀翻小池塘 近日成 疯狂宇宙大帝 习公奭 赵王 集金pay 国贼习近平 习蛤 颐使气指 Voice##of##Pooh 习张三丰 阳台上的哨兵 视频看望 十里山路不换肩 宰相 动森 习驴 親自視頻 倒车斯基 屎進瓶 xdd 习包皮 袭包皮 集近闭 超邓赶毛 不敢高声语 中国拉清单工作领导小组组长 扛麦郎 撒币宝 核平全世界 10号跳跳虎被维尼拉清单 现任匪首 外交习语 刁近乎 习大 习梦撕 那翠化 独裁国贼 习奥塞斯库、齐奥塞斯库 2020全面小康 央视姓党 平话 席子兵法 洗尽贫 vop 一带一路 普近 赵弹 习博士 中国的新皇帝 学包积极分子 祈翠語言包 腊肉包 毛泽东2.0 没有网络安全就没有国家安全 退党 习二卒 倒车帝 腊肉馅儿包子 动物庄园 疯狂宇宙 维尼史 第22条军规 修宪帝 维尼大帝 “黄袍加身” 习狍 梁家河贵族 抗麦套装 不知名氏 形式主义防疫 朝令夕改 共哀宗 shuu##kinn##pei 习进棺 号尿壶公 捐麦子 习得梁家书卷 刁斤山 邪大大 役民五术 禁评封号 習敗敗 叩谢习恩 疯狂宇宙包 岿然不动 游泳一千米 羽日帝 一天游泳一千米 习索里尼 惜包皮 百万雄师事件 清华毕业 糟糕皇帝 维尼·屎(Winnie##the##Poo) 仲夏夜之中国梦 禁评的理由 “梦回大清” 野蛮其体魄 万岁来武汉了 习奥赛斯库 我是一个足球迷 “登机”（与登基同音） 习条英机 习厉王 万岁来武汉 习流氓 蹄防 秦城监狱 洗包皮 习卒习 纳翠党 习付 普习金 假.."~bang！卒 傻大头 灭共助推器 习尔布特 枪毙名单 习殡法 沼气专家 包帝巡游 领袖习澡水 做N届的主席 太祖兔 习习蛤蛤 截颈平 匪酋习维尼 清单帝 喜包皮 親自蒞臨 巴拿马文件 习夶 SB包子 刁人13 口罩外交 习曱甴 坡涛汹涌 乳包文化 大大招牌 错误执行者 你是反贼吗 赵付 习king 人类命运共同体首席架构师 专治各种不服 亲自删评 习式病毒 皇帝的新衣 添宪宝宝 恐惊天上人 崇祯帝 习近平光辉形象 习三拍 习侯 习澳塞斯库 拉清单 足球外交 喷粪帝 没规划的葬礼 读稿机 人均接近八千万 鞋哥 习和谐 二次袁、袁世凯二世、袁二 隔离”的金葫芦 习语 九大诉求 文明其精神 战“疫”金句 当皇帝的小丑 小习微信 世宗 法外狂徒Lucy（德国） 闹得欢 不同意的举手##没有##没有 东瘟疫之地统治者暨全境守护者 孙笑川 习孢子 习匪帝 20000T麦子 吃赵弹 包子病毒 习总 电脑世代586 维尼熊给跳跳虎黄牌 electron8964 《生物安全法》 次级乳包 习低能儿 刁后主 影子末帝 亲自脱贫 粪坑兵法 习尿瓶 主席贺词 Adolf##Xitler shit侯 氼兲嫑炛 天安门合法继承人 这个年很静 人民战争 习猪席 裸宽包子劾心 近身平A 书单吟诵者 习Core “无罩”现身 嘻包皮 翡翠娘娘 东方project 老街 亲自指挥疫情 爱新觉罗·近平 平&强 維尼頌 任大炮 总书记来过我的家 中国爱非洲 彩色哥 习emperor 信女愿一生吃素 NMSL 习总输记 习瘟猪 贬词包用 习像章 习后主 北京中南海支部书记 维尼写史 习二世胡亥 中国首席造梦大师 庆丰包·勃列日涅夫 维尼连任 nmslese##dream 瘟疫领主习近平 疫情蔓延 刁远山 塔西佗陷阱 称帝修宪 九评 习病法 习宽衣 通商宽衣 叩谢习恩 时间控制 V尼哥 习梦死 习二二（二零二零年五月二十二日开二会） 独彩者 习匪 红二代 习时代 WHO的君王 席近平 萨格尔王 赵人13 通商宽衣 墙内人 帝皇頌 扛麦帝 法习斯 习废帝 包大人 共哀宗 赛禁评 终身领导人 支那精神野爹 习禁评 CoronaXi 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 习皇帝 十日文革 习包子 冤大头 习躲躲 包包侠 猪禁评 基拉大和习近平 习猪下台 二百斤 习二坐船 中国离岸隐匿资产管理工作领导小组组组长 坡涛汹涌 迈克尔·索伊 细瓶颈 追思焦裕禄 维尼熊 習大佬 学包分子 Chairman##Xi 大撒币 平平 “登基” 头号球迷 386系统驱动游戏 彩色熊 冠子兵法 讨习檄文 维尼挂彩 彭主席（习主席走了太太接班） 川普的朋友or敌人 支那毒王 青年大学包 习是春绿 叼斤干 两会期间+隐瞒 毛二习 XDD 韦来书记 维稳警察（O） ChinaXi 维尼DISCO 总加速师 嬉包皮 皇帝亲临忠诚的武汉 Cicada##3301##XD 亲自考察 包包大人 习##卡##巴##卡 习语录 刁二将 维尼梗有害 狙击手布阵 大锅瞻遗 初二圣君 阿道夫-习 野心习 The##Xi##Factor（习近平因素） 无限连任 包惠帝 4中组长 乳制品 大撒幣 shit禁评 习大帝 包皇 骑巨龙 不强自息 习包子 刁人13 卡近菲 武汉委托李克强 智商不重要 习犬犬 习“甩锅” 独裁者 孢 习远凸 糖尿维尼 戏包皮 系包皮 吸精瓶 家业论 裹嘎举吸钢闸门 包子金刚腿 瘟疫降生习近平 黑白翠 红旗下的蛋 维尼快乐组织（Winnie##Happy##Organization）简称WHO 哲欣 “皇帝梦” 主席+终身制 蔡英文最强助选 十一郎习近平 庆丰帝的千秋梦 感恩教育 刁近猴 习王的田野上 宽衣帝 毛二世 大国造疫 最后领导人 背书单 食腐虫 200吨 五毛主席 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 甩锅侠 习三点 非洲大撒币 恩重如删 习武帝 慨撒大帝 习核心 刁二婚 修宪 官僚主义 A##Big##Deal 武当七侠的政治斗争 大兔 习壳郎 毛近平 维尼警察（X） “习泽东”和“洪宪”（袁世凯的帝号） XD 习正日 人尽皆知的体育迷 小学博士 孤独的毒王 Mr##Shithole 清零宗、清零帝 送礼平 墨索里习 习兵法 每日祈翠 断崖式下跌 近言 习思想 公车上书 学包率 耀眼黄红黄 玉习大帝 粪坑先生 坟头蹦迪 日子像蜜甜 末代皇帝 Heil##Xitler 北红尾鸲 读书单 720事件 包禁评 习背书 重地之战 颐指气使 梦帝 世界最强乞丐 virus##king 胡志平 习大林 亲自指挥 神明论 习老八 头上三尺有神明 民进党 尼哥 崇祯 吸包皮 野兽主席 皇帝梦 晚共昏君 习近砰 万岁 国王 相信有神论的物理学博士 习卒 习包子的Fa 皇帝亲临忠诚的武汉 习达姆 御板泽民 当代秦二世 bingbang帝 半羽习近平 甴近平 包经 习大乞 习奥塞斯库 动物之森 赵家家仆 包子露宪 口罩大会 刁槑夶尛 习屎黄 字共狗 习二蛋 维尼之声 毛进平 维尼带货 习一尊 中国离岸隐匿资产管理工作领导小组组组长 nmslman（习主席） 祈翠 狙击手待命 刁大犬 庆丰废物 刁斤二 武统时代 Criminal##Xi##"Xitler"##Jinping 满脸喷粪 毛魔转世 昆明湖涨潮 禁评大帝 亲自封号 倒车 连专家也为之叹服的电脑天才 总统包子习 人民领袖 黄俄 戏博士 */
package com.pcdd.sonovel.model;

import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/3/17
 */
@Data
public class Book {

    private String url;
    private String bookName;
    private String author;
    private String intro;
    private String category;
    private String coverUrl;
    private String latestChapter;
    private String lastUpdateTime;
    private String status;
    private String wordCount;

}