/* 倒车斯基 文明其精神 习远凸 皇帝梦 中字头组长 大海掀翻小池塘 阿平 儿童习典 习卒习 朝令夕改 腊肉馅儿包子 包帝巡游 XD 习夶 “习泽东”和“洪宪”（袁世凯的帝号） 小学居士 鞋哥 我是一个足球迷 独彩者 习是春竹 庆丰称帝 习梦思 东瘟疫之地统治者暨全境守护者 shit##hole##bing##fa 隔离”的金葫芦 习语 阳台上的哨兵 包子露宪 野兽先辈 习梦撕 习家军 青年大学包 九评 习博士 习躲躲 习皇帝 学包率 親自蒞臨 头上三尺有神明 刁后主 彩色熊 皇帝亲临忠诚的武汉 倒车帝 习病法 战疫国 错误执行者 尼哥 断崖式下跌 瘟疫降生习近平 云视察 习澳塞斯库 梦帝 nmslman（习主席） 2020全面小康 维尼·屎(Winnie##the##Poo) 坡涛汹涌 黄俄 親自視頻 刁斤山 赵家家仆 当皇帝的小丑 白猪 民进党 总书记来过我的家 赵王 秦城监狱 习三点 庆丰包·勃列日涅夫 习猪头 冤大头 核平全世界 蹄防 4中组长 平平 习大林 “复辟” shit禁评 维稳警察（O） 公车上书 习瘟猪 最后领导人 习习蛤蛤 习索里尼 支那毒王 SB包子 禁评大帝 宰相 纳翠党 叼斤干 Chairman##Xi 习是春绿 electron8964 恩重如删 无限连任 习犬犬 不同意的举手##没有##没有 习教父 Criminal##Xi##"Xitler"##Jinping 64岁 皇帝的新衣 nmslese##dream 两会期间+隐瞒 塔西佗陷阱 晚共昏君 厕所革命 号尿壶公 乳透社##小反旗 第22条军规 维尼梗有害 中国拉清单工作领导小组组长 发皇帝梦 习king 岿然不动 支那精神野爹 刁近猴 习条英机 食腐虫 武汉委托李克强 维尼熊给跳跳虎黄牌 贬词包用 劝进 修宪连任 黑白翠 习大郎 人民领袖 拉清单 慨撒大帝 赵付 shit侯 红二代 习正日 万岁 中国的新皇帝 动物森友会 颐指气使 野心习 习包子的Fa 北京中南海支部书记 野蛮其体魄 叩谢习恩 乳包文化 不知名氏 习卒 习宽衣 野兽主席 席近平 习包子 疯狂宇宙包 孤独的毒王 羽日帝 氼兲嫑炛 习包子 习流氓 习包子 包包侠 役民五术 动森 腊肉包 毛魔转世 包子兵法 习像章 读书单 国王 孙笑川 甩锅侠 万岁来武汉 习梦死 中国特色射秽煮疫制度 习张三丰 习蛤 Adolf##Xitler 刁人13 习王的田野上 V尼哥 包子病毒 xdd 习语录 新影帝 读稿机 北红尾鸲 亲自封号 习侯 战“疫”金句 叩谢习恩 那翠化 习猪下台 习厉王 习匪 习奥塞斯库 这个年很静 坡涛汹涌 习Core 习太孑 匪酋习维尼 太祖兔 彭主席（习主席走了太太接班） 習大佬 嬉包皮 720事件 屎禁评 Voice##of##Pooh 粪坑兵法 翡翠娘娘 恐惊天上人 维尼写史 糟糕皇帝 CoronaXi 习特勒 习总输记 修宪 大国造疫 亲自指挥 习殡法 习公奭 基拉大和习近平 小学博士 动物之森 人类命运共同体首席架构师 电脑世代586 世界最强乞丐 祈翠 没有网络安全就没有国家安全 维尼DISCO 习近砰 洗包皮 裸宽包子劾心 A##Big##Deal 初二圣君 习背书 彩色哥 玉习大帝 瘟疫领主习近平 刁近乎 中国爱非洲 扛麦郎 戴口赵 退党 称帝修宪 截颈平 习下台 席子兵法 二百五大帝 包禁评 裹嘎举吸钢闸门 撒币宝 习武帝 WHO的君王 满脸喷粪 维尼警察（X） 习大帝 包包大人 10号跳跳虎被维尼拉清单 中国首席造梦大师 猪禁评 习孢子 习“甩锅” 倒车 足球外交 刁二婚 傻大头 没规划的葬礼 习大 总统包子习 国贼习近平 习总 家业论 近日成 夶 “登机”（与登基同音） 冠子兵法 刁斤二 “黄袍加身” 假.."~bang！卒 号屎洞 维尼挂彩 字共狗 小习微信 巴拿马文件 疯狂宇宙 习狍 头号球迷 不敢高声语 习歪嘴 重地之战 习近平光辉形象 习贼 维尼带货 大撒幣 抗麦套装 习二世胡亥 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 爱新觉罗·近平 Corona##Xi（习病毒） 疫情蔓延 Mr##Shithole 惜包皮 武当七侠的政治斗争 习二卒 灭共助推器 墙内人 形式主义防疫 智商不重要 bingbang帝 XDD 相信有神论的物理学博士 恩维尔·霍习 习言乱语 主席+终身制 习老八 普近 庆丰废物 嘻包皮 维尼连任 刁大犬 连专家也为之叹服的电脑天才 喷粪帝 大撒币 习付 习二胖 毛二世 富平学霸刁斤干 乳制品 帝皇頌 毛近平 粪坑先生 集近闭 集金pay 大锅瞻遗 总书记来我家 Heil##Xitler 扛麦帝 枪毙名单 书单吟诵者 卡近菲 学包分子 官僚主义 十日文革 习得梁家书卷 指定接班人 大撒币 人民领袖 袭包皮 哲欣 包经 胡志平 迈克尔·索伊 386系统驱动游戏 昆明湖涨潮 习匪帝 天安门合法继承人 神明论 維尼頌 习一尊 讨习檄文 当代秦二世 习大犬 禁评的理由 习包皮 亲自考察 东方project 维尼快乐组织（Winnie##Happy##Organization）简称WHO 赛禁评 西朝鲜人民自治岛 清华毕业 包子金刚腿 系包皮 “无罩”现身 吸精瓶 世宗 包子宪法 坟头蹦迪 习兵法 维尼熊 悉包皮 《生物安全法》 习猪席 崇祯帝 vop 九大诉求 口罩大会 virus##king 大大品牌 大大招牌 背书单 维尼之声 习二蛋 阿道夫-习 学包积极分子 狙击手待命 洗尽贫 习尔布特 百万雄师事件 习##卡##巴##卡 庆丰帝的千秋梦 習敗北 习驴 shuu##kinn##pei 200吨 一天游泳一千米 习二坐船 花花公子 红旗下的蛋 游泳一千米 御板泽民 习思想 不强自息 普习金 第一书记王沪宁 刁人13 毛二习 邪大大 刁远山 喜包皮 视频看望 屎進瓶 影子末帝 赵人13 中国离岸隐匿资产管理工作领导小组组组长 “梦回大清” 央视姓党 刁槑夶尛 狙击手待命 吸包皮 骑巨龙 细瓶颈 维尼史 NMSL 捐麦子 外交习语 尊蛤讨包 做N届的主席 金科律玉 口罩外交 颐使气指 亲自脱贫 习三拍 近身平A 冰棒外交 清单帝 平&强 疯狂宇宙大帝 格萨尔 ChinaXi “皇帝梦” 习废帝 习进棺 人均接近八千万 孢 习达姆 日子像蜜甜 墨索里习 亲自指挥疫情 时间控制 追思焦裕禄 总加速师 沼气专家 添宪宝宝 武统时代 通商宽衣 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 维尼大帝 仲夏夜之中国梦 梁家河贵族 超邓赶毛 专治各种不服 送礼平 习屎黄 习和谐 习核心 吃赵弹 通商宽衣 刁二将 习式病毒 包皇 梦回大清 爱新觉罗近平 当代秦始皇 崇祯 包惠帝 你是反贼吗 毛进平 动物庄园 習敗敗 信女愿一生吃素 川普的朋友or敌人 每日祈翠 共哀宗 习呆呆 The##Xi##Factor（习近平因素） 糖尿维尼 终身领导人 领袖习澡水 法习斯 次级乳包 20000T麦子 亲自删评 闹得欢 韦来书记 现任匪首 习低能儿 戏包皮 近言 共哀宗 宽衣帝 习二二（二零二零年五月二十二日开二会） 冲塔 赵弹 习后主 平话 人民战争 戏博士 习时代 大兔 习奥赛斯库 毛装 中国离岸隐匿资产管理工作领导小组组组长 皇帝亲临忠诚的武汉 万岁来武汉了 感恩教育 维持会长 法外狂徒Lucy（德国） 蔡英文最强助选 任大炮 一带一路 Cicada##3301##XD 细颈瓶 任志强 毛二 五毛主席 习尿瓶 毛孙 人尽皆知的体育迷 十一郎习近平 䒒(tiáo)菦(qín)苹(píng) 独裁者 祈翠語言包 耀眼黄红黄 袁世凯第二 梁家河 禁评封号 主席贺词 “登基” 老歪脖子树 习大乞 半羽习近平 包大人 末代皇帝 老街 狙击手布阵 习禁评 灰习牛 集金币 屎侯 习皇的新装 习emperor */
package com.pcdd.sonovel.model;

import lombok.Builder;
import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/3/10
 */
@Data
@Builder
public class Chapter {

    private String url;
    private String title;
    private String content;
    private Integer order;

}