/* 共哀宗 近日成 近言 共哀宗 食腐虫 习驴 红旗下的蛋 家业论 习呆呆 习猪席 蔡英文最强助选 刁人13 习贼 阿道夫-习 二百五大帝 五毛主席 抗麦套装 总加速师 小习微信 “无罩”现身 习包子 修宪帝 2020全面小康 毛魔转世 连专家也为之叹服的电脑天才 韦来书记 读书单 视频看望 指定接班人 扛麦郎 黑白翠 大撒幣 习废帝 叩谢习恩 習敗北 Mr##Shithole 狙击手布阵 官僚主义 昆明湖涨潮 赵人13 习孢子 当皇帝的小丑 中国爱非洲 习大林 习进棺 习博士 梦回大清 我是一个足球迷 720事件 两会期间+隐瞒 战疫国 包惠帝 格萨尔 维尼带货 “登基” 神明论 Corona##Xi（习病毒） 送礼平 Voice##of##Pooh 哲欣 乳透社##小反旗 彭主席（习主席走了太太接班） 亲自脱贫 鞋哥 号尿壶公 毛二世 通商宽衣 武统时代 大大招牌 卡近菲 悉包皮 习时代 习二二（二零二零年五月二十二日开二会） 中国离岸隐匿资产管理工作领导小组组组长 vop 野心习 xdd 足球外交 不知名氏 细瓶颈 宽衣大帝 学包率 戏包皮 集近闭 西朝鲜人民自治岛 习索里尼 平&强 习梦撕 白猪 九评 习武帝 退党 耀眼黄红黄 阳台上的哨兵 习病法 那翠化 禁评大帝 平话 親自蒞臨 恐惊天上人 习猪下台 习近砰 刁二将 维尼·屎(Winnie##the##Poo) 习“甩锅” 二百斤 支那精神野爹 亲自指挥疫情 每日祈翠 吃赵弹 包帝巡游 习是春绿 嘻包皮 倒车帝 䒒(tiáo)菦(qín)苹(píng) 总统包子习 习核心 中国拉清单工作领导小组组长 北红尾鸲 毛进平 shit##hole##bing##fa 庆丰废物 梦帝 习匪帝 游泳一千米 习包皮 习大犬 习像章 仲夏夜之中国梦 SB包子 习厉王 坟头蹦迪 通商宽衣 中国首席造梦大师 习侯 禁评的理由 親自視頻 修宪 晚共昏君 秦城监狱 任志强 习宽衣 普习金 “皇帝梦” 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 战“疫”金句 维尼熊给跳跳虎黄牌 庆丰包·勃列日涅夫 半羽习近平 习梦思 维尼挂彩 习三点 赵弹 形式主义防疫 nmslman（习主席） 习尽贫 席子兵法 electron8964 核平全世界 富平学霸刁斤干 中国的新皇帝 20000T麦子 毛二 粪坑兵法 习付 川普的朋友or敌人 习王的田野上 清华毕业 习Core 主席+终身制 集金pay Criminal##Xi##"Xitler"##Jinping 枪毙名单 习家军 shit侯 维尼之声 书单吟诵者 习兵法 386系统驱动游戏 匪酋习维尼 瘟疫降生习近平 习##卡##巴##卡 CoronaXi 禁评封号 学包积极分子 学包分子 平平 疯狂宇宙大帝 喷粪帝 WHO的君王 习king 信女愿一生吃素 总书记来过我的家 世界最强乞丐 彩色哥 末代皇帝 《生物安全法》 甴近平 彩色熊 国王 羽日帝 动森 坡涛汹涌 感恩教育 ChinaXi 老街 花花公子 瘟疫领主习近平 百万雄师事件 包大人 尼哥 骑巨龙 10号跳跳虎被维尼拉清单 习背书 习包子 习近平光辉形象 大海掀翻小池塘 习奥赛斯库 任大炮 习总 御板泽民 包子宪法 “登机”（与登基同音） 野蛮其体魄 包子病毒 崇祯 习emperor 劝进 吸包皮 不同意的举手##没有##没有 倒车 习二世胡亥 邪大大 大国造疫 野兽主席 口罩大会 系包皮 毛装 清单帝 发皇帝梦 二次袁、袁世凯二世、袁二 东方project 习梦死 习一尊 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 习禁评 习张三丰 习流氓 外交习语 习是春竹 习卒 假.."~bang！卒 断崖式下跌 virus##king 没有网络安全就没有国家安全 shuu##kinn##pei 习皇帝 习后主 bingbang帝 习得梁家书卷 习条英机 蹄防 萨格尔王 大兔 背书单 爱新觉罗·近平 崇祯帝 NMSL 大大品牌 孤独的毒王 塔西佗陷阱 习卒习 清零宗、清零帝 老歪脖子树 维尼DISCO 隔离”的金葫芦 十日文革 法外狂徒Lucy（德国） 习下台 终身领导人 次级乳包 口罩外交 習敗敗 維尼頌 习和谐 习匪 墙内人 包包侠 戏博士 相信有神论的物理学博士 习教父 习屎黄 宽衣帝 刁近乎 吸精瓶 习皇的新装 爱新觉罗近平 第一书记王沪宁 Cicada##3301##XD 刁近猴 狙击手待命 不敢高声语 国贼习近平 习公奭 习曱甴 民进党 法习斯 初二圣君 刁斤二 坡涛汹涌 厕所革命 十一郎习近平 动物庄园 袭包皮 你是反贼吗 天安门合法继承人 朝令夕改 4中组长 洗包皮 习老八 习特勒 席近平 冤大头 皇帝亲临忠诚的武汉 习大 包皇 习壳郎 贬词包用 习歪嘴 64岁 红二代 屎侯 庆丰称帝 庆丰帝的千秋梦 糟糕皇帝 黄俄 讨习檄文 超邓赶毛 赛禁评 十里山路不换肩 “梦回大清” 不强自息 刁斤山 小学居士 修宪连任 智商不重要 现任匪首 乳包文化 武汉委托李克强 没规划的葬礼 公车上书 粪坑先生 灭共助推器 屎進瓶 亲自删评 腊肉馅儿包子 头号球迷 玉习大帝 习语录 习蛤 影子末帝 亲自考察 毛二习 毛泽东2.0 维尼写史 习澳塞斯库 Adolf##Xitler 习二胖 野兽先辈 维尼梗有害 满脸喷粪 人尽皆知的体育迷 维持会长 nmslese##dream 维尼大帝 动物森友会 独裁者 喜包皮 Heil##Xitler 金科律玉 中国特色射秽煮疫制度 大锅瞻遗 习殡法 总书记来我家 刁槑夶尛 习大乞 头上三尺有神明 翡翠娘娘 支那毒王 维稳警察（O） 乳制品 习尔布特 读稿机 人民领袖 人民领袖 小学博士 习思想 裸宽包子劾心 XDD 屎禁评 日子像蜜甜 役民五术 包包大人 号屎洞 习猪头 追思焦裕禄 惜包皮 基拉大和习近平 宰相 习二坐船 习狍 世宗 猪禁评 维尼警察（X） 习三拍 习大郎 甩锅侠 氼兲嫑炛 刁远山 万岁来武汉了 习远凸 近身平A 巴拿马文件 细颈瓶 洗尽贫 “复辟” 独彩者 习奥塞斯库、齐奥塞斯库 “习泽东”和“洪宪”（袁世凯的帝号） 习二卒 迈克尔·索伊 时间控制 拉清单 习犬犬 万岁 习夶 动物之森 当代秦始皇 无限连任 孢 东瘟疫之地统治者暨全境守护者 习言乱语 皇帝亲临忠诚的武汉 包经 亲自指挥 集金币 冠子兵法 这个年很静 嬉包皮 纳翠党 恩维尔·霍习 文明其精神 习包子的Fa 维尼熊 新影帝 灰习牛 中字头组长 一带一路 九大诉求 重地之战 专治各种不服 当代秦二世 刁二婚 捐麦子 习大帝 截颈平 祈翠 习奥塞斯库 颐指气使 央视姓党 闹得欢 颐使气指 独裁国贼 V尼哥 扛麦帝 皇帝梦 慨撒大帝 儿童习典 亲自封号 裹嘎举吸钢闸门 电脑世代586 非洲大撒币 云视察 恩重如删 维尼快乐组织（Winnie##Happy##Organization）简称WHO 赵家家仆 习太孑 字共狗 包禁评 祈翠語言包 习尿瓶 皇帝的新衣 阿平 墨索里习 添宪宝宝 做N届的主席 習大佬 包子金刚腿 倒车斯基 称帝修宪 习包子 习瘟猪 The##Xi##Factor（习近平因素） 毛孙 毛近平 戴口赵 武当七侠的政治斗争 尊蛤讨包 习躲躲 人均接近八千万 刁人13 疯狂宇宙 人类命运共同体首席架构师 领袖习澡水 赵王 撒币宝 最后领导人 腊肉包 中国离岸隐匿资产管理工作领导小组组组长 疯狂宇宙包 刁大犬 孙笑川 冲塔 夶 赵付 太祖兔 沼气专家 shit禁评 第22条军规 狙击手待命 习总输记 人民战争 A##Big##Deal 梁家河 一天游泳一千米 错误执行者 习二蛋 青年大学包 主席贺词 刁后主 大撒币 冰棒外交 维尼史 包子露宪 XD Chairman##Xi 傻大头 叩谢习恩 叼斤干 疫情蔓延 帝皇頌 维尼连任 普近 习式病毒 200吨 甴种 梁家河贵族 包子兵法 袁世凯第二 “黄袍加身” 习低能儿 习习蛤蛤 习达姆 胡志平 习语 糖尿维尼 万岁来武汉 习正日 北京中南海支部书记 岿然不动 */
package com.pcdd.sonovel.model;

import lombok.Builder;
import lombok.Data;

/**
 * @author pcdd
 * Created at 2024/3/10
 */
@Data
@Builder
public class Chapter {

    private String url;
    private String title;
    private String content;
    private Integer order;

}