/* 大兔 食腐虫 386系统驱动游戏 恐惊天上人 毛近平 习夶 皇帝亲临忠诚的武汉 庆丰废物 二次袁、袁世凯二世、袁二 Mr##Shithole 红二代 蔡英文最强助选 习下台 二百五大帝 口罩外交 集金pay 吃赵弹 捐麦子 氼兲嫑炛 Voice##of##Pooh 乳制品 万岁 我是一个足球迷 扛麦郎 帝皇頌 倒车斯基 人民领袖 截颈平 习是春竹 九大诉求 维尼写史 小习微信 发皇帝梦 武当七侠的政治斗争 洗包皮 核平全世界 习瘟猪 修宪连任 初二圣君 “梦回大清” 习近砰 共哀宗 习“甩锅” 细瓶颈 耀眼黄红黄 习匪帝 习太孑 当代秦二世 骑巨龙 信女愿一生吃素 中国拉清单工作领导小组组长 包禁评 习时代 人类命运共同体首席架构师 习梦思 平&强 基拉大和习近平 口罩大会 灭共助推器 胡志平 习驴 劝进 吸精瓶 冰棒外交 儿童习典 野兽先辈 战疫国 爱新觉罗·近平 毛二 赵家家仆 甴近平 平平 习语 习是春绿 SB包子 北京中南海支部书记 川普的朋友or敌人 習敗北 维尼熊给跳跳虎黄牌 禁评的理由 习包子 民进党 外交习语 阳台上的哨兵 现任匪首 指定接班人 习皇的新装 NMSL 添宪宝宝 Cicada##3301##XD 习大犬 习卒习 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 毛二世 国王 动物森友会 贬词包用 形式主义防疫 韦来书记 玉习大帝 习后主 秦城监狱 包子病毒 习包皮 塔西佗陷阱 不知名氏 中国首席造梦大师 役民五术 习博士 不同意的举手##没有##没有 习殡法 东方project 梦帝 赵王 毛泽东2.0 东瘟疫之地统治者暨全境守护者 皇帝亲临忠诚的武汉 瘟疫领主习近平 日子像蜜甜 近身平A 视频看望 总统包子习 细颈瓶 习条英机 习一尊 万岁来武汉 习总 巴拿马文件 世宗 shit侯 习得梁家书卷 家业论 足球外交 阿道夫-习 习近平光辉形象 习躲躲 袭包皮 狙击手布阵 动森 字共狗 毛魔转世 亲自脱贫 法外狂徒Lucy（德国） 20000T麦子 刁斤山 习Core 刁二将 习武帝 喜包皮 墙内人 瘟疫降生习近平 习思想 十里山路不换肩 习蛤 学包分子 大国造疫 粪坑先生 shit禁评 颐指气使 Criminal##Xi##"Xitler"##Jinping 包包侠 戴口赵 尊蛤讨包 重地之战 习呆呆 没有网络安全就没有国家安全 维尼·屎(Winnie##the##Poo) 毛孙 老街 习奥塞斯库 枪毙名单 维尼DISCO 冠子兵法 习屎黄 Chairman##Xi 包惠帝 XD 武汉委托李克强 崇祯帝 任志强 当代秦始皇 shuu##kinn##pei 赵人13 修宪 10号跳跳虎被维尼拉清单 洗尽贫 “无罩”现身 墨索里习 每日祈翠 疯狂宇宙 半羽习近平 梁家河 习正日 习尽贫 号屎洞 动物之森 共哀宗 撒币宝 习匪 最后领导人 XDD 悉包皮 维稳警察（O） 人民战争 人尽皆知的体育迷 习大郎 黄俄 赵付 头号球迷 习大 electron8964 集近闭 中国离岸隐匿资产管理工作领导小组组组长 叩谢习恩 梦回大清 赛禁评 疫情蔓延 “登机”（与登基同音） 习犬犬 平话 灰习牛 羽日帝 动物庄园 小学居士 慨撒大帝 刁人13 彩色哥 亲自考察 习兵法 维尼大帝 不敢高声语 这个年很静 习二世胡亥 独裁者 习大乞 西朝鲜人民自治岛 习进棺 集金币 维尼熊 习皇帝 維尼頌 习公奭 席近平 傻大头 系包皮 习孢子 近言 主席贺词 普习金 满脸喷粪 青年大学包 习卒 御板泽民 赵弹 断崖式下跌 萨格尔王 独裁国贼 腊肉包 习梦撕 习奥赛斯库 仲夏夜之中国梦 习二卒 岿然不动 亲自指挥疫情 邪大大 翡翠娘娘 吸包皮 疯狂宇宙大帝 野兽主席 习病法 人民领袖 亲自指挥 独彩者 错误执行者 普近 阿平 皇帝的新衣 沼气专家 宰相 习特勒 国贼习近平 祈翠語言包 梁家河贵族 糖尿维尼 没规划的葬礼 花花公子 刁槑夶尛 大大招牌 䒒(tiáo)菦(qín)苹(píng) 庆丰称帝 Corona##Xi（习病毒） 亲自封号 号尿壶公 第22条军规 大大品牌 称帝修宪 包帝巡游 格萨尔 刁斤二 习总输记 通商宽衣 昆明湖涨潮 nmslese##dream 习包子 公车上书 二百斤 央视姓党 习梦死 人均接近八千万 习曱甴 刁人13 庆丰包·勃列日涅夫 颐使气指 中国的新皇帝 刁近猴 习付 甩锅侠 总加速师 近日成 孢 智商不重要 尼哥 狙击手待命 200吨 中国爱非洲 野心习 闹得欢 包皇 百万雄师事件 清单帝 64岁 夶 世界最强乞丐 袁世凯第二 The##Xi##Factor（习近平因素） xdd 惜包皮 习贼 习索里尼 CoronaXi 屎侯 十一郎习近平 习壳郎 崇祯 习教父 任大炮 天安门合法继承人 习二坐船 孤独的毒王 野蛮其体魄 中字头组长 维尼警察（X） 孙笑川 习猪下台 追思焦裕禄 两会期间+隐瞒 哲欣 习禁评 影子末帝 隔离”的金葫芦 彩色熊 太祖兔 习二胖 狙击手待命 腊肉馅儿包子 维尼梗有害 抗麦套装 维尼快乐组织（Winnie##Happy##Organization）简称WHO 超邓赶毛 非洲大撒币 总书记来我家 读书单 时间控制 退党 猪禁评 维尼之声 皇帝梦 迈克尔·索伊 习尿瓶 包子兵法 习二二（二零二零年五月二十二日开二会） 次级乳包 亲自删评 讨习檄文 包大人 朝令夕改 读稿机 清零宗、清零帝 毛进平 匪酋习维尼 倒车帝 大海掀翻小池塘 支那精神野爹 V尼哥 无限连任 蹄防 親自蒞臨 冲塔 裹嘎举吸钢闸门 一天游泳一千米 维尼带货 戏博士 习包子 坟头蹦迪 习猪席 毛二习 “黄袍加身” 習大佬 刁二婚 小学博士 720事件 糟糕皇帝 中国特色射秽煮疫制度 大撒币 习厉王 嘻包皮 游泳一千米 shit##hole##bing##fa 学包率 晚共昏君 乳包文化 屎進瓶 喷粪帝 习歪嘴 禁评大帝 习澳塞斯库 背书单 习王的田野上 富平学霸刁斤干 屎禁评 爱新觉罗近平 大锅瞻遗 宽衣大帝 通商宽衣 Heil##Xitler 包子宪法 习张三丰 中国离岸隐匿资产管理工作领导小组组组长 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 厕所革命 裸宽包子劾心 卡近菲 疯狂宇宙包 金科律玉 bingbang帝 扛麦帝 习式病毒 白猪 习king 刁大犬 “习泽东”和“洪宪”（袁世凯的帝号） 专治各种不服 习包子的Fa 十日文革 习言乱语 习习蛤蛤 送礼平 不强自息 习家军 当皇帝的小丑 习低能儿 做N届的主席 习达姆 维持会长 黑白翠 vop 习##卡##巴##卡 老歪脖子树 嬉包皮 习猪头 习老八 新影帝 坡涛汹涌 乳透社##小反旗 习emperor 親自視頻 刁远山 维尼史 第一书记王沪宁 文明其精神 主席+终身制 习背书 习大帝 书单吟诵者 包包大人 万岁来武汉了 你是反贼吗 清华毕业 末代皇帝 庆丰帝的千秋梦 习三点 终身领导人 ChinaXi 法习斯 习废帝 习大林 头上三尺有神明 坡涛汹涌 WHO的君王 相信有神论的物理学博士 恩重如删 习和谐 習敗敗 习三拍 4中组长 那翠化 大撒幣 习宽衣 包子金刚腿 一带一路 祈翠 恩维尔·霍习 粪坑兵法 《生物安全法》 维尼挂彩 五毛主席 领袖习澡水 nmslman（习主席） 拉清单 Adolf##Xitler 习语录 刁后主 习核心 习狍 习尔布特 习侯 甴种 叩谢习恩 刁近乎 战“疫”金句 习远凸 习像章 “登基” 纳翠党 毛装 习奥塞斯库、齐奥塞斯库 习二蛋 virus##king 包经 冤大头 假.."~bang！卒 叼斤干 禁评封号 修宪帝 A##Big##Deal 习流氓 武统时代 戏包皮 “复辟” 彭主席（习主席走了太太接班） 感恩教育 学包积极分子 维尼连任 连专家也为之叹服的电脑天才 官僚主义 席子兵法 支那毒王 电脑世代586 “皇帝梦” 鞋哥 宽衣帝 云视察 北红尾鸲 九评 2020全面小康 神明论 倒车 总书记来过我的家 红旗下的蛋 包子露宪 */
package com.pcdd.sonovel.model;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @author pcdd
 * Created at 2025/2/5
 */
@Getter
@AllArgsConstructor
public enum ContentType {

    TEXT("text"),
    HTML("html"),
    ATTR_SRC("src"),
    ATTR_HREF("href"),
    ATTR_CONTENT("content"),
    ATTR_VALUE("value"),
    ;

    private final String value;

}