/* 阿道夫-习 近言 国王 坡涛汹涌 毛二世 386系统驱动游戏 号尿壶公 毛魔转世 200吨 “习泽东”和“洪宪”（袁世凯的帝号） 形式主义防疫 一带一路 “梦回大清” 蹄防 疯狂宇宙大帝 维尼警察（X） 退党 习二卒 习包皮 当代秦始皇 毛进平 亲自删评 小学博士 十日文革 习语 A##Big##Deal 戴口赵 親自蒞臨 颐使气指 二百五大帝 习太孑 大大招牌 动物庄园 总统包子习 不敢高声语 赛禁评 习大乞 老歪脖子树 骑巨龙 学包率 背书单 维稳警察（O） 北京中南海支部书记 家业论 恐惊天上人 親自視頻 习二蛋 shit侯 electron8964 法外狂徒Lucy（德国） 超邓赶毛 韦来书记 席近平 习奥塞斯库 刁二将 习思想 亲自考察 “登机”（与登基同音） 习像章 坟头蹦迪 习三拍 不知名氏 号屎洞 百万雄师事件 太祖兔 习下台 五毛主席 习卒习 乳制品 习大郎 相信有神论的物理学博士 腊肉馅儿包子 中字头组长 习大帝 Voice##of##Pooh 叩谢习恩 贬词包用 任志强 电脑世代586 20000T麦子 维尼熊 晚共昏君 习近砰 shit##hole##bing##fa 庆丰帝的千秋梦 包子兵法 粪坑兵法 爱新觉罗·近平 岿然不动 野蛮其体魄 主席贺词 习猪席 彭主席（习主席走了太太接班） 沼气专家 冰棒外交 当代秦二世 小学居士 初二圣君 XD 习尿瓶 席子兵法 2020全面小康 Corona##Xi（习病毒） 巴拿马文件 万岁来武汉 役民五术 屎進瓶 习卒 习习蛤蛤 邪大大 习二二（二零二零年五月二十二日开二会） 习Core 富平学霸刁斤干 细颈瓶 半羽习近平 黄俄 洗尽贫 习躲躲 糖尿维尼 包帝巡游 习包子 悉包皮 习包子 皇帝亲临忠诚的武汉 最后领导人 影子末帝 央视姓党 头上三尺有神明 没规划的葬礼 习言乱语 疯狂宇宙包 动物之森 刁大犬 学包分子 virus##king 习包子的Fa 共哀宗 追思焦裕禄 狙击手布阵 习得梁家书卷 两会期间+隐瞒 通商宽衣 Heil##Xitler 国贼习近平 梦回大清 习背书 人民领袖 孤独的毒王 战疫国 刁远山 假.."~bang！卒 毛孙 刁二婚 蔡英文最强助选 习二胖 普习金 大锅瞻遗 冤大头 习宽衣 云视察 皇帝梦 习教父 Criminal##Xi##"Xitler"##Jinping 刁近乎 习大犬 “登基” V尼哥 民进党 习付 日子像蜜甜 习武帝 纳翠党 習敗敗 劝进 武统时代 刁后主 喷粪帝 专治各种不服 人类命运共同体首席架构师 第一书记王沪宁 狙击手待命 疯狂宇宙 近身平A 人民领袖 翡翠娘娘 禁评大帝 爱新觉罗近平 野兽先辈 总书记来过我的家 64岁 神明论 Chairman##Xi 战“疫”金句 彩色哥 添宪宝宝 修宪 倒车帝 抗麦套装 习时代 毛二 NMSL 中国爱非洲 习梦撕 御板泽民 XDD 瘟疫领主习近平 中国拉清单工作领导小组组长 修宪连任 刁人13 终身领导人 包禁评 吃赵弹 集金币 总书记来我家 共哀宗 拉清单 主席+终身制 学包积极分子 次级乳包 你是反贼吗 习狍 习大 皇帝亲临忠诚的武汉 习流氓 习式病毒 重地之战 猪禁评 习皇的新装 总加速师 包子金刚腿 口罩大会 习驴 叼斤干 黑白翠 包子露宪 洗包皮 人民战争 阿平 維尼頌 帝皇頌 恩重如删 读书单 智商不重要 人均接近八千万 白猪 糟糕皇帝 习殡法 视频看望 禁评的理由 捐麦子 包皇 每日祈翠 独彩者 仲夏夜之中国梦 维尼史 匪酋习维尼 习是春绿 刁人13 扛麦帝 维尼·屎(Winnie##the##Poo) 习张三丰 普近 习达姆 东瘟疫之地统治者暨全境守护者 小习微信 武当七侠的政治斗争 习梦思 错误执行者 袭包皮 喜包皮 shuu##kinn##pei 赵付 狙击手待命 “复辟” 习##卡##巴##卡 习正日 习特勒 习索里尼 大海掀翻小池塘 昆明湖涨潮 WHO的君王 nmslese##dream 习猪下台 天安门合法继承人 崇祯帝 Mr##Shithole 通商宽衣 乳透社##小反旗 人尽皆知的体育迷 毛近平 习二坐船 武汉委托李克强 川普的朋友or敌人 ChinaXi The##Xi##Factor（习近平因素） shit禁评 西朝鲜人民自治岛 亲自封号 习二世胡亥 刁近猴 红旗下的蛋 塔西佗陷阱 庆丰废物 大撒币 皇帝的新衣 包大人 xdd 撒币宝 玉习大帝 bingbang帝 10号跳跳虎被维尼拉清单 哲欣 习总 习禁评 习侯 任大炮 赵人13 基拉大和习近平 习兵法 习公奭 习后主 大兔 毛装 刁槑夶尛 隔离”的金葫芦 习皇帝 头号球迷 中国特色射秽煮疫制度 包子宪法 习病法 习尔布特 称帝修宪 粪坑先生 发皇帝梦 吸精瓶 彩色熊 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 nmslman（习主席） 北红尾鸲 做N届的主席 倒车斯基 习家军 梦帝 扛麦郎 游泳一千米 戏博士 中国离岸隐匿资产管理工作领导小组组组长 倒车 包经 冲塔 维尼挂彩 儿童习典 独裁者 包包大人 野兽主席 维尼连任 尼哥 习近平光辉形象 断崖式下跌 习猪头 没有网络安全就没有国家安全 中国首席造梦大师 习是春竹 老街 维尼熊给跳跳虎黄牌 习king 颐指气使 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 甩锅侠 卡近菲 孙笑川 墙内人 阳台上的哨兵 习包子 习总输记 赵王 满脸喷粪 赵弹 毛二习 䒒(tiáo)菦(qín)苹(píng) 氼兲嫑炛 第22条军规 SB包子 枪毙名单 大国造疫 世界最强乞丐 一天游泳一千米 九评 习条英机 习和谐 4中组长 习瘟猪 亲自指挥疫情 感恩教育 尊蛤讨包 习大林 法习斯 口罩外交 维尼之声 習大佬 当皇帝的小丑 不强自息 足球外交 闹得欢 读稿机 支那精神野爹 惜包皮 金科律玉 细瓶颈 无限连任 秦城监狱 中国离岸隐匿资产管理工作领导小组组组长 Cicada##3301##XD 送礼平 宰相 包子病毒 维尼大帝 万岁来武汉了 截颈平 习进棺 外交习语 末代皇帝 习语录 裹嘎举吸钢闸门 亲自指挥 Adolf##Xitler 嬉包皮 傻大头 裸宽包子劾心 袁世凯第二 祈翠 梁家河贵族 疫情蔓延 祈翠語言包 习贼 习孢子 习歪嘴 赵家家仆 恩维尔·霍习 维尼写史 习犬犬 習敗北 九大诉求 书单吟诵者 习王的田野上 戏包皮 “无罩”现身 习匪 孢 胡志平 720事件 这个年很静 庆丰称帝 禁评封号 习老八 集金pay 迈克尔·索伊 习厉王 灰习牛 东方project 维尼快乐组织（Winnie##Happy##Organization）简称WHO 慨撒大帝 近日成 指定接班人 习核心 维尼梗有害 鞋哥 庆丰包·勃列日涅夫 花花公子 平平 青年大学包 我是一个足球迷 连专家也为之叹服的电脑天才 厕所革命 叩谢习恩 墨索里习 清单帝 文明其精神 不同意的举手##没有##没有 习一尊 亲自脱贫 “黄袍加身” 动森 新影帝 世宗 系包皮 那翠化 vop 维尼带货 夶 嘻包皮 十一郎习近平 《生物安全法》 集近闭 腊肉包 吸包皮 字共狗 食腐虫 时间控制 朝令夕改 大撒币 领袖习澡水 习蛤 官僚主义 万岁 大撒幣 包包侠 红二代 习澳塞斯库 耀眼黄红黄 习三点 习夶 习“甩锅” 动物森友会 讨习檄文 灭共助推器 信女愿一生吃素 屎禁评 羽日帝 习低能儿 乳包文化 维尼DISCO 习匪帝 冠子兵法 中国的新皇帝 梁家河 习博士 支那毒王 崇祯 习呆呆 “皇帝梦” 屎侯 习emperor 宽衣帝 习奥赛斯库 坡涛汹涌 平&强 核平全世界 大大品牌 公车上书 刁斤二 格萨尔 现任匪首 习废帝 包惠帝 清华毕业 习远凸 习屎黄 CoronaXi 野心习 瘟疫降生习近平 习梦死 维持会长 平话 刁斤山 */
package com.pcdd.sonovel.model;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @author pcdd
 * Created at 2025/2/5
 */
@Getter
@AllArgsConstructor
public enum ContentType {

    TEXT("text"),
    HTML("html"),
    ATTR_SRC("src"),
    ATTR_HREF("href"),
    ATTR_CONTENT("content");

    private final String value;

}