/* 儿童习典 习尔布特 习孢子 大大品牌 太祖兔 习犬犬 格萨尔 花花公子 恩维尔·霍习 送礼平 冲塔 习语 习和谐 不敢高声语 小习微信 ChinaXi 刁二婚 西朝鲜人民自治岛 Criminal##Xi##"Xitler"##Jinping 习奥赛斯库 赛禁评 连专家也为之叹服的电脑天才 官僚主义 支那毒王 游泳一千米 习大乞 时间控制 足球外交 刁近乎 习公奭 习贼 禁评大帝 习夶 习索里尼 普近 习太孑 十日文革 平&强 口罩大会 日子像蜜甜 北京中南海支部书记 习核心 形式主义防疫 “习泽东”和“洪宪”（袁世凯的帝号） 主席+终身制 乳透社##小反旗 shit##hole##bing##fa 恐惊天上人 扛麦郎 习##卡##巴##卡 SB包子 阳台上的哨兵 阿道夫-习 冤大头 毛魔转世 习像章 瘟疫降生习近平 习总 屎侯 刁斤山 彩色熊 习近平光辉形象 习得梁家书卷 屎禁评 信女愿一生吃素 十一郎习近平 习尿瓶 邪大大 习进棺 错误执行者 坡涛汹涌 习二二（二零二零年五月二十二日开二会） 习后主 黄俄 习猪下台 世宗 习二蛋 视频看望 你是反贼吗 习达姆 维尼大帝 野兽主席 嘻包皮 Voice##of##Pooh 维尼连任 当代秦始皇 亲自删评 国王 隔离”的金葫芦 最后领导人 “黄袍加身” 发皇帝梦 习大林 追思焦裕禄 包子金刚腿 中国离岸隐匿资产管理工作领导小组组组长 “梦回大清” 刁近猴 习卒习 10号跳跳虎被维尼拉清单 疫情蔓延 大兔 金科律玉 习正日 民进党 包惠帝 Corona##Xi（习病毒） 字共狗 毛二 我是一个足球迷 親自蒞臨 维稳警察（O） 维尼史 一带一路 戏包皮 清单帝 尊蛤讨包 总加速师 不强自息 糟糕皇帝 五毛主席 夶 集金币 总书记来我家 主席贺词 电脑世代586 习条英机 庆丰废物 维尼熊 颐指气使 习老八 学包分子 平话 重地之战 人均接近八千万 习二世胡亥 袁世凯第二 基拉大和习近平 赵家家仆 维尼挂彩 习躲躲 习武帝 坟头蹦迪 习梦思 习猪头 习二胖 北红尾鸲 习禁评 东瘟疫之地统治者暨全境守护者 习习蛤蛤 崇祯帝 亲自脱贫 xdd 习呆呆 bingbang帝 号屎洞 习驴 老歪脖子树 叩谢习恩 刁大犬 庆丰称帝 武统时代 耀眼黄红黄 宰相 现任匪首 洗尽贫 WHO的君王 腊肉馅儿包子 席子兵法 习歪嘴 背书单 习是春绿 倒车 相信有神论的物理学博士 帝皇頌 包包大人 野蛮其体魄 捐麦子 厕所革命 乳制品 XD 智商不重要 疯狂宇宙 一天游泳一千米 近身平A 习家军 惜包皮 2020全面小康 人民领袖 习包子 枪毙名单 习低能儿 戴口赵 瘟疫领主习近平 习瘟猪 喷粪帝 维尼之声 袭包皮 集金pay 匪酋习维尼 包子病毒 甩锅侠 指定接班人 万岁来武汉 食腐虫 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ 超邓赶毛 刁槑夶尛 Chairman##Xi 习宽衣 维尼快乐组织（Winnie##Happy##Organization）简称WHO 共哀宗 维尼警察（X） 毛近平 维尼写史 习时代 细颈瓶 老街 氼兲嫑炛 shit侯 二百五大帝 恩重如删 退党 赵付 习思想 粪坑兵法 梁家河贵族 集近闭 亲自封号 万岁来武汉了 习卒 胡志平 中国拉清单工作领导小组组长 习下台 维尼带货 习蛤 青年大学包 习二坐船 梦回大清 刁斤二 每日祈翠 刁后主 刁远山 包经 Mr##Shithole “登机”（与登基同音） 习梦死 武汉委托李克强 冰棒外交 维持会长 皇帝梦 习背书 羽日帝 次级乳包 富平学霸刁斤干 玉习大帝 做N届的主席 中国离岸隐匿资产管理工作领导小组组组长 亲自考察 V尼哥 亲自指挥疫情 国贼习近平 皇帝的新衣 悉包皮 The##Xi##Factor（习近平因素） 扛麦帝 任志强 人民领袖 讨习檄文 大撒幣 战“疫”金句 嬉包皮 这个年很静 习匪 法外狂徒Lucy（德国） 习言乱语 習敗敗 不同意的举手##没有##没有 没规划的葬礼 CoronaXi 支那精神野爹 习大犬 毛进平 习狍 九评 阿平 共哀宗 学包率 东方project 喜包皮 动物之森 shuu##kinn##pei 秦城监狱 习教父 世界最强乞丐 野心习 刁人13 撒币宝 仲夏夜之中国梦 卡近菲 吸精瓶 役民五术 颐使气指 添宪宝宝 川普的朋友or敌人 “复辟” 塔西佗陷阱 慨撒大帝 彭主席（习主席走了太太接班） 第22条军规 任大炮 核平全世界 神明论 席近平 疯狂宇宙大帝 平平 人类命运共同体首席架构师 习匪帝 赵王 疯狂宇宙包 20000T麦子 九大诉求 皇帝亲临忠诚的武汉 屎進瓶 人尽皆知的体育迷 “无罩”现身 vop 习emperor 修宪连任 御板泽民 红二代 200吨 骑巨龙 满脸喷粪 維尼頌 习特勒 習大佬 习侯 䒒(tiáo)菦(qín)苹(píng) 习奥塞斯库 翡翠娘娘 毛孙 赵弹 感恩教育 大海掀翻小池塘 习总输记 virus##king 央视姓党 大撒币 毛装 细瓶颈 A##Big##Deal 赵人13 半羽习近平 维尼DISCO 两会期间+隐瞒 包禁评 习大帝 维尼·屎(Winnie##the##Poo) 习皇帝 抗麦套装 习远凸 战疫国 近言 维尼熊给跳跳虎黄牌 朝令夕改 贬词包用 闹得欢 百万雄师事件 习付 系包皮 吃赵弹 中国首席造梦大师 读稿机 影子末帝 大大招牌 习病法 习式病毒 不知名氏 习包子的Fa 习张三丰 親自視頻 习三拍 纳翠党 新影帝 法习斯 假.."~bang！卒 专治各种不服 裸宽包子劾心 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 中国爱非洲 宽衣帝 崇祯 习近砰 读书单 小学居士 书单吟诵者 nmslman（习主席） 白猪 总统包子习 习兵法 狙击手待命 戏博士 近日成 号尿壶公 “皇帝梦” 腊肉包 习澳塞斯库 拉清单 坡涛汹涌 外交习语 吸包皮 头号球迷 毛二世 XDD 中国的新皇帝 祈翠 维尼梗有害 动森 叩谢习恩 武当七侠的政治斗争 昆明湖涨潮 总书记来过我的家 孙笑川 Heil##Xitler 蔡英文最强助选 习王的田野上 习殡法 习包子 尼哥 刁人13 云视察 独彩者 狙击手待命 头上三尺有神明 孢 万岁 彩色哥 截颈平 包包侠 electron8964 毛二习 小学博士 没有网络安全就没有国家安全 初二圣君 大撒币 鞋哥 nmslese##dream 皇帝亲临忠诚的武汉 习博士 劝进 Adolf##Xitler 习猪席 晚共昏君 包子兵法 迈克尔·索伊 习大 终身领导人 习包皮 庆丰帝的千秋梦 大锅瞻遗 野兽先辈 黑白翠 习大郎 倒车帝 天安门合法继承人 韦来书记 灭共助推器 当皇帝的小丑 包子宪法 修宪 通商宽衣 称帝修宪 庆丰包·勃列日涅夫 Cicada##3301##XD 猪禁评 64岁 包大人 《生物安全法》 习一尊 巴拿马文件 岿然不动 灰习牛 口罩外交 习Core 孤独的毒王 普习金 洗包皮 4中组长 shit禁评 爱新觉罗·近平 中国特色射秽煮疫制度 断崖式下跌 习梦撕 爱新觉罗近平 冠子兵法 家业论 倒车斯基 习语录 哲欣 习三点 刁二将 领袖习澡水 习king 末代皇帝 傻大头 叼斤干 包子露宪 动物森友会 糖尿维尼 中字头组长 乳包文化 包帝巡游 386系统驱动游戏 習敗北 墨索里习 通商宽衣 “登基” 习厉王 那翠化 墙内人 文明其精神 包皇 大国造疫 蹄防 当代秦二世 习皇的新装 梦帝 人民战争 狙击手布阵 习包子 动物庄园 NMSL 粪坑先生 独裁者 亲自指挥 祈翠語言包 清华毕业 学包积极分子 习屎黄 习“甩锅” 习废帝 公车上书 习流氓 第一书记王沪宁 梁家河 禁评的理由 720事件 习是春竹 无限连任 沼气专家 红旗下的蛋 习二卒 裹嘎举吸钢闸门 禁评封号 */
package com.pcdd.sonovel.model;

import lombok.Builder;
import lombok.Data;

/**
 * @author pcdd
 * Created at 2022/5/23
 */
@Data
@Builder
public class SearchResult {

    private Integer sourceId;
    private String url;
    private String bookName;
    private String author;
    private String intro;
    private String category;
    private String latestChapter;
    private String lastUpdateTime;
    private String status;
    private String wordCount;

}