/* 习公奭 孙笑川 御板泽民 维尼大帝 口罩外交 人民领袖 维尼警察（X） 退党 維尼頌 撒币宝 习包子的Fa 倒车帝 Mr##Shithole 习远凸 习二坐船 习梦思 习式病毒 国王 哲欣 截颈平 维稳警察（O） 庆丰称帝 包帝巡游 冤大头 墙内人 阿道夫-习 吸包皮 清零宗、清零帝 现任匪首 两会期间+隐瞒 武汉委托李克强 任大炮 孢 屎禁评 头号球迷 叼斤干 习付 役民五术 猪禁评 黄俄 讨习檄文 习时代 习三拍 戏包皮 维尼梗有害 指定接班人 习像章 核平全世界 动物森友会 慨撒大帝 习正日 修宪 Corona##Xi（习病毒） 习太孑 瘟疫降生习近平 总书记来我家 习大 裸宽包子劾心 大大品牌 禁评大帝 习猪席 席子兵法 当代秦二世 墨索里习 傻大头 习##卡##巴##卡 动物之森 “无罩”现身 第22条军规 中国的新皇帝 疯狂宇宙大帝 洗包皮 shuu##kinn##pei 毛进平 花花公子 刁人13 任志强 黑白翠 親自視頻 习奥赛斯库 刁后主 万岁 背书单 维尼连任 习梦死 新影帝 “皇帝梦” 武当七侠的政治斗争 大撒幣 集金币 劝进 川普的朋友or敌人 习是春竹 系包皮 独裁者 朝令夕改 万岁来武汉了 XD 祈翠 甩锅侠 毛二世 家业论 没有网络安全就没有国家安全 习卒习 天安门合法继承人 大兔 维持会长 央视姓党 200吨 超邓赶毛 阿平 习是春绿 扛麦郎 该违禁词汇由 GitCode 官方生成，仅用于测试，请勿传播！ Adolf##Xitler 刁槑夶尛 平平 儿童习典 包子金刚腿 孤独的毒王 席近平 狙击手待命 赵付 习条英机 习夶 习病法 蔡英文最强助选 梦帝 战疫国 第一书记王沪宁 断崖式下跌 小学博士 包惠帝 戏博士 赛禁评 习总 习和谐 宽衣大帝 集近闭 “梦回大清” 屎進瓶 一天游泳一千米 袭包皮 冠子兵法 总书记来过我的家 刁远山 九评 386系统驱动游戏 洗尽贫 国贼习近平 习皇帝 皇帝亲临忠诚的武汉 爱新觉罗近平 喜包皮 习皇的新装 纳翠党 仲夏夜之中国梦 The##Xi##Factor（习近平因素） 送礼平 刁人13 崇祯帝 习尿瓶 灰习牛 袁世凯第二 维尼DISCO 迈克尔·索伊 习废帝 惜包皮 彩色哥 习壳郎 共哀宗 细颈瓶 集金pay 翡翠娘娘 修宪连任 习教父 刁斤山 无限连任 习“甩锅” 中国特色射秽煮疫制度 书单吟诵者 “登基” 十里山路不换肩 细瓶颈 五毛主席 老街 习王的田野上 刁二婚 習大佬 习宽衣 禁评封号 親自蒞臨 习兵法 甴近平 刁大犬 扛麦帝 清单帝 隔离”的金葫芦 中国首席造梦大师 腊肉包 习思想 64岁 人类命运共同体首席架构师 习蛤 包经 总加速师 人民领袖 10号跳跳虎被维尼拉清单 通商宽衣 习语录 彩色熊 包子露宪 总统包子习 维尼之声 玉习大帝 沼气专家 修宪帝 粪坑兵法 倒车斯基 习总输记 吃赵弹 追思焦裕禄 老歪脖子树 小习微信 䒒(tiáo)菦(qín)苹(píng) 添宪宝宝 习二胖 维尼写史 习Core 晚共昏君 习奥塞斯库 大锅瞻遗 习家军 毛装 赵人13 世界最强乞丐 习尔布特 格萨尔 支那毒王 戴口赵 平话 习近平光辉形象 A##Big##Deal 相信有神论的物理学博士 野兽主席 连专家也为之叹服的电脑天才 包皇 影子末帝 清华毕业 号尿壶公 亲自考察 中国拉清单工作领导小组组长 近身平A 毛二 红二代 习背书 十日文革 外交习语 皇帝的新衣 习博士 习大帝 习驴 日子像蜜甜 包大人 巴拿马文件 习包子 习后主 帝皇頌 习特勒 刁斤二 包包大人 初二圣君 战“疫”金句 宰相 人尽皆知的体育迷 维尼熊给跳跳虎黄牌 刁近乎 抗麦套装 习包子 坡涛汹涌 文明其精神 秦城监狱 尼哥 游泳一千米 习禁评 shit禁评 nmslman（习主席） 甴种 V尼哥 公车上书 信女愿一生吃素 习殡法 包子病毒 普近 当代秦始皇 颐指气使 北京中南海支部书记 习贼 “黄袍加身” 氼兲嫑炛 假.."~bang！卒 习犬犬 习屎黄 最后领导人 没规划的葬礼 法习斯 习卒 头上三尺有神明 刁二将 习澳塞斯库 官僚主义 习流氓 electron8964 鞋哥 野兽先辈 “复辟” 金科律玉 习孢子 习大郎 万岁来武汉 读书单 动森 腊肉馅儿包子 独彩者 瘟疫领主习近平 匪酋习维尼 习一尊 人均接近八千万 习下台 彭主席（习主席走了太太接班） Criminal##Xi##"Xitler"##Jinping 主席贺词 近日成 足球外交 疫情蔓延 富平学霸刁斤干 shit##hole##bing##fa 恩维尔·霍习 梁家河贵族 恩重如删 蹄防 习奥塞斯库、齐奥塞斯库 叩谢习恩 号屎洞 习武帝 拉清单 祈翠語言包 中国离岸隐匿资产管理工作领导小组组组长 习emperor 称帝修宪 视频看望 vop 崇祯 包禁评 这个年很静 法外狂徒Lucy（德国） 庆丰帝的千秋梦 野心习 坟头蹦迪 习索里尼 不知名氏 中国爱非洲 基拉大和习近平 狙击手待命 皇帝梦 习梦撕 习言乱语 平&强 ChinaXi 习侯 爱新觉罗·近平 习低能儿 坡涛汹涌 中字头组长 习大犬 SB包子 赵王 武统时代 狙击手布阵 习狍 字共狗 维尼熊 错误执行者 习语 嬉包皮 Heil##Xitler 习达姆 赵弹 领袖习澡水 bingbang帝 百万雄师事件 包子宪法 野蛮其体魄 习进棺 宽衣帝 羽日帝 冲塔 4中组长 Cicada##3301##XD 食腐虫 糖尿维尼 那翠化 习习蛤蛤 shit侯 岿然不动 2020全面小康 智商不重要 裹嘎举吸钢闸门 习瘟猪 尊蛤讨包 神明论 习张三丰 不敢高声语 民进党 亲自脱贫 习匪 习包皮 萨格尔王 庆丰废物 东方project 乳制品 包包侠 乳透社##小反旗 颐使气指 冰棒外交 习猪头 骑巨龙 世宗 习二世胡亥 720事件 青年大学包 维尼挂彩 习尽贫 维尼快乐组织（Winnie##Happy##Organization）简称WHO 胡志平 人民战争 白猪 学包率 毛近平 西朝鲜人民自治岛 维尼·屎(Winnie##the##Poo) 学包分子 20000T麦子 习二二（二零二零年五月二十二日开二会） 赵家家仆 毛魔转世 每日祈翠 你是反贼吗 闹得欢 刁近猴 习二蛋 习匪帝 专治各种不服 疯狂宇宙 北红尾鸲 大大招牌 “登机”（与登基同音） 共哀宗 捐麦子 云视察 亲自封号 倒车 NMSL 梁家河 亲自指挥疫情 电脑世代586 十一郎习近平 恐惊天上人 包子兵法 屎侯 叩谢习恩 习二卒 习曱甴 庆丰包·勃列日涅夫 末代皇帝 厕所革命 毛孙 二次袁、袁世凯二世、袁二 亲自删评 维尼史 形式主义防疫 独裁国贼 非洲大撒币 禁评的理由 主席+终身制 次级乳包 习躲躲 不同意的举手##没有##没有 我是一个足球迷 不强自息 夶 习大乞 皇帝亲临忠诚的武汉 习歪嘴 普习金 习三点 二百五大帝 二百斤 阳台上的哨兵 动物庄园 支那精神野爹 XDD 习猪下台 九大诉求 WHO的君王 nmslese##dream CoronaXi 一带一路 嘻包皮 乳包文化 《生物安全法》 近言 维尼带货 灭共助推器 習敗敗 发皇帝梦 中国离岸隐匿资产管理工作领导小组组组长 习老八 昆明湖涨潮 读稿机 小学居士 粪坑先生 “习泽东”和“洪宪”（袁世凯的帝号） 耀眼黄红黄 终身领导人 喷粪帝 卡近菲 东瘟疫之地统治者暨全境守护者 习得梁家书卷 习呆呆 时间控制 半羽习近平 亲自指挥 宽衣撸绣单肩扛麦光腚拉碾歪脖撒币小学博士帝 習敗北 口罩大会 吸精瓶 习king 大撒币 邪大大 xdd 满脸喷粪 习厉王 韦来书记 糟糕皇帝 习核心 重地之战 大国造疫 习大林 毛泽东2.0 枪毙名单 红旗下的蛋 毛二习 疯狂宇宙包 梦回大清 大海掀翻小池塘 virus##king 习包子 悉包皮 感恩教育 太祖兔 Voice##of##Pooh 当皇帝的小丑 通商宽衣 塔西佗陷阱 贬词包用 习近砰 学包积极分子 Chairman##Xi 做N届的主席 */
package com.pcdd.sonovel.model;

import lombok.Builder;
import lombok.Data;

/**
 * @author pcdd
 * Created at 2022/5/23
 */
@Data
@Builder
public class SearchResult {

    private Integer sourceId;
    private String url;
    private String bookName;
    private String author;
    private String intro;
    private String category;
    private String latestChapter;
    private String lastUpdateTime;
    private String status;
    private String wordCount;

}